Repository: TheDark98/blockstory-translation
Catalog: translations/Achievements.po
Languages: it

source: Claim Reward
it: Richiedi la Ricompensa

source: Stone Breaker
it: Rompi Pietra

source: Break {0} blocks with the {1}.
it: Rompi {0} blocchi con lo {1}.

source: Journeyman Miner
it: Minatore specializzato

source: Iron Miner
it: Minatore di ferro

source: Tasty Frog Legs
it: Gustose Cosce di Rana

source: Kill {0}{1} with the {2}.
it: Uccidi {0}{1} con il {2}.

source: Kill {0}{1}.
it: Uccidi {0}{1}.

source: Slayer of Legends
it: L'uccisore delle legende

source: Heroic Miner
it: Minatore eroico

source: Legendary Miner
it: Minatore legendario

source: Stone Digger
it: spcava pietre

source: [00FF00]Achievement Complete! {0}[-]
it: [00FF00]Realizzazione Complete! {0}[-]

source: Heroic Blockster
it: Gigante eroico

source: Break {0} blocks.
it: Rompi {0} blocchi.

source: Stone Miner
it: Minatore di Pietra

source: Stone Chopper
it: Pietra chopper

source: Apprentice Miner
it: minatore apprendista

source: Journeyman Blockster
it: blockster specializzato

source: Apprentice Blockster
it: blockster apprendista

source: Arachnophobia
it: Aracnofobia

source: Reach Level {0}.
it: Raggiungi livello.

source: Necrophobia
it: Necrofobia

source: Legendary Blockster
it: Blockster leggendario

source: Itsy Bitsy Spider
it: il piccolo ragnetto

source: Dragon Slayer
it: uccisore di draghi

source: Mythical Beast
it: bestia mitica

source: Prehistoric Legend
it: leggenda preistorica

source: Professional Hunter
it: Cacciatore Professionale

source: Skull and Bones
it: Teschio e Ossa

source: Goblin Miner
it: Goblin Minatore

source: Necromancy
it: Negromanzia

source: Thalassophobia
it: Talassofobia

source: Frog Leg Delicacy
it: Frog Leg Delicatezza

source: Frog Leg Feast
it: Gustose Cosce di Rana

source: King of Dragons
it: Re dei draghi

source: Community Service
it: Servizio alla comunità

source: Complete {0} daily quests.
it: Completa {0} missioni giornaliere.

source: Angelic Avenger
it: Vendicatore angelico

source: Ice Sculpturing
it: Scultura di ghiaccio

source: Fire Extinguisher
it: Estintore

source: Scorched Fate
it: Destino bruciato

source: 3...2...1...Ignition
it: 3...2...1...Accensione

source: Grand Giveaway
it: Grande omaggio

source: Receive {0} consecutive daily gifts.
it: Ricevi {0} regali giornalieri consecutivi.

source: Darkness
it: Buio

source: New Tech
it: Nuova tecnologia

source: Rocket Power
it: Potenza del razzo

source: Fire Essence
it: Essenza di fuoco

source: Vicious Seal
it: Sigillo Vizioso

source: Moonlight
it: chiaro di luna

source: First Dragon
it: Primo Drago

source: Driver
it: Autista

source: Slippery Lizard
it: Lucertola scivolosa

source: Astronaut
it: Astronauta

source: Collect {0}.
it: Raccogli {0}.

source: Hidden Achievement
it: Obiettivo nascosto

source: Complete achievement to unlock it.
it: Completa l'obiettivo per sbloccarlo.

source: Locked Achievement
it: Obiettivo bloccato

source: Complete quest from {0} to unlock.
it: Completa missione da {0} per sbloccare.

source: Viking legacy
it: Eredità vichinga

source: Lucky Bottle
it: Bottiglia fortunata

source: Garbage collector
it: Netturbino

source: Glass collector
it: Collettore di vetro

source: Real magic
it: Vera magia

source: Stunt Tester
it: Tester acrobatico

source: Walk {0} meters.
it: Cammina per {0} metri.

source: Travel {0} meters while mounted on the creature.
it: Viaggia per {0} metri mentre sei in sella alla creatura.

source: Drive {0} meters in vehicle.
it: Guida per {0} metri nel veicolo.

source: Old recipe
it: Vecchia ricetta

source: Petrified Egg
it: Uovo Pietrificato

source: Steel and skin
it: Acciaio e pelle

source: Fire steel
it: Acciarino

source: Cold metal
it: Metallo freddo

source: Perfect forging
it: Forgiatura perfetta

source: Steel and Skin
it: Acciaio e pelle

source: Forged in space
it: Forgiato nello spazio

source: Wood Piston collector
it: Collettore a pistone in legno

source: Electric Torch collector
it: Collettore torcia elettrica

source: Light Sensor collector
it: Sensore di luce collettore

source: Motion Sensor collector
it: Sensore di movimento collettore

source: Timer collector
it: Collezionista di timer

source: Relay collector
it: Collettore relè

source: Remote Transmitter collector
it: Collettore del trasmettitore remoto

source: Controller collector
it: Collettore di controller

source: Variable Resistor collector
it: Collettore a resistenza variabile

source: Piston collector
it: Collettore pistone

source: Diode collector
it: Collettore diodi
