Repository: TheDark98/blockstory-translation
Catalog: translations/FemaleWarrior.po
Languages: it

source: Ancient legends say that the world from which you just returned is their homeland. That once, very long ago, they flew from there in a large flying ship that could fly in the sky without the help of magic. They were prisoners and outcasts in their homeland, but they managed to escape from there to our world. At first, they landed on the Heavenly islands, but there lived a mighty Ashkor, whom they were very afraid of. Therefore, they decided to go down to the ground. Some of them still remained on the Heavenly islands to be closer to their homeland, the rest flew down...
it: Antiche leggende dicono che il mondo da cui sei appena tornato è la loro patria. Che una volta, molto tempo fa, volarono da lì in una grande nave volante che poteva volare nel cielo senza l'aiuto della magia. Erano prigionieri ed emarginati nella loro patria, ma sono riusciti a fuggire da lì nel nostro mondo. All'inizio sbarcarono sulle isole celesti, ma viveva un potente Ashkor, di cui avevano molta paura. Pertanto, hanno deciso di scendere a terra. Alcuni di loro sono rimasti ancora sulle isole Celesti per essere più vicini alla loro patria, gli altri sono volati giù...

source: But their flying ship fell into the sea and sank. They say that it is still there. Eccentric Ted even claims that once, when he was fishing on a clear sunny day and the sea was especially calm, he saw its outlines through the water, but no one believes him. But the visitors who were on the ship did not die. At first, they built underwater domes and lived in them, rising to the surface only at night, since the light of the sun was destructive for them. But once they managed to get an unusual substance - a mutagen. With the help of it, they found the opportunity to live on the surface.
it: Ma la loro nave volante cadde in mare e affondò. Dicono che sia ancora lì. L'eccentrico Ted afferma anche che una volta, mentre stava pescando in una limpida giornata di sole e il mare era particolarmente calmo, ne vide i contorni attraverso l'acqua, ma nessuno gli crede. Ma i visitatori che erano sulla nave non sono morti. All'inizio costruirono cupole sottomarine e vi abitarono, salendo in superficie solo di notte, poiché la luce del sole era distruttiva per loro. Ma una volta sono riusciti a ottenere una sostanza insolita: un mutageno. Con l'aiuto di esso, hanno trovato l'opportunità di vivere in superficie.

source: Not all visitors resolved upon a bold experiment, some of them remained underwater in glass domes. The rest settled on ice, away from people and predatory animals, and live a peaceful life. We humans do not like talking to them, and only Alchemist conducts trade with them.
it: Non tutti i visitatori si sono risolti in un esperimento audace, alcuni di loro sono rimasti sott'acqua in cupole di vetro. Il resto si è stabilito sul ghiaccio, lontano da persone e animali predatori, e vive una vita pacifica. A noi umani non piace parlare con loro, e solo l'Alchimista fa affari con loro.

source: But why do I tell you all this? Fuza, hearing about your trip (of course it was Alchemist who chatted with them about it) were very happy. They said that their people, which they left, and who, they hope, still live in the endless Mushroom Wetlands, have a relic that they call The Miracle Stone. This stone is not only beautiful but also has unique properties that will help us create equipment with which you can stay in an alien world for as long as you want without any harm to health.
it: Ma perché ti dico tutto questo? Fuza, avendo saputo del tuo viaggio (ovviamente è stato Alchemist a parlarne con loro) sono stati molto contenti. Hanno detto che la loro gente, che hanno lasciato e che, sperano, viva ancora nelle infinite zone umide dei funghi, ha una reliquia che chiamano La Pietra Miracolosa. Questa pietra non è solo bella, ma ha anche proprietà uniche che ci aiuteranno a creare attrezzature con cui potrai rimanere in un mondo alieno per tutto il tempo che desideri senza alcun danno alla salute.

source: They asked you to get this relic for them so that they could keep it in memory of their abandoned homeland. But they left their homeland so long ago that none of them remember exactly where this relic is stored. They only know that this stone must be sought in one of the mushroom houses in the settlements of Umhi in the Mushroom Wetlands. But be careful, they said, this relic is not so easy to pick up. I do not know what these words mean, you have to figure it out by yourself.
it: Ti hanno chiesto di procurare loro questa reliquia in modo che potessero conservarla in memoria della loro patria abbandonata. Ma hanno lasciato la loro patria così tanto tempo fa che nessuno di loro ricorda esattamente dove è conservata questa reliquia. Sanno solo che questa pietra deve essere cercata in una delle case dei funghi negli insediamenti di Umhi nelle zone umide dei funghi. Ma attenzione, dicevano, questa reliquia non è così facile da raccogliere. Non so cosa significano queste parole, devi capirlo da solo.

source: Spacesuit
it: Tuta spaziale

source: How beautiful this stone is, the relic of Umhi! Now you can create the equipment for a new trip to an alien world.
it: Com'è bella questa pietra, la reliquia di Umhi! Ora puoi creare l'equipaggiamento per un nuovo viaggio in un mondo alieno.

source: Your armor seems to me not strong enough to fight a flamy bird. But is there any armor that can withstand the onslaught of the Phoenix? While you wandered in search of the Umhi relic, the goblin, who also wanted to help you, studied many ancient legends in search of an answer to this question. He spent days and nights in a desert tower, where a lot of old books are kept, and finally, in one very old book, he found mention of armor that would help you withstand this fight.
it: La tua armatura mi sembra non abbastanza forte per combattere un uccello fiammeggiante. Ma c'è qualche armatura in grado di resistere all'assalto della Fenice? Mentre vagavi alla ricerca della reliquia Umhi, il goblin, che voleva anche aiutarti, ha studiato molte antiche leggende alla ricerca di una risposta a questa domanda. Ha trascorso giorni e notti in una torre nel deserto, dove sono conservati molti libri antichi, e infine, in un libro molto antico, ha trovato menzione di armature che ti avrebbero aiutato a resistere a questa battaglia.

source: This book says that in that part of the outside world where huge trees grow and a flamy bird lives, you can find huge pyramids and temples hidden in the thicket of the forest. These are the buildings of the ancient disappeared people who lived there long before the advent of Umhi and Dagi. No one knows who the builders of these pyramids really were. The book mentions that they called themselves Maya, but I do not know whether to believe it or not.
it: Questo libro dice che in quella parte del mondo esterno dove crescono enormi alberi e vive un uccello fiammeggiante, puoi trovare enormi piramidi e templi nascosti nel folto della foresta. Questi sono gli edifici dell'antico popolo scomparso che vi abitava molto prima dell'avvento di Umhi e Dagi. Nessuno sa chi fossero veramente i costruttori di queste piramidi. Il libro dice che si chiamavano Maya, ma non so se crederci o no.

source: The residents, inhabitants of amber houses, try to circumvent the pyramids and never go inside. According to their beliefs, everyone who dares to go into the pyramid will surely die. Many daredevils tried to penetrate these ancient structures, but none of them came back. Also, each pyramid is guarded by numerous and ferocious dreamcats.
it: I residenti, abitanti delle case d'ambra, cercano di aggirare le piramidi e non entrano mai. Secondo le loro convinzioni, chiunque osi entrare nella piramide morirà sicuramente. Molti temerari hanno cercato di penetrare in queste antiche strutture, ma nessuno di loro è tornato. Inoltre, ogni piramide è sorvegliata da numerosi e feroci gatti dei sogni.

source: I hope you won’t be afraid of some cats, even big ones, and you won’t believe the superstitions of forest aborigines, right? Because it is there, in the cache of one of these pyramids, that what we need is located, the unusual amber block, which we need to create a new durable armor.
it: Spero che non avrai paura di alcuni gatti, anche grandi, e non crederai alle superstizioni degli aborigeni delle foreste, giusto? Perché è lì, nel nascondiglio di una di queste piramidi, che si trova ciò di cui abbiamo bisogno, l'insolito blocco d'ambra, di cui abbiamo bisogno per creare una nuova armatura durevole.

source: Unfortunately, the book in which Goblin read all this is badly damaged by the time, and it is impossible to read the description of the pyramid in which the cache with the amber block is located.
it: Sfortunatamente, il libro in cui Goblin ha letto tutto questo è gravemente danneggiato dal tempo ed è impossibile leggere la descrizione della piramide in cui si trova la cache con il blocco d'ambra.

source: You have to find the necessary pyramid among others and find the path to the cache in it.
it: Devi trovare la piramide necessaria tra le altre e trovare il percorso per la cache in essa contenuta.

source: The Amber Armor
it: L'armatura d'ambra

source: Surprisingly, you did it! You found the amber block in these terrible pyramids! Perhaps you are the first who did this and returned alive. However, I always suspected that ancient legends are dramatizing everything.
it: Sorprendentemente, ce l'hai fatta! Hai trovato il blocco d'ambra in queste terribili piramidi! Forse sei il primo che ha fatto questo ed è tornato vivo. Tuttavia, ho sempre sospettato che le antiche leggende drammatizzassero tutto.

source: Alchemist searching for you. Go check him. It looks like he knows how to get Amber Bricks recipe from Fuza. Then come back to me, I have an important task for you.
it: Alchimista alla ricerca di te. Vai a controllarlo. Sembra che sappia come ottenere la ricetta dei mattoni d'ambra da Fuza. Allora torna da me, ho un compito importante per te.

source: Work with Alchemist until you get Amber Bricks recipe.
it: Lavora con Alchemist finché non ottieni la ricetta dei mattoni d'ambra.

source: The Flamy Bird
it: L'uccello fiammeggiante

source: How is your progress in getting a recipe from Fuza?
it: Come sono i tuoi progressi nell'ottenere una ricetta da Fuza?

source: I already told you that only the one who defeats the Phoenix can subjugate the Red dragon. Now when you have everything you need, it's time for a decisive battle. But this struggle will not be easy. To call on the Phoenix you need to find its egg and break it. Only a very strong warrior such as you can break the egg of a Flamy bird. Dying, the Phoenix can reborn again and again. Its crushing power increases with its every revival, and when it becomes very strong, the fire begins to fall from its wings...
it: Ti ho già detto che solo chi sconfigge la Fenice può soggiogare il Drago Rosso. Ora che hai tutto ciò di cui hai bisogno, è il momento di una battaglia decisiva. Ma questa lotta non sarà facile. Per chiamare la Fenice devi trovare il suo uovo e romperlo. Solo un guerriero molto forte come te può rompere l'uovo di un uccello Flamy. Morendo, la Fenice può rinascere ancora e ancora. Il suo potere schiacciante aumenta ad ogni suo risveglio, e quando diventa molto forte, il fuoco inizia a cadere dalle sue ali...

source: I see you are a little pale, ha? Perhaps I’m telling you all this in vain, but you should be prepared for what you’ll see. But don't let us waste time. Return to the primeval jungle, the kingdom of the Phoenix, find it and fight with it. I believe in your victory because you are the greatest warrior of all that I know.
it: Vedo che sei un po' pallido, eh? Forse ti sto dicendo tutto questo invano, ma dovresti essere preparato per quello che vedrai. Ma non perdiamo tempo. Torna nella giungla primordiale, il regno della Fenice, trovalo e combatti con esso. Credo nella tua vittoria perché sei il più grande guerriero di tutto ciò che conosco.

source: To call on the Phoenix you need to find its egg and break it. Only a very strong warrior such as you can break the egg of a Flamy bird. Dying, the Phoenix can reborn again and again. Its crushing power increases with its every revival, and when it becomes very strong, the fire begins to fall from its wings...
it: Per chiamare la Fenice devi trovare il suo uovo e romperlo. Solo un guerriero molto forte come te può rompere l'uovo di un uccello Flamy. Morendo, la Fenice può rinascere ancora e ancora. Il suo potere schiacciante aumenta ad ogni suo risveglio, e quando diventa molto forte, il fuoco inizia a cadere dalle sue ali...

source: Have you found all the hearts?
it: Hai trovato tutti i cuori?

source: Have you found this beautiful stone?
it: Hai trovato questa bellissima pietra?

source: I knew that you would win, I always believed in you. Now you can tame the Fire dragon and your strength will increase even more. I am sure you will get along well with each other.
it: Sapevo che avresti vinto, ho sempre creduto in te. Ora puoi domare il drago di fuoco e la tua forza aumenterà ancora di più. Sono sicuro che andrete d'accordo l'uno con l'altro.

source: You have to get the last, most powerful dragon. We do not need to tame it, because I am sure that this is my favorite dragon, my Xordaraxus. Are you asking me why I won’t leave him to myself because I loved him so much and grieved for his loss?
it: Devi prendere l'ultimo drago più potente. Non abbiamo bisogno di domarlo, perché sono sicuro che questo è il mio drago preferito, il mio Xordaraxus. Mi stai chiedendo perché non lo lascio a me stesso perché lo amavo così tanto e mi addoloravo per la sua perdita?

source: After the dark spell of the Lord, Xordaraxus became so strong that his power and strength frighten me. I am afraid that I will not be able to deal with him. You are stronger than me, Dragon Rider, and only you are worthy to own this dragon. I know you for a long time, we have experienced a lot together, but still, I want to make sure that your strength is sufficient to wield all these dragons.
it: Dopo l'incantesimo oscuro del Signore, Xordaraxus è diventato così forte che il suo potere e la sua forza mi spaventano. Ho paura di non essere in grado di trattare con lui. Sei più forte di me, Dragon Rider, e solo tu sei degno di possedere questo drago. Ti conosco da molto tempo, abbiamo sperimentato molto insieme, ma voglio comunque assicurarmi che la tua forza sia sufficiente per maneggiare tutti questi draghi.

source: You have already visited the Mushroom Wetlands in search of the Umhi relic, but did you know that the terrible creature Swamp Golem lives there? They say that he has a stone heart, his body is armor and he is so strong that he can kill a person with one hit. If you could defeat this terrible monster, then I would not doubt about your strength.
it: Hai già visitato le Mushroom Wetlands alla ricerca della reliquia Umhi, ma sapevi che la terribile creatura Swamp Golem vive lì? Dicono che abbia un cuore di pietra, che il suo corpo sia un'armatura ed è così forte che può uccidere una persona con un colpo. Se potessi sconfiggere questo terribile mostro, non dubiterei della tua forza.

source: If you could defeat this terrible monster, then I would not doubt about your strength.
it: Se potessi sconfiggere questo terribile mostro, non dubiterei della tua forza.

source: Incredible, you did it! You defeated the terrible Swamp Golem! How powerful you are, Dragon Rider, now I'm sure I can trust you with my beloved Xordaraxus.
it: Incredibile, ce l'hai fatta! Hai sconfitto il terribile Swamp Golem! Quanto sei potente, Dragon Rider, ora sono sicuro di poterti fidare del mio amato Xordaraxus.

source: We have completed our quest, and all three dragons are now yours. I am sure that they will be well under your protection, and they will become your faithful friends and helpers. And I am very glad that Xordaraxus will be with you too.
it: Abbiamo completato la nostra missione e ora tutti e tre i draghi sono tuoi. Sono sicuro che saranno ben sotto la tua protezione e diventeranno tuoi fedeli amici e aiutanti. E sono molto contento che anche Xordaraxus sarà con te.

source: Now it's time to train Xordaraxus so it reaches his maximum power. Just like in old good days.
it: Ora è il momento di addestrare Xordaraxus in modo che raggiunga la sua massima potenza. Proprio come ai vecchi tempi.

source: How big and strong Xordaraxus became, how beautiful he is, just like in the good old days, when we flew with him under the clouds. I will miss him, although I understand that he will feel better with you.
it: Com'è diventato grande e forte Xordaraxus, com'è bello, proprio come ai bei vecchi tempi, quando volavamo con lui sotto le nuvole. Mi mancherà, anche se capisco che si sentirà meglio con te.

source: Now when you have gained power over the dragons, your strength has increased manifold. But I must warn you. Not everyone will be able to withstand the burden of such power, the temptation to use your power for evil will always accompany you. You may not be able to cope with yourself, as the Lord, and the dark forces prevailed over him. Whether you fall for temptations or resist, I do not know. But I know that this incredible power can drive a person crazy, as it did to the Dragon Lord.
it: Ora, quando hai acquisito potere sui draghi, la tua forza è aumentata molte volte. Ma devo avvertirti. Non tutti saranno in grado di sopportare il peso di tale potere, la tentazione di usare il tuo potere per il male ti accompagnerà sempre. Potresti non essere in grado di farcela con te stesso, poiché il Signore e le forze oscure hanno prevalso su di lui. Se cadi per le tentazioni o resisti, non lo so. Ma so che questo incredibile potere può far impazzire una persona, come ha fatto con il Signore dei Draghi.

source: You have to choose your own path. I want to hope that we will see each other again. But just in case, goodbye, Dragon Rider.
it: Devi scegliere la tua strada. Voglio sperare che ci rivedremo. Ma per ogni evenienza, arrivederci, Dragon Rider.

source: You feel how power begins to overwhelm you. Talk to the Dragon Lord to dispel your doubts once and for all.
it: Senti come il potere inizia a sopraffarti. Parla con il Signore dei Draghi per dissipare i tuoi dubbi una volta per tutte.

source: I knew that you would return, even though I had doubts because only a person of incredible willpower could resist the temptation of unlimited power, but in my heart, I always believed in you. Now we will get done with the Dragon Lord forever because this world has a protector no less powerful than him.
it: Sapevo che saresti tornato, anche se avevo dei dubbi perché solo una persona di incredibile forza di volontà poteva resistere alla tentazione di un potere illimitato, ma nel mio cuore, ho sempre creduto in te. Ora avremo finito con il Signore dei Draghi per sempre perché questo mondo ha un protettore non meno potente di lui.

source: It remains only to cleanse our world from a terrible creature, a creature of darkness, which appears every night of nowhere and creates many troubles. You can’t hide from him anywhere, and his name is usually mentioned only in a whisper.
it: Resta solo da purificare il nostro mondo da una terribile creatura, una creatura delle tenebre, che appare ogni notte dal nulla e crea molti problemi. Non puoi nasconderti da lui da nessuna parte e il suo nome di solito è menzionato solo in un sussurro.

source: The Dark Spirit
it: Lo spirito oscuro

source: He came to us from another world, for a long time he only watched, without interfering in the life of people. And only his eyes, which sometimes appeared in the night sky, were terrifying. But then he showed up to people, and there was no salvation from him. Perhaps the dark spell of the Lord called him. He is an evil that appears at night and for which there are no barriers. This is an evil dark spirit that claimed many lives and his name is Mati.
it: È venuto da noi da un altro mondo, per molto tempo ha solo guardato, senza interferire nella vita delle persone. E solo i suoi occhi, che a volte apparivano nel cielo notturno, erano terrificanti. Ma poi si è presentato alla gente e non c'era salvezza da lui. Forse l'oscuro incantesimo del Signore lo ha chiamato. È un male che appare di notte e per il quale non ci sono barriere. Questo è uno spirito malvagio e oscuro che ha mietuto molte vite e il suo nome è Mati.

source: He is covered with evil spells and ordinary weapons are powerless against him. Only magic spells can defeat this monster. I know your strength is great, but it won't hurt you to arm better. Take this staff, it will help you kill this evil spirit.
it: È coperto di incantesimi malvagi e le armi ordinarie sono impotenti contro di lui. Solo gli incantesimi magici possono sconfiggere questo mostro. So che la tua forza è grande, ma non ti farà male armarti meglio. Prendi questo bastone, ti aiuterà a uccidere questo spirito malvagio.

source: Now go and clear this world from this evil spirit.
it: Ora vai e libera questo mondo da questo spirito malvagio.

source: Finally, it is finished with this terrible creature, which everyone was so afraid of! You cleansed our land of evil and chose the hard path of the protector of this world. Legends will be composed of your exploits.
it: Finalmente è finita con questa terribile creatura, di cui tutti avevano tanta paura! Hai purificato la nostra terra dal male e hai scelto il duro sentiero del protettore di questo mondo. Le leggende saranno composte dai tuoi exploit.

source: Take good care of your dragons, train and mentor them, because evil can come back at any moment. Good luck, Dragon Rider, maybe we'll meet again and I will reveal to you new secrets of our world.
it: Prenditi cura dei tuoi draghi, addestrali e guidali, perché il male può tornare in qualsiasi momento. Buona fortuna, Dragon Rider, forse ci rivedremo e ti svelerò nuovi segreti del nostro mondo.

source: It is time to hit the road, but follow my advice - leave your pets at home, they can’t survive in a strange cruel world. Only the Mechanical pet and Mati pet could accompany you on this journey.
it: È ora di mettersi in viaggio, ma segui il mio consiglio: lascia i tuoi animali domestici a casa, non possono sopravvivere in uno strano mondo crudele. Solo l'animale domestico meccanico e l'animale domestico Mati potrebbero accompagnarti in questo viaggio.

source: Ancient legends say that the world from which you just returned is their homeland. That once, very long ago, they flew from there in a large flying ship that could fly in the sky without the help of magic. They were prisoners and outcasts in their homeland, but they managed to escape from there to our world. At first, they landed on the Heavenly islands, but there lived a mighty Ashkore, whom they were very afraid of. Therefore, they decided to go down to the ground. Some of them still remained on the Heavenly islands to be closer to their homeland, the rest flew down...
it: Antiche leggende dicono che il mondo da cui sei appena tornato è la loro patria. Che una volta, molto tempo fa, volarono da lì in una grande nave volante che poteva volare nel cielo senza l'aiuto della magia. Erano prigionieri ed emarginati nella loro patria, ma sono riusciti a fuggire da lì nel nostro mondo. All'inizio sbarcarono sulle isole celesti, ma viveva un potente Ashkore, di cui avevano molta paura. Pertanto, hanno deciso di scendere a terra. Alcuni di loro sono rimasti ancora sulle isole Celesti per essere più vicini alla loro patria, gli altri sono volati giù...
