Repository: TheDark98/blockstory-translation
Catalog: translations/FemaleWarrior.po
Languages: it

source: Dragon Boots
it: Gli stivali del drago

source: Do not blame yourself. None of us saw through the Dragon Lord’s ruse. I feel so foolish.
it: Non te la prendere con te stesso. Nessuno di noi ha visto lo stratagemma del Dragon Lord. Mi sento così sciocco.

source: When the dragons abandoned the Dragon Lord, they took his power with them. In his weakened state he had no choice but to rely on someone else for help. Someone powerful. Someone...like you.
it: Quando i draghi abbandonarono il Signore Drago, ne presero il potere. Nel suo stato indebolito egli non ebbe altra scelta che affidarsi a qualcun altro per un aiuto. Qualcuno potente. Qualcuno...come te.

source: Speak to Paula about the Wizard's betrayal.
it: Parla a Paula a proposito del tradimento del Mago.

source: With the last of his magic, the Dragon Lord concealed himself with a glamer, taking on the appearance of a weak old man. He then used you to do his bidding, to bring his dragons home, and make him more powerful than ever. He tricked you. We were all fooled.
it: Con la sua ultima magia, il Signore Drago nascose se stesso con bagliore, prendendo le sembianze di un debole e vecchio uomo. Quindi ti usò per fare la sua scommessa, per portare i suoi draghi a casa, e farsi più potente che mai. Ti ha ingannato. Siamo stati tutti ingannati.

source: Our mission remains the same. Stop the Dragon Lord at all costs. To stand a chance against his power, you will need equipment that befits a Dragon Rider. I can help you to get started.
it: La nostra missione resta la stessa. Fermare il Signore Drago a tutti i costi. Per avere una possibilità contro il suo potere, avrai bisogno dell'equipaggiamento che si addice ad un Cavaliere Drago. Ti posso aiutare ad iniziare.

source: To think I had a hand in helping that monster, after what he did to me and my dragon. Craft the Dragon Boots to stand a chance against the Dragon Lord.
it: Pensare che ho dato una mano ad aiutare quel mostro, dopo quel che ha fatto a me ed al mio drago, Crea gli Stivali del Drago per avere una possibilità contro il Signore Drago.

source: Tell Paula you have crafted the Dragon Boots.
it: Dì a Paula che hai creato gli Stivali del Drago.

source: Buckle on those boots, Dragon Rider. There is still more to do.
it: Allaccia quegli stivali, Cavaliere di Drago. C'è ancora molto da fare.

source: The next piece of dragon gear takes inspiration from Nordic design. I think you know where to go. My dear friend, please be swift. You must make the Dragon Lord pay for his treachery.
it: Il prossimo pezzo dell'ingranaggio del drago prende ispirazione dal design Nordico. Penso tu sappia dove andare. Mio caro amico, per favore sii rapido. Devi farla pagare al Signore Drago per questo tradimento.

source: Speak to Ted about the next piece of dragon gear.
it: Parla a Ted a proposito del prossimo pezzo dell'ingranaggio del drago.

source: Oh it’s good to see you! How does your dragon fare today? Would you show me the kindness of acquiring some Dragonscale for me? My hope is to use it to assemble a fantastic new weapon.
it: Oh è bello vederti! Come se la cava oggi il tuo drago? Mi mostreresti la gentilezza di procurarmi un po' di Scaglie di Drago? La mia speranza è di usarlo per assemblare una nuova fantastica arma.

source: I know that Dragonscale is not easy to acquire, but you are the Dragon Rider, after all.
it: So che Dragonscale non è facile da acquisire, ma tu sei il Dragon Rider, dopotutto.

source: Thank you so much! Bring more tomorrow and I will continue work on my new weapon.
it: Grazie molte! Portane di più domani e continuerò a lavorare sulla mia nuova arma.

source: That should do it! Oh, Dragon Rider, feast your eyes on this beauty!
it: Questo dovrebbe farlo! Oh, Dragon Rider, goditi gli occhi con questa bellezza!

source: Dragon Rider
it: Cavaliere di Drago

source: Dragon Rider! This is a pleasant surprise. It has been too long.
it: Cavaliere di Drago! Questa è una piacevole sorpresa. E' passato tanto tempo.

source: It fills me with warmth to see you and your dragon. I’ve missed you both so. As for your mission, only through combat and rigorous training will your dragon grow stronger.
it: Mi riempie di calore vedere te ed il tuo drago. Mi siete mancati entrambi. Come per la tua missione, solamente attraverso il combattimento e un rigoroso allenamento il tuo drago crescerà forte.

source: I smile when I think of your arrival in this land so long ago. You’ve grown so much since then – and your dragon too, of course. When you are able to ride your dragon, speak to me again.
it: Sorrido quando penso al tuo arrivo su questa terra tanto tempo fa. Sei cresciuto così tanto da allora — ed anche il tuo drago, naturalmente. Quando sarai in grado di cavalcare il tuo drago, parla ancora con me.

source: Craft a Saddle and mount the dragon.
it: Crea una Sella e monta il drago.

source: Amazing! Truly, you have earned the name Dragon Rider.
it: Fantastico! Veramente, ti sei guadagnato il nome di Cavaliere di Drago.

source: Tell Paula you can ride the dragon.
it: Dì a Paula che puoi cavalcare il drago.

source: I sense the Dragon Lord’s presence. He is closer than I have felt in a long time. My prayers are with you. I only wish we could fly dragons side by side. Return to the Wizard and complete your quest.
it: Percepisco la presenza delSignore Drago. E' più vicino di quando lo sentii tanto tempo fa. Le mie preghiere sono con te. Desidero solo cheu ed io te possiamo volare sul drago spalla a spalla. Ritorna dal Mago e completa la tua ricerca.

source: Dragon Training
it: Allenamente del Drago

source: So you wish to train this lizard whelp and take on the Dragon Lord? Hey, it's your funeral.
it: Così desideri allenare questo cucciolo di lucertola e affrontare il Signore Drago? Hey, è il tuo funerale.

source: Killing powerful monsters is the fastest way to strengthen your dragon. As your dragon defeats monsters, it will level up and eventually grow into a magnificent creature. Find some werewolves and put an end to their terror. Werewolves live in the mountains with the sequoia trees.
it: Uccidere potenti mostri è il modo più veloce per rafforzare il tuo drago. Così il tuo drago sconfigge i mostri, sale di livello ed alla fine diventa una magnifica creatura. Trova alcuni lupi mannari e poni fine al loro terrore. I lupi mannari vivono in montagna tra gli alberi di sequoia.

source: I'm happy to help you. The Dragon Lord killed . . . many people. He needs to pay. But first find some werewolves and put an end to their terror. Werewolves live in the mountains with the sequoia trees.
it: Sono felice di aiutarti. Il Signore Drago ha ucciso...molte persone. Deve pagarla. Ma prima trova un po' di lupi mannari e metti fine al loro terrore. I lupi mannari vivono in montagna tra gli alberi di sequoia.

source: Tell Paula that you have slain the werewolves.
it: Dì a Paula che hai ucciso i lupi mannari.

source: Now that you have killed some of the werewolves, your dragon could use some more intense training. It will need to be able to defeat even more powerful monsters before you will have a chance to defeat the Dragon Lord.
it: Ora che hai ucciso un po' di lupi mannari, il tuo drago può avere qualche allenamento più intenso. Dovrà essere in grado di sconfiggere persino i mostri più potenti, prima che tu possa avere l'occasione di sconfiggere Signore Drago.

source: Your dragon grows stronger by the day. When dragons get big enough, you can ride them into battle. For now, you must fight to make the dragon stronger. There are even more powerful werewolves with black fur that lurk in the mountains. Find some of these black werewolves and put an end to their wickedness.
it: Il tuo drago cresce giorno per giorno sempre più forte. Quando i draghi diventano abbastanza grandi, li puoi cavalcare in battaglia. Per adesso devi combattere per rendere il drago più forte. Ci sono persino lupi mannari più potenti con la pelliccia nera che stanno in agguato nelle montagne. Trova qualcuno di questi lupi mannari neri e metti fine alle loro malvagità.

source: Seeing you and your dragon work together as a team brings a smile to my face. Dragons are majestic creatures, aren't they? So strong. So wise. I wish they were all as friendly as yours. But your dragon still needs training. Find some black werewolves and put an end to their wickedness.
it: Vedere te ed il tuo drago lavorare insieme dona un sorriso al mio viso. I draghi sono creature maestose, non è vero? Così forti. Così saggi. Mi piacerebbe che fossero tutti amichevoli come il tuo. Ma il tuo drago ha bisogno ancora di allenarsi.Trova qualche lupo mannaro nero e metti fine alla loro malvagità.

source: Tell Paula that you have slain the black werewolves.
it: Dì a Paula che hai ucciso i lupi mannari neri.

source: Some say the Dragon Lord's evil power draws monsters to this place and makes them violent. The faster you defeat them, the faster more appear. But still, every little bit helps. Good work.
it: Qualcuno dice che il potere malefico del Signore Drago attrae i mostri di questo posto e li rende violenti. Più velocemente li sconfiggi, più numerosi appaiono. Ma tuttavia ogni piccolo sforzo aiuta. Buon lavoro.

source: Find Paula a pet spider.
it: Trova un ragno domestico per Paula.

source: It is nice to see you and your dragon getting along so well. But the truth is, seeing you two reminds me of my grief. Perhaps you guessed that I too was once a dragon rider. Xordaraxus, that was my dragon's name. And what a beautiful dragon he was, long necked and majestic, with scales like polished ebony. Oh I miss him so. Even more than flying among the clouds, I miss the companionship. My dragon was my dearest friend.
it: E' bello vedere te e il tuo drago andare così d'accordo. Ma la verità è, che vederti mi ricorda la mia pena. Forse hai indovinato sul fatto che anche io una volta cavalcavo draghi. Xordaraxus, questo era il nome del mio drago. E che bel drago che era, dal collo lungo e maestoso, con le scaglie come ebano lucente. Oh mi manca così tanto. Persino più del volare tra le nuvole, mi manca la sua compagnia. Il mio drago era il mio più caro amico.

source: I could really use another companion. Please leave me. I'm too sad to talk right now.
it: Potevo veramente usare un'altro compagno. Lasciami per favore. Sono troppo triste per parlare adesso.

source: Give Paula the pet spider.
it: Dai a Paula il ragno domestico.

source: What? You brought me a pet spider? This little critter is adorable! Sniff. I will name him Xordy Jr. Thank you so much!
it: Cosa? Mi hai portato un ragno domestico? Questo piccolo animaletto è adorabile! Sniff. Lo chiamerò Xordy Jr. Grazie molto davvero!

source: Thank you again for bringing Xordy Jr. to me. When I play with him, I will always think of you. These recent events remind me. There was a monster Xordaraxus and I could never defeat. I should have taken that as a sign we were not strong enough to fight the Dragon Lord. You and your dragon must defeat Rex, a dinosaur, as a test.
it: Grazie ancora per avermi portato Xordy Jr. Quando gioco con lui, penso sempre a te. Questi eventi recenti mi fanno ricordare. C'era un mostro che io e Xordaraxus non potevamo mai sconfiggere. Dovrei averlo preso come un segno che non eravamo abbastanza forti per combattere contro il Signore Drago. Tu ed il tuo drago dovete sconfiggere Rex, un dinosauro, come prova.

source: Careful of the dinosaur's deadly bite, and huge feet, or he'll squash you like a bug.
it: Attento al morso mortale del dinosauro ed alle sue enormi zampe, o ti schiaccerà come un verme.

source: Tell Paula that Rex has been slain.
it: Dì a Paula che Rex è stato ucciso.

source: Unbelievable. Rex is vanquished. And it's all thanks to you. Your dragon seems happy the battle is over.
it: Incredibile. Rex è stato sconfitto. E tutto grazie a te. Il tuo drago sembra felice che la battaglia è finita.

source: I'm impressed with the progress you and your dragon have made. I think it's time for you to embark on your first quest to defeat the Dragon Lord. The wizard will tell you more.
it: Sono impressionato dal progresso che tu ed il tuo drago avete compiuto. Penso che sia ora che tu ed il tuo drago vi imbarchiate nella vostra prima ricerca per sconfiggere Lord Dragon. Vi dirà di più il mago.

source: Good luck, Dragon Rider. I'll never forget you.
it: Buona fortuna, Cavaliere di Drago, non ti dimenticherò mai.

source: Final Battle
it: Battaglia Finale

source: The final battle is at hand.
it: La battaglia finale è a portata di mano.

source: Help us, Dragon Rider. Seek out the Dragon Lord and end it. You’re this world’s only hope.
it: Aiutaci, Cavaliere di Drago. Cerca il Signore Drago e finiscilo. Tu sei la sola speranza di questo mondo.

source: Defeat the Dragon Lord.
it: Sconfiggi il Signore Drago .

source: You did it! The Dragon Lord is vanquished. The world is saved!
it: Ce l'hai fatta! Il Signore Drago è sconfitto. Il mondo è stato salvato!

source: Tell Paula you have defeated the Dragon Lord.
it: Dì a Paula che hai sconfitto il Signore Drago.

source: Final Training
it: Allenamento finale

source: We have all lost loved ones. But soon our suffering will end.
it: Abbiamo tutti perso i nostri cari. Ma presto le nostre sofferenze termineranno.

source: You must prepare. If you and your dragon are not strong enough, you won’t stand a chance against the Dragon Lord.
it: Ti devi preparare. Se tu ed il tuo drago non sarete abbastanza forti, non avrete una possibilità contro il Signore Drago.

source: What will I do when it’s all over? Raise my animals in peace. I suppose Ted will build his city. What will you do?
it: Cosa farò quando sarà tutto finito? Crescere i miei animali in pace. Suppongo che Ted costruirà la sua città. Tu cosa farai?

source: Reach level 50 with the dragon.
it: Raggiungi il livello 50 con il drago.

source: You are the greatest person I have ever known. I truly believe you can end our struggle.
it: Tu sei la persona più fantastica che io abbia mai conosciuto. Credo sinceramente che tu possa porre fine alla nostra lotta.

source: Tell Paula the dragon has reached its maximum potential.
it: Dì a Paula che il drago ha raggiunto il suo potenziale massimo.

source: I always believed in your victory and I am happy that I was not mistaken in you. But why am I crying? These are tears of joy, because during the battle I saw my beloved dragon, whom I considered dead. Do you remember, I told you about my dragon Xordaraxus?
it: Ho sempre creduto nella tua vittoria e sono felice di non essermi sbagliato in te. Ma perché sto piangendo? Sono lacrime di gioia, perché durante la battaglia ho visto il mio adorato drago, che consideravo morto. Ricordi che ti ho parlato del mio drago Xordaraxus?

source: I grieved for him and missed so much, but it turns out, he did not die, he was stolen by this vile Dragon Lord! Dear God, my handsome dragon has changed under the dark spell of the Lord ... I could hardly recognize him, but it is undoubtedly him. I am so glad to be able to see him again.
it: Mi sono addolorato per lui e mi è mancato così tanto, ma si scopre che non è morto, è stato rubato da questo vile Signore dei Draghi! Caro Dio, il mio bel drago è cambiato sotto l'oscuro incantesimo del Signore... Fatico a riconoscerlo, ma è senza dubbio lui. Sono così felice di poterlo rivedere.

source: I see that the Lord mistreated his dragons and he is not worthy to own them! But I can not take care of dragons. Only you, the Dragon Rider, could pacify all three dragons and become their friend and mentor. But this is not an easy goal, are you ready to start?
it: Vedo che il Signore ha maltrattato i suoi draghi e non è degno di possederli! Ma non posso occuparmi dei draghi. Solo tu, il Dragon Rider, potresti pacificare tutti e tre i draghi e diventare loro amico e mentore. Ma questo non è un traguardo facile, sei pronto per iniziare?

source: I did not doubt that you would agree to help the unfortunate dragons. Then let’s start immediately. The Ice Dragon is very wayward and rebellious, to subdue it you will need a lot of effort. Only the power of the Dragon hearts will help conquer this obstinate dragon.
it: Non avevo dubbi che avresti accettato di aiutare gli sfortunati draghi. Allora cominciamo subito. Il drago di ghiaccio è molto ribelle e ribelle, per sottometterlo avrai bisogno di un grande sforzo. Solo il potere dei cuori di drago aiuterà a conquistare questo drago ostinato.

source: The Sullen Dragon
it: Il drago imbronciato

source: Oh! Have you brought them already? You are a great warrior, Dragon Rider if you coped with this difficult quest so quickly. Now it will be easier for you to subjugate the Ice Dragon. I will help you with this.
it: Oh! Li hai già portati? Sei un grande guerriero, Dragon Rider, se hai affrontato questa difficile missione così velocemente. Ora sarà più facile per te soggiogare il drago di ghiaccio. Ti aiuterò con questo.

source: I know that you’ll take good care of your new dragon. But we still have a lot of work to do, and before we embark on it, I have to tell you something. Are you ready to listen to a long story?
it: So che ti prenderai cura del tuo nuovo drago. Ma abbiamo ancora molto lavoro da fare, e prima di imbarcarci, devo dirti una cosa. Sei pronto ad ascoltare una lunga storia?

source: Before I begin, I have to show you one amazing thing with the help of which you can gain power over the Fire Dragon.
it: Prima di iniziare, devo mostrarti una cosa straordinaria con l'aiuto della quale puoi ottenere potere sul Drago di fuoco.

source: This is a feather of a flamy bird that no one has ever seen in our world, we know about it only from legends. Only the one who defeats it can subjugate the Fire Dragon. The Phoenix, as this bird is called, lives very far from here and to find it, you will need to go on a difficult journey.
it: Questa è una piuma di un uccello fiammeggiante che nessuno ha mai visto nel nostro mondo, lo sappiamo solo dalle leggende. Solo chi lo sconfigge può soggiogare il drago di fuoco. La Fenice, come viene chiamato questo uccello, vive molto lontano da qui e per trovarla dovrai intraprendere un viaggio difficile.

source: Legends say that beyond our world, there are also external, unknown worlds, and there is another huge world, beautiful and dangerous at the same time, a world that is hard to get into and even harder to survive there.
it: Le leggende dicono che al di là del nostro mondo, ci sono anche mondi esterni, sconosciuti, e c'è un altro mondo enorme, bello e pericoloso allo stesso tempo, un mondo in cui è difficile entrare e ancora più difficile sopravvivere lì.

source: But you are not afraid of difficulties, Dragon Rider, are not you? If you still decide to go there, you will find not only a danger but also many adventures that you will remember for a very long time. Rising higher and higher, you will see the cold moonlit wastelands, poisonous rivers and lakes with huge luminous cities on their banks, endless Mushroom Wetlands, and even higher, you’ll find the wild primeval jungle over which the Phoenix reigns.
it: Ma tu non hai paura delle difficoltà, Dragon Rider, vero? Se decidi ancora di andarci, troverai non solo un pericolo ma anche tante avventure che ricorderai per molto tempo. Salendo sempre più in alto, vedrai le fredde lande desolate illuminate dalla luna, fiumi e laghi velenosi con enormi città luminose sulle loro rive, infinite zone umide di funghi e ancora più in alto troverai la selvaggia giungla primordiale su cui regna la Fenice.

source: Wild tribes live in this jungle, some of them are very warlike, and their tree houses are made of beautiful and very durable stone called amber. If you still decide to go to this dangerous world, could you grab some amber for me? But what am I talking about? Because this is only a legend and no one knows if this world really exists for sure. Probably the time has come to check whether ancient legends tell the truth because only you can go there.
it: Tribù selvagge vivono in questa giungla, alcune sono molto bellicose e le loro case sugli alberi sono fatte di pietra bella e molto resistente chiamata ambra. Se decidi ancora di andare in questo mondo pericoloso, potresti prendere dell'ambra per me? Ma di cosa sto parlando? Perché questa è solo una leggenda e nessuno sa se questo mondo esiste davvero. Probabilmente è arrivato il momento di verificare se le antiche leggende dicono la verità perché solo tu puoi andarci.

source: Take the feather of a flamy bird, keep it with you until you can defeat it.
it: Prendi la piuma di un uccello fiammeggiante, tienila con te finché non puoi sconfiggerla.

source: The Amber
it: L'Ambra

source: It is time to hit the road, but follow my advice - leave your pets at home, they can’t survive in a strange cruel world. Only the Mechanical pet and Maty pet could accompany you on this journey.
it: È ora di mettersi in viaggio, ma segui il mio consiglio: lascia i tuoi animali domestici a casa, non possono sopravvivere in uno strano mondo crudele. Solo l'animale domestico meccanico e l'animale domestico Maty potrebbero accompagnarti in questo viaggio.

source: But let's not hesitate, go and finally reveal the secret of this mysterious world existence. I will look forward to hearing from you; I still have a lot to tell you. Bring amber to prove that this world really exists.
it: Ma non esitiamo, andiamo e finalmente sveliamo il segreto di questa misteriosa esistenza mondiale. Non vedo l'ora di sentire da voi; Ho ancora molto da dirti. Porta l'ambra per dimostrare che questo mondo esiste davvero.

source: How long have you been gone, Dragon Rider! I am glad to see you safe after such a difficult journey. But what is it? Have you brought this amazing stone called amber? So the world in which you got it really exists!
it: Da quanto tempo sei via, Dragon Rider! Sono felice di vederti al sicuro dopo un viaggio così difficile. Ma cos'è? Hai portato questa incredibile pietra chiamata ambra? Quindi il mondo in cui l'hai preso esiste davvero!

source: But you look so exhausted and tired, probably you had a hard time in this alien world. I know how to help you. The news of your unusual journey spread far around, and Alchemist told me something interesting, which was told to him by Fuza, who live in the Ice cities.
it: Ma sembri così esausto e stanco, probabilmente hai avuto difficoltà in questo mondo alieno. So come aiutarti. La notizia del tuo insolito viaggio si è diffusa in giro, e Alchemist mi ha raccontato qualcosa di interessante, che gli è stato detto da Fuza, che vive nelle città di ghiaccio.

source: Of course, you have already met these strange creatures living on ice in the middle of the ocean, and others similar to them, who live in glass underwater domes and on the Heavenly islands. But have you ever wondered where they came from in our world?
it: Certo, hai già incontrato queste strane creature che vivono sul ghiaccio in mezzo all'oceano, e altre simili a loro, che vivono in cupole di vetro sottomarine e sulle isole celesti. Ma vi siete mai chiesti da dove venissero nel nostro mondo?
