Repository: TheDark98/blockstory-translation
Catalog: translations/Hints.po
Languages: it

source: You can enable Split Touch Controls in the Controls settings.
it: Puoi attivare i controlli split touch nelle opzioni dei controlli.

source: To place block, equip it in inventory and simply click on the spot where you want to place it.
it: Per piazzare un blocco, equippaggialo nell' inventario e clicca semplicemente nel punto dove vuoi piazzarlo.

source: The [FF0000]Source of Life[-] only spawns at night.
it: La [FF0000]Fonte della vita[-] spawna solo di notte.

source: The [00FF00]Boat[-] is good for travelling on more than [00FF00]Water[-].
it: La [00FF00]Barca[-] è il mezzo perfetto per navigare nella superficie dell'[00FF00]acqua[-].

source: Watch that rogue orchard! Growing trees can damage nearby buildings.
it: Le piante , in fase di crescita possono recare danno alle costruzioni se non fatte con attenzione.

source: Plants can grow anywhere with the right type of soil.
it: Piante,crescono ovunque! Basta soltanto mettere il giusto tipo di terreno sotto di loro.

source: Make some [00FF00]Torch[-] before you go exploring.
it: Crea alcune [00FF00]Torce[-]prima di iniziare ad esplorare.

source: Complete [FF0000]Aarons'[-] quests to unlock the radar recipe.
it: Completando la missione di [FF0000]Aarons'[-] sbloccherai la ricetta per la costruzione di un radar.

source: Go into caves to easily find ore.
it: Avventurandoti all'interno delle grotte troverai facilmente dell'oro.

source: Stronger enemies drop better items.
it: Nemici più forti dropperanno oggetti migliori.

source: With the teleport staff you can teleport to any placed bed.
it: Con il bastone del teletrasporto puoi teletrasportarti verso qualsiasi letto collocato in precedenza.

source: If you die, you will be respawned near the last placed [00FF00]Bed[-] block.
it: Se muori, verrai respawnato vicino al [00FF00]letto[-] che hai piazzato per ultimo.

source: A lost world resides deep underwater.
it: Cerca nelle profondità marine per ritrovare un mondo sperduto.

source: Go to [FF0000]www.blockstory.net[-] for more info about the game.
it: Vai su [FF0000]www.blockstory.net[-] per informazioni riguardanti il gioco.

source: Collect a spawner to take any creature with you.
it: Puoi trasportare assieme a te qualsiasi creatura raccogliendone il suo spawner.

source: The amount of time you can fly is linked to your [FF0000]Mana[-].
it: La quantità di tempo che puoi volare è legata alla quantità di mana che possiedi.

source: Creatures: Red - Aggressive, Yellow - Neutral, Green - peaceful.
it: Creature: Rosso - Aggressivo, Giallo-Neutrale, Verde - pacifica.

source: Eliminate a spawner to prevent being overwhelmed by monsters (eg. spiders).
it: Ellimina uno spawner per evitare di ritrovarti circondato da mostri (es. ragni).

source: The [FF0000]Alchemist[-] is also a merchant.
it: Lo [FF0000]Shadow Hunter[-] è anche un commerciante.

source: DON'T stab an [FF0000]Electric Dragon[-] (or any other [FF0000]Dragon[-])!
it: NON cercare di ferire un [FF0000]Drago elettrico[-] (o qualsiasi altro[FF0000]Drago[-])!

source: Make a diving suit before traveling to [FF0000]Atlantis[-].
it: Crea una tuta da sub prima di avventurarti ad [FF0000]Atlantide[-].

source: [00FF00]Clouds[-] are pretty to look at, but will not hold you up.
it: Le [00FF00]Nuvole[-] sono carine da guardare, ma non reggeranno il tuo peso.

source: Hold a [00FF00]Bucket[-] of [00FF00]Water[-] in your hand to place water; hold an empty [00FF00]Bucket[-] in your hand to collect [00FF00]Water[-].
it: Usa un [00FF00]secchio[-] con dell'[00FF00]acqua[-] per piazzarla.Premi con un secchio vuoto in mano su dell'acqua per raccoglierla.

source: Water in Forgotten Sky islands is often open to the sky below it - be careful when swimming, you can fall out of the water into open air!
it: L' acqua nelle isole dimenticate del cielo è spesso aperta al cielo sottostante - fai attenzione quando nuoti, potresti cadere dall'acqua e precipitare!

source: [00FF00]Iron Ore[-] glows a weak grey light - you may not be able to see it when brighter ores are nearby.
it: Il [00FF00]Ferro Grezzo[-] crea una debole luce grgiastra - potresti non riuscire a vederla quando minerali più brillanti sono nelle vicinanze.

source: [00FF00]Sea Grass[-] contains trapped air. You can swim into it to replenish your [FF0000]Breath[-] while deep underwater.
it: Le [00FF00]Alghe[-] contengono dell'aria intrappolata .Nuotaci in mezzo per ripristinare il tuo [FF0000]Respiro[-] quando sei in acque profonde.

source: Sleeping restores your [FF0000]Mana[-] and [FF0000]Health[-].
it: Dormire ripristina il tuo [FF0000]Mana[-] e la tua [FF0000]Salute[-].

source: Spend skill points on dig speed to dig faster.
it: Metti alcuni punti abilità in velocità di scavo per scavare più rapidamente.

source: [00FF00]Lava[-], [00FF00]Acid[-], and [00FF00]Cactus[-] do damage when you touch them.
it: [00FF00] La lava[-], [00FF00] l'acido[-], e [00FF00]i cactus[-] ti feriscono quando li tocchi.

source: Dig deep to find [FF0000]Moria[-] and the [FF0000]Underworld[-].
it: Scava in profondità per trovare [FF0000]Moria[-] e[FF0000]l'Inferno[-].

source: Fly high above to find a forgotten world.
it: Vola in alto per trovare un mondo dimenticato.

source: You can trade with [FF0000]The Alchemist[-] for useful items.
it: Puoi commerciare con [FF0000]Shadow Hunter[-] per ottenere oggetti utili.

source: The recipe book can be found within the inventory window.
it: Il ricettario è molto utile se non ricordi come si crafta un oggetto.

source: Use skill points to make your character stronger.
it: Usa i punti abilità per rafforzare il tuo personaggio.

source: Dont attack [FF0000]Ted[-]!!!
it: Non attaccare [FF0000]Ted[-]!!!

source: [FF0000]Quests[-] need to be completed for certain recipes to be unlocked.
it: Per sbloccare alcune ricette avrai bisogno di aver completato determinate [FF0000]Missioni[-].

source: Need [00FF00]Sulfur[-] or [00FF00]Unobtainium[-]? Go to the [FF0000]Underworld[-]!
it: Hai bisogno di [00FF00]Zolfo[-] o [00FF00]Unobtainium[-]? Cercali nell' [FF0000]Inferno[-]!

source: [00FF00]Sea Grass[-] can be used to make elevators.
it: Le [00FF00]Alghe[-] possono essere usate per creare ascensori.

source: Trees you plant will not stop growing until they are full size.
it: Gli alberi che pianti continueranno a crescere finchè non saranno completamente cresciuti.
