Repository: TheDark98/blockstory-translation
Catalog: translations/Items.po
Languages: es

source: Bucket
es: ¡Ahh! Los buenos viejos tiempos, cuando usábamos estas cosas como retretes. Por suerte, ahora son más adecuadas para recoger [FF0000]Lava[-] o [FF0000]Agua[-].

source: Red Crystals
es: Mineral de color rojo que se encuentra en lo más profundo de las cuevas. Produce un brillo rojizo a su alrededor cuando permanece intacto. Se puede usar para elaborar magia negra o como tinte rojo.

source: Saddle
es: Se puede usar para montar animales.

source: Shovel
es: Herramienta útil para cavar en la arena y la tierra. Cava más y mejor que con las manos desnudas. Para usarla, abre el inventario, selecciona la [FF0000]Pala[-], pulsa y mantén pulsado sobre el bloque que quieras romper.

source: Store Row Pet Error
es: Conéctate a Internet para aumentar tu Inventario de mascotas.

source: Crystal Block Green
es: Bloque selvático color Verde de aspecto brillante hecho de hermosas [FF0000]Esmeraldas[-].

source: Acid
es: Escava 7 bloques hacia abajo una vez colocado. Solamente el [FF0000]Vidrio[-] lo detiene.

source: Birch Leaves
es: Raro conjunto de hojas que generalmente se encuentran en el Bioma de la Selva.

source: Wax
es: Sustancia cerosa de colmenas encontrada en los [FF0000]Robles[-]. El tinte se puede utilizar para crear coloridas velas.

source: Iron Dig
es: Al igual que el pico, esta es la herramienta más importante para cualquier minero. A diferencia del pico el [FF0000]Pico de Hierro[-] corta a través de cualquier material con facilidad.

source: Brush
es: Puedes pintar casi todos los bloques del mundo con esta herramienta.

source: Birch Fence
es: Vistosa valla de madera. Genial para atrapar o guardar animales.

source: Coco Bean
es: Una fruta tropical de cáscara dura. Se dice que la leche que contiene en su interior es capaz de levantar el ánimo hasta en los tiempos más difíciles. Se encuentra alrededor de la playa en los [FF0000]Cocoteros[-].

source: Magic
es: Una herramienta sencilla pero muy práctica. Contiene un poder místico otorgado por los [FF0000]Cristales Rojos[-] ¡que le otorga a su portador apoyo ofensivo!

source: Paraffin
es: Los Bloques Colmenas se pueden encontrar en el bosque. Derrítelos en un [FF0000]Horno[-] para obtener [FF0000]Cera[-].

source: Sand Clock
es: Ralentiza el tiempo. Para utilizarlo, pon los relojes en la mano izquierda y pulsa el botón reloj de arena en la esquina superior derecha.

source: Alien Dog Soul
es: Devuelve la vida a un perro extraterrestre. Listo para luchar junto a ti sin requerir que le lleves antes tu líder. Toma Sopa de Aleta de Tiburón, Pan, Peces Cocidos y Carne para saciar su apetito.

source: Spirit Necklace
es: Una herramienta oscura de almas atrapadas y corruptas de [000000]Unobtainium[-]. Aumenta la capacidad del usuario para reponer sus reservas de maná.

source: Gold Block
es: Valioso bloque hecho de oro.

source: Emeralds
es: Mineral Verde brillante encontrado en las cuevas. Se puede introducir en un hermoso cristal verde..

source: Brick Fence
es: Valla ornamental de ladrillo. Genial para atrapar o guardar animales.

source: Green Fluorite
es: Material de elaboración.

source: Iron Ore
es: Uno de los minerales más útiles y difíciles de encontrar. Puede encontrarse bajo tierra y en tus cereales del desayuno. El Hierro se puede usar para elaborar un montón de cosas, como balas, picos, coches, propulsores y armas.

source: Red Dye
es: Fabricado a partir [FF0000]Rubíes[-] machacados. Se usa para crear bloques de color. Combínalo con otros colorantes para hacer muchos colores diferentes.

source: Warrior Armor
es: Aquí hay algo que no ves todos los días. Finalmente, el hombre capaz de detener a un Dragón. Seguro que necesitarás este conjunto de Armadura para esa bestia de fuego.

source: Shark Fin Soup
es: Puede conseguir una aleta de un tiburón muerto. Necesitas el [FF0000]Caldero[ -] para hacerla.

source: Stone Fence
es: Valla de piedra decorativa. Perfecta para atrapar o guardar animales.

source: Boat
es: Una creación boyante hecha de madera. Permite viajes rápidos por agua, barro y lava. se puede teñir en la mesa de construcción.

source: Palm Leaves
es: Hojas de palmera. Por lo general se encuentran en la playa. Se dice que hay Cocos por debajo de las hojas.

source: Skeletone Helmet
es: Casco hecho de hierro. Póntelo en la cabeza y aumentará mucho tu protección.

source: JetPack
es: Un vehículo que te permite volar sin maná. Utiliza [FF0000]Gravitón[-] para que el [FF0000]Motor[-].

source: Spikes Magic
es: Una herramienta extremadamente poderosa que reúne los picos bajo el objetivo y lo hace rápidamente.

source: Bone
es: El Hueso encantado de un Esqueleto. Usado en gran variedad de recetas, sobre todo en armas y escudos.

source: Jungle Flower
es: Hermosas flores rojas. Pero ándate con ojo, su dulzura puede atraer a los Murciélagos.

source: Oak Tree Plant
es: Crece en el [FF0000]Estiércol]-] o la [FF0000]Hierba[-]. Produce Cera.

source: Palm Plant
es: Crece en la [FF0000]Arena[-]. Produce [FF0000]Cocos[-].

source: Grass 3D
es: Los pequeños penachos de follaje no cúbico aparecen en todas partes de la superficie.

source: Wheel
es: Un invento revolucionario. Este delgado cilindro permite el coche se desplace rápidamente. Mucho mejor que el cuadrado. ¿Puedes imaginarte cómo sería un accidentado trayecto con un coche con las ruedas cuadradas?

source: Teleport
es: Un dispositivo adelantado a su tiempo, que te permite teletransportarte a cualquier [FF0000]Cama[-]. No salgas de casa sin uno y no llores si te pierdes en el bosque porque no tenías uno.

source: Metal Fence Gate
es: Una puerta para la valla que te permite entrar sin tener que trepar por encima.

source: Coal Ore
es: Un mineral encontrado bajo tierra.

source: Palm Fence
es: Valla de madera decorativa. Perfecta para atrapar o guardar animales.

source: Goblin Armor
es: ¡Los Duendes tienen un gran sentido de la moda!

source: Iron Bar
es: Creado a partir del [FF0000]Horno[-]. Puede utilizarse para crear elementos como espadas y piquetas.

source: Sea Grass
es: Se encuentra en el océano. Retiene el aire interior que te permite respirar. Recógelo y ponlo en la casa para hacer ascensores.

source: Antique Window
es: Una vieja ventana metálica, elaborada por los Duendes para defenderse, no por comodidad.

source: TrapDoor
es: Perfecto para esconder habitaciones secretas y evitar a familiares.

source: Devil Rock
es: El Espíritu corrupto del Barlog desemboca en los cimientos del Inframundo. Cuando sale a la superficie estas piedras brillan con una luz odiosa .

source: Birch Plant
es: Crece en el [FF0000]Estiércol[-] o la [FF0000]Hierba[-].

source: Raven Wing
es: Alas de Cuervos negros como la noche. Me pregunto si podría usarlas para volar.

source: Coloring Block
es: Puede utilizarse para colorear bloques o mezclar colorantes.

source: Stair
es: Un bloque que te da una excusa para no utilizar los tablones el tu tejado. También es un gran repuesto para escaleras.

source: Mistic Ring
es: Herramienta de un hechicero. Este anillo aumenta las conexiones de los usuarios con el mundo de los espíritus. Se fabrica con [FF0000]Telas de Araña[-] encantadas y el ojo del gran [FF0000] Aragog [-].

source: Duck Spawner
es: Una criatura que tiene un aspecto muy diferente a los demás. Se forma a partir de los Nenúfares. Me pregunto si las ranas saltan encima de ellas.

source: Dragon Helmet
es: Hecho de [FF0000]Escala de Dragón[-].

source: Explosive Arrow
es: Explota si recibe un impacto, causándole daño a todas las criaturas y destruyendo los bloques que se encuentren alrededor.

source: Swamp Spawner
es: Un bloque horrible hechos de barro, que invoca retorcidos enemigos.

source: Replicator
es: Utiliza el poder de Shiva para replicar el asunto. Toca en cualquier bloque por un lado y lo replicará 10 veces en el lado opuesto.

source: Bark
es: El tipo de madera más común. Esencial para un aventurero principiante. Se encuentra en los árboles en los bosques. Se puede convertir en [FF0000]Tablones[-] para elaborar varios artículos, incluyendo [FF0000]Picos[-] y [FF0000]Espadas[-].

source: Sand
es: La arena es un material inerte que se puede teñir y fundir en [FF0000]Vidrio[-]. Comúnmente se encuentra cerca de las Playas y en los Desiertos.

source: Short Sword
es: Una espada corta que da gran ventaja luchando contra enemigos. No va bien para grandes distancias, pero destacar en el combate en las distancias cortas.

source: Crystal Sword
es: Forjado como una apuesta arriesgada por un aventurero solitario que combina la poca [FF0000]Criptonita[-] que tenía, los [FF0000]Huesos[-] caídos de los [FF0000]Esqueletos[-] y [000000]Unobtainium[-] de las profundidades del [FF0000]Inframundo[-].

source: Bones Shield
es: Un escudo de aspecto asustadizo formado de huesos. Hay una calavera atada al frente. No tengas miedo. Te protegerá.

source: Dog Soul
es: Devuelve la vida a un lindo perrito. Te seguirá a todas partes. Come Sopa de Aleta de Tiburón, Pan y Carne.

source: GunPowder
es: Un ingrediente útil para fabricar [FF0000]Balas[-] o [FF0000]TNT[-].

source: SheepSkin
es: Matar a un animal para obtener su piel no siempre es malo. Puede resultar útil para elaborar cómodas [FF0000]Camas[-].

source: Dragon Ring
es: Me pareció que quedaba muy moderno en el dragón…

source: Collect_Failed
es: [FF0000]No se puede obtener {0}x {1}[-]

source: Clear Stone
es: Material de fabricación. Se produce cuando se calientan [FF0000]Piedras[-].

source: Furnace
es: El horno se puede usar para fundir materiales en artículos útiles. Añade un artículo basado en la energía, como Carbón, Madera, Palos o Tablones, y un artículo que se pueda fundir. Y espera un poco.

source: Goblin PickAxe
es: Se usa para cavar minerales. Cava mucho más rápido y más profundo que con tus manos desnudas y el [FF0000]Hacha de Hierro[-]. Para usarla, abre el inventario, selecciona el [FF0000]Hacha del Duende[-], pulsa y mantiene sobre el bloque que quieres romper.

source: Lilia Flower
es: Preciosos Nenúfares.

source: Clear Plank
es: Parece que alguien hubiera derramado tinte por todo este tablón naranja. En cualquier caso es genial para suelos o paredes.

source: Lava
es: No te acerques o te quemarás a menos que tengas un bote... naturalmente.

source: Forgotten Leaves
es: El principal conjunto de hojas se encuentra en los [FF0000]Cielos Ovidados [-]. No te lo puedes perder.

source: HorseSkin
es: Piel de un caballo muerto. Útil para fabricar una armadura de duende.

source: Health Potion
es: Utiliza la Poción curativa para restaurar la salud. Necesitas la [FF0000]Caldera[-] para elaborarla.

source: Flippers
es: Están hechas de [FF0000]Madera[-] y de [FF0000]Hierro[-]. Estas botas tan molonas están hechas para propulsar a quien las lleve a gran velocidad bajo el agua.

source: Warrior Pants
es: Los Pantalones del Guerrero, sólo no te harán parecer más alto, sino que también aumentarán tu defensa cuando te ataquen.

source: Long Sword
es: Una larga espada de piedra que funciona bien para luchar contra un poderoso monstruo.

source: Letter
es: Se trata de un pergamino que contiene un mensaje importante. (Y una tarjeta de cumpleaños de broma.)

source: Engine
es: Sin este maravilloso invento, el [FF0000]Coche[-] no sería nada más que un montón de basura inútil.

source: Shark Fin
es: Una aleta que se cayó directamente de un Tiburón muerto. Útil para hacer sopa de la aleta del tiburón.

source: Yellow Flower
es: Ya sabes, una flor amarilla.

source: Mana Potion
es: Utiliza la Poción de Maná para restaurar tu Maná. Necesitas la [FF0000]Caldera[-] para elaborarla.

source: Safebox
es: Un contenedor valorado por sus capacidades de almacenamiento. Con muchos compartimentos para poder llevar cualquier artículo posible.

source: Goblin Helmet
es: No sólo te protegerá, si no que podrás moverte sigilosamente para ir a una fiesta de Duentes y hacerte pasar por uno.

source: Pine Leaves
es: Un montón de Hojas Verdes que se encuentran en el Bioma de Nieve. ¿Te sorprenderías si te dijera que la nieve cae sobre la parte superior de las hojas?

source: Fire Magic
es: Algo que se utiliza para incinerar enemigos. No te metas en el océano con él.

source: Rose Flower
es: Hermosa Rosa blanca. Ten cuidado con espinas.

source: Craft Table
es: Un mesa de herramientas para un Manitas. Sin ella no podrás crear recetas. Úsalo para fabricar cosas que requieren elaboración de 3x3.

source: Replicon
es: Muta el ADN de un organismo.

source: Marble Block
es: Roca metamorfica compuesta de calcita. Se encuentra generalmente en cuevas.

source: Anvil
es: Bloque solido de hierro donde puedes reparar tus armas y herramientas.

source: Mech Pet
es: Un acompañante mecánico que puede disparar cohetes.

source: Ventilation Left
es: Parte del Robot.

source: Rocket Launcher
es: Parte del Robot.

source: Cannon
es: Parte del Robot.

source: Mech Leg Left
es: Parte del Robot.

source: Ventilation Right
es: Parte del Robot.

source: Computer
es: Un dispositivo que acepta instrucciones y procesa información.

source: Rockets
es: Pon los cohetes en el inventario del Robot para darles uso.

source: Mystical Block
es: Uso decorativo.

source: Devil Bush
es: Un arbusto muy común en el inframundo.

source: Desert Bush
es: Un arbusto muy común en el Desierto.

source: Carpet
es: Uso decorativo.

source: Ice Bricks
es: Bloques hechos enteramente de hielo.

source: Granite
es: Roca ignea util para construcciones.

source: Skulls Block
es: Bloque hecho de las calaveras de los fallecidos.

source: Devil Bricks
es: Bloques comunes en el Inframundo.

source: Dark Axe
es: Una hacha mejorada capaz de causar daño a través de la magia negra.

source: Fire Axe
es: Una hacha mejorada envuelta en fuego.

source: Ice Axe
es: Una hacha encantada capaz de congelar todo lo que toca.

source: Battle Axe
es: Hacha poderosa capas de acabar con enemigos grandes.

source: Snowman
es: Humanoide hecho de nieve, palos y cubeta. Dáselo otro hombre de nieve para que pueda atacar con bolas de nieve. Consume nieve para satisfacer su apetito.

source: Christmas Tree
es: Un árbol decorado para celebrar las Navidades.

source: Teleporter
es: Un dispositivo adelantado a su tiempo, que te permite teletransportarte a cualquier otro [FF0000]teletransportador[-]. No salgas de casa sin uno y no llores si te pierdes en el bosque porque no tenías uno.

source: Rails
es: Los rieles se usan para crear un camino para la [FF0000]Vagoneta[-] y la [FF0000]Locomotora [-]. Conéctalo a un [FF0000]generador[-] para darle velocidad.

source: Minecart
es: Carro pequeño usado para viajar rápido en tus rieles. Se puede pintar en una mesa.

source: Sign
es: Úsalo para escribir lo que quieras. Puedes pintarlo de cualquier color con una brocha. Puedes escribir hasta 30 letras.

source: Fireworks
es: Luces decorativas de varios colores y formas. Pon los cohetes en el suelo y después de unos segundos se dispararán automáticamente. [FF0000]Cuidado! nunca juegues con pirotécnicos adentro de la casa[-]

source: Rainbow Basilisk Soul
es: Una mascota muy rara. Puede cambiar de color. Excelente nadador. Come pescado frito y carne para satisfacer su apetito.

source: Viking Boat
es: El barco legendario de Ted. Se puede teñir en la mesa construcción.

source: Bait
es: Comida para peces.

source: Fish Rod
es: Usalo para pescar.

source: Fried Meat
es: Carne cocida. Provee más energía.

source: ClownFish
es: Pescado recién capturado.

source: Fried ClownFish
es: Pescado cocido.

source: LionFish
es: Pescado recién capturado.

source: Fried LionFish
es: Pez cocido.

source: GruntFish
es: Pez recién capturado.

source: Fried GruntFish
es: Pez cocido.

source: TriggerFish
es: Pez recién capturado.

source: Fried TriggerFish
es: Pez cocido.

source: Squid
es: Calamar recién capturado.

source: Fried Squid
es: Calamar cocido.

source: Stingray
es: Pez recién capturado.

source: Fried Stingray
es: Pez cocido.

source: Urchin
es: Erizo marino capturado.

source: Fried Urchin
es: Erizo marino cocido.

source: StarFish
es: Estrella de mar capturada.

source: Fried StarFish
es: Estrella de mar cocida.

source: Shark
es: Tiburon recién capturado.

source: Fried Shark
es: Tiburón cocido.

source: Mati Soul
es: Una pequeña pieza de oscuridad. ¿Por qué es tan lindo? Consume Carne y Peces Cocidos para satisfacer su hambre.

source: Wall Torch
es: Ponlo en la pared si quieres.

source: Alien Fish Rod
es: Úsalo para atrapar peces grandes del espacio.

source: Sunshard
es: Un bastón mágico que puede atraer meteoritos hacia tus oponentes.

source: Space Suit
es: Permite respirar en el Espacio.

source: Angel Wings
es: Permite volar sin maná.

source: Phoenix Shield
es: Un increíblemente fuerte escudo de fuego.

source: Alien Shield
es: Un escudo muy duradero de la cáscara de los Dunkleosteus.

source: Amber Boots
es: Armadura Increíblemente fuerte. Hecha de [FF0000]Ámbar[-].

source: Amber Pants
es: Armadura Increíblemente fuerte. Hecha de [FF0000]Ámbar[-].

source: Amber Armor
es: Armadura Increíblemente fuerte. Hecha de [FF0000]Ámbar[-].

source: Amber Helmet
es: Armadura Increíblemente fuerte. Hecha de [FF0000]Ámbar[-].

source: World Breaker
es: El resultado de combinar las [FF0000]Espadas Angelicales[-] con las [FF0000]Espadas Fénix[-].

source: Phoenix Swords
es: Increíbles espadas a dos manos fforjadas en el fuego del Fénix.

source: Goblin Rocket Launcher
es: Te permite disparar con [FF0000]Rockets[-].

source: Mashine Gun
es: Armas con muy rápido disparo pero con amplia propagación.

source: Chain
es: Decoración común para la casa.

source: Clear Planks Fence Gate
es: Puerta para la valla que permite entrar y salir sin saltar por encima de la valla.

source: Palm Fence Gate
es: Una puerta para la valla que te permite entrar o salir sin tener que saltar por encima de la valla.

source: Birch Fence Gate
es: Una puerta para la valla que te permite entrar o salir sin tener que saltar por encima de la valla.

source: Gold Fence
es: Valla decorativa de oro. Genial para atrapar o mantener animales.

source: Marble Fence
es: Vistosa decorativa de roca. Genial para atrapar o mantener animales.

source: Metal Fence
es: Vistosa valla de Hierro. Genial para atrapar o mantener animales.

source: Clear Planks Fence
es: Vistosa valla de Madera Limpia. Genial para atrapar o mantener animales.

source: Metal Trap Door
es: Genial para esconder cuartos secretos y evitar familiares. Hecho de Hierro.

source: Metal Door
es: Masiva puerta de hierro.

source: Metal Lattice Door
es: Una puerta hecha de barras de hierro.

source: Simple Wood Door
es: Una puerta de madera que es equivalente a la longitud de dos bloques.

source: Metal Ladder
es: Conéctalos juntos para salirte del hoyo más oscuro. Hecho de Hierro.

source: Wood Half
es: Elaborado de [FF0000]Tablones[-]. Un material elaborado que puede ser colocado.

source: Wood Vertical
es: Elaborado de [FF0000]Tablones[-]. Material de construcción.

source: Wood Triangle
es: Elaborado de [FF0000]Tablones[-]. Material de construcción.

source: Birch Half
es: Un blanco y sucio Tablón que es a menudo pasado por alto en un montón de creaciones.

source: Birch Vertical
es: Un blanco y sucio Tablón que es a menudo pasado por alto en un montón de creaciones.

source: Birch Triangle
es: Un blanco y sucio Tablón que es a menudo pasado por alto en un montón de creaciones.

source: Palm Half
es: Un Tablón marrón y sucio que es muy similar a los otros tablones.

source: Palm Vertical
es: Un Tablón marrón y sucio que es muy similar a los otros tablones.

source: Palm Triangle
es: Un Tablón marrón y sucio que es muy similar a los otros tablones.

source: Clear Planks Half
es: Un tablón naranja que luce como sí alguien hubiese derramado colorante sobre este. De todas formas, es genial para el piso o las paredes.

source: Clear Planks Vertical
es: Un tablón naranja que luce como sí alguien hubiese derramado colorante sobre este. De todas formas, es genial para el piso o las paredes.

source: Clear Planks Triangle
es: Un tablón naranja que luce como sí alguien hubiese derramado colorante sobre este. De todas formas, es genial para el piso o las paredes.

source: Clear Planks Stairs
es: Un bloque que te da una excusa de no usar tablones para tu techo. Además un excelente reemplazo para escaleras.

source: Stone Half
es: Los antiguos pilares y paredes de castillos están compuestos de este duradero material.

source: Stone Vertical
es: Los antiguos pilares y paredes de castillos están compuestos de este duradero material.

source: Stone Triangle
es: Los antiguos pilares y paredes de castillos están compuestos de este duradero material.

source: Old Stone Half
es: La piedra que ha sido olvidada.

source: Old Stone Vertical
es: La piedra que ha sido olvidada.

source: Old Stone Triangle
es: La piedra que ha sido olvidada.

source: Bricks Half
es: Uno de los bloques más fuertes en existencia, el cuál puede crear excelentes cimientos y defensas. Se elabora usando [FF0000]Piedra Clara[-].

source: Bricks Vertical
es: Uno de los bloques más fuertes en existencia, el cuál hace excelentes cimientos y defensas. Elaborado usando [FF0000]Piedra Clara[-].

source: Bricks Triangle
es: Uno de los bloques más fuertes en existencia, el cuál hace excelentes cimientos y defensas. Elabora usando [FF0000]Piedra Clara[-].

source: Carpet Half
es: Usado para decoración.

source: Carpet Vertical
es: Usado para decoración.

source: Metal Tile
es: Losas encontradas en el espacio completamente moldeadas en hierro.

source: Marble Half
es: Roca metamórfica compuesta de calcita.

source: Marble Vertical
es: Roca metamórfica hecha de calcita.

source: Marble Triangle
es: Roca metamórfica hecha de calcita.

source: Marble Stairs
es: Un bloque que te da una excusa para no utilizar tablones en el tejado. También un gran recambio para escaleras.

source: Pillar Bottom
es: La parte inferior de las antiguas columnas.

source: Pillar
es: Columna antigua.

source: Pillar Top
es: La parte superior de las columnas antiguas.

source: Miracle Stone
es: Material de elaboración. Se encuentran en el Espacio.

source: Iron Half
es: Elaborado a partir del [FF0000]Horno[-].

source: Iron Vertical
es: Elaborado a partir del [FF0000]Horno[-].

source: Iron Triangle
es: Elaborado a partir del [FF0000]Horno[-].

source: Gold Half
es: Elaborado a partir del [FF0000]Horno[-].

source: Gold Vertical
es: Elaborado a partir del [FF0000]Horno[-].

source: Gold Triangle
es: Elaborado a partir del [FF0000]Horno[-].

source: Sponge
es: Un bloque que absorbe agua muy bien. Colocalo cerca de agua y rapidamente absorberá todo alrededor de un radio corto.

source: Daithir Soul
es: Trae a la vida a un pequeño dragón. Listo para pelear a tu lado sin morderte la cabeza. Consume Sopa de Tiburón, Pan, Carne, Manzanas, Pescados Fritos y Cocos para satisfacer su hambre.

source: Vairmut Soul
es: Trae a la vida a un pequeño dragón. Listo para pelear a tu lado sin morderte la cabeza. Consume Sopa de Tiburón, Pan, Carne, Manzanas, Pescados Fritos y Cocos para satisfacer su hambre.

source: Baby Ashkore Soul
es: Trae a la vida a un pequeño dragón. Listo para pelear a tu lado sin morderte la cabeza. Consume Sopa de aleta Tiburón, Pan, Carne, Manzanas, Pescados Fritos y Cocos para satisfacer su hambre.

source: Xordaraxus Soul
es: Trae a la vida a un pequeño dragón. Listo para pelear a tu lado sin morderte la cabeza. Consume Sopa de aleta de Tiburón, Pan, Carne, Manzanas, Pescados Fritos y Cocos para satisfacer su hambre.

source: Onyx Soul
es: El legendario Fénix quien va a pelear a tu lado. Consume Sopa de aleta de Tiburón, Pan, Carne, Manzanas y Cocos para satisfacer su hambre.

source: Sequoia Tree Plant
es: Un árbol enorme. Crece en la [FF0000]Nieve[-], [FF0000]Tierra[-] y en el [FF0000]Césped[-].

source: Big Liana
es: Enredaderas de jungla.

source: Liana
es: Enredaderas de jungla.

source: Amber
es: Material de elaboración encontrado en el Espacio.
