Repository: TheDark98/blockstory-translation
Catalog: translations/Items.po
Languages: es

source: Amber Bricks
es: Ladrillos hechos enteramente de Ámbar. Un material muy raro de los Mundos Externos.

source: Paving Stone
es: Un buen bloque para la construcción de carreteras y el arreglo de tu ciudad.

source: Purplefish
es: Pequeño pez de los Mundos Externos.

source: Fried Purplefish
es: Pez Morado Cocido.

source: DumboOctopus
es: Criatura rara del agua proveniente de los Mundos Externos.

source: Fried DumboOctopus
es: Pulpo Dumbo Frito.

source: Dunkleosteus
es: Pez raro de los Mundos Externos. Ellos viven en pantanos y tienen un caparazón muy fuerte.

source: Fried Dunkleosteus
es: Dunkleosteus Frito.

source: Fangtooth
es: Una extraña criatura del agua proveniente de los Mundos Externos con grandes colmillos.

source: Fried Fangtooth
es: Fangtooth Frito.

source: Gulper
es: Una extraña criatura del agua proveniente de los Mundos Externos con un cuerpo de serpiente y una gran mandíbula.

source: Fried Gulper
es: Gulper Frito.

source: Concrete
es: Buen material de construcción.

source: Mashine Gun Bullet
es: Balas para la Ametralladora.

source: Space Leafs
es: Hojas provenientes de los Mundos Externos.

source: Space Flower
es: Flores provenientes de los Mundos Externos.

source: Acid Grass
es: Brillante césped verde encontrado en los Mundos Externos.

source: Glowing Grass
es: Brillante césped azul encontrado en los Mundos Externos.

source: Mushroom
es: Un hongo muy venenoso.

source: Moss
es: Musgo que fué encontrado en los Mundos Externos.

source: Straight Grass
es: Pequeños mechones de follaje no cúbicos que brotarán en cualquier parte de la superficie.

source: Blooming Grass
es: Pequeños mechones de follaje no cúbico que crecen donde sea en la superficie.

source: Moon Sand
es: Un material sedimentario que puede ser encontrado en el Espacio.

source: Mushroom Trunk
es: El tronco de un hongo muy venenoso.

source: Space Grass
es: Césped que viene del Espacio.

source: Space Dirt
es: Tierra que viene del Espacio.

source: Grace
es: Material que puede ser usado para crear las Alas de Ángel.

source: Phoenix Wing
es: Plumas del Fénix.

source: Fire Essence
es: Una increíble y caliente partícula del mismo Fénix.

source: Jungle Grass
es: El césped más común que es encontrado en la Jungla.

source: Cheat Diamond
es: Cuando intentas hacer trampa, obtienes estos diamantes falsos. ¡Felicidades!

source: Railway Dead End
es: Colócalo cerca del final de tus vías y la vagoneta o la locomotora va a parar automáticamente.

source: Bottle Empty Note
es: Botella extraña con una nota en el interior. Fue encontrada en el mar.

source: Bottle Poi Note
es: Botella extraña con una nota en el interior. Fue encontrada en el mar.

source: Bottle son Note
es: Botella extraña con una nota en el interior. Fue encontrada en el mar.

source: Note Empty
es: Nota vacía

source: Magic Scroll
es: Un pergamino mágico único que contiene una receta para un instrumento antiguo.

source: Note With Symbols
es: 52656369706520696e6772656469656e74732047726163652038204669726520457373656e63652032302050686f656e69782057696e6720313030

source: Wrench
es: Con una llave, puede desasentrar los vehículos y volver a colocarlos en su inventario.

source: Locomotive
es: Una hermosa locomotora antigua, un poco más rápida que una Vagoneta ordinaria. Este viejo duende conoce su trabajo con seguridad. puede ser teñida en una mesa de construcción.

source: Multitool
es: Una herramienta versátil que te permite cavar rápidamentey desde una larga distancia.

source: Meteorite Ore
es: ¿De dónde vino esto? Leyendas afirman que este misterioso material se puede usar para crear objetos antiguos.

source: Eldriar Soul
es: La leyenda dice que este dragón fue una vez tan poderoso que incluso el propio Señor Dragón no podía domesticar a esta bestia. Él fue una vez tan poderoso que podía llamar una lluvia de meteoritos sólo por el sonido de su rugido. Consume sopa de aleta de tiburón, pan, carne, manzanas, pescados fritos y cocos para satisfacer su apetito.

source: Dragon Egg
es: Este huevo increíblemente raro se usa para convocar a Eldriar. La leyenda dice que este huevo está bien escondido en un cofre al azar en este mundo.

source: Blue Dragon Armor
es: Armadura forjada específicamente para el dragón de combate. Puede aumentar la supervivencia de otras mascotas. Colóquelo en la mascota en la ranura apropiada en su inventario.

source: Red Dragon Armor
es: Armadura forjada específicamente para el dragón de combate. Puede aumentar la supervivencia de otras mascotas. Colóquelo en la mascota en la ranura apropiada en su inventario.

source: Emerald Dragon Armor
es: Armadura forjada específicamente para el dragón de combate. Puede aumentar la supervivencia de otras mascotas. Colóquelo en la mascota en la ranura apropiada en su inventario.

source: Old Dragon Armor
es: Armadura forjada específicamente para el dragón de combate. Puede aumentar la supervivencia de otras mascotas. Colóquelo en la mascota en la ranura apropiada en su inventario.

source: Flame of the Cosmic Forge
es: La llama del horno de antiguas civilizaciones cósmicas, ardiendo en forma de letra S, se utiliza para crear un arma muy poderosa diseñada para derrotar al Fénix. Cinco habitaciones secretas en el espacio guardan el secreto del resto de los ingredientes. 2 1 2 2 1 2 4 3 4

source: Airplane
es: Un mecanismo inusual con alas similares a las de un pájaro. Fue creado por duendes bajo el liderazgo del rey de este mundo. ¡¡¡ULTRA SECRETO!!!

source: Remote Sensor
es: Transmisor inalámbrico de electricidad. Se utiliza para transmitir electricidad a través de paredes o para activar determinados vehículos.

source: Relay Sensor
es: El relé es capaz de cambiar la señal de corriente eléctrica a positiva o negativa. Le permite obtener más control sobre algunos bloques controlados eléctricamente.

source: Electric Torch
es: Una linterna que se controla con electricidad al conectarle cables.

source: Relay Controller
es: La unidad de control para algunos módulos ubicados en las proximidades mediante el paso de una carga eléctrica a través de ella. Puede cambiar unidades como temporizador, relé, diodo o resistencia.

source: Piston
es: Un pistón que puede empujar o tirar hasta 10 bloques en una dirección determinada. Funciona con electricidad.

source: Wood Piston
es: Un pistón que puede empujar o tirar hasta 10 bloques en una dirección determinada. Funciona con electricidad.

source: Light Sensor
es: Este sensor envía una carga eléctrica positiva o negativa a través de los cables dependiendo de la iluminación.

source: Gramophone
es: Tocadiscos antiguo para escuchar grabaciones musicales.

source: Wires
es: Otro invento loco de duendes. El cable se conecta a un generador o sensor para crear una carga eléctrica que puede ser controlada por múltiples módulos y bloques para crear mecanismos complejos. Se puede montar tanto en suelo como en paredes y techos. Para crear un botón, se debe instalar un cable en el costado del generador, y para crear una placa de presión, el cable debe instalarse en la parte superior.

source: Motion Sensor
es: Un sensor que envía una carga eléctrica cuando un objeto en movimiento entra en su campo de visión.

source: Timer Sensor
es: El módulo envía una carga eléctrica a intervalos de 5, 10, 20, 30 o 60 segundos dependiendo de la posición de los interruptores.

source: Variable Resistor
es: Módulo de control de caudal eléctrico.

source: Heavy Metal Swords
es: Espadas forjadas según la receta secreta de los mejores artesanos extraterrestres. ¡Puedes legítimamente llamarte a ti mismo un gran maestro!

source: Clock
es: Reloj de pared que muestra la hora del día.

source: Drum Music Box
es: Bloque de música con sonidos de instrumentos de percusión, se puede activar mediante electricidad.

source: Accordion Music Box
es: Bloque de música con acordeón y sonidos de órgano, se puede activar con electricidad.

source: Guitar Music Box
es: Bloque musical con sonidos de guitarra acústica y eléctrica, se puede activar mediante electricidad.

source: Piano Music Box
es: Bloque de música con sonidos de piano, se puede activar con electricidad.

source: Diode
es: Le permite controlar la dirección del flujo eléctrico. La posición de la flecha se puede utilizar para establecer la dirección en la que puede fluir la electricidad.

source: Record Siren
es: Disco musical, se puede utilizar en un gramófono.

source: Record Haven
es: Disco musical, se puede utilizar en un gramófono.

source: Record Abyss
es: Disco musical, se puede utilizar en un gramófono.

source: Record Arpeggio
es: Disco musical, se puede utilizar en un gramófono.

source: Record Atmosphere
es: Disco musical, se puede utilizar en un gramófono.

source: Record Atmosphere Piano
es: Disco musical, se puede utilizar en un gramófono.

source: Record Boss Fight
es: Disco musical, se puede utilizar en un gramófono.

source: Record Desrtino
es: Disco musical, se puede utilizar en un gramófono.

source: Record Epic
es: Disco musical, se puede utilizar en un gramófono.

source: Record Guitar Accords
es: Disco musical, se puede utilizar en un gramófono.

source: Record Menu Theme
es: Disco musical, se puede utilizar en un gramófono.

source: Record Miracles
es: Disco musical, se puede utilizar en un gramófono.

source: Record Mistery
es: Disco musical, se puede utilizar en un gramófono.

source: Record New Forest
es: Disco musical, se puede utilizar en un gramófono.

source: Record Pip Orquesta
es: Disco musical, se puede utilizar en un gramófono.

source: Record Solar
es: Disco musical, se puede utilizar en un gramófono.

source: Record Vanity
es: Disco musical, se puede utilizar en un gramófono.

source: Record Wonderland
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - 8bit
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Indie
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Ragga
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Ray of sunset
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Serenity
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Space 80s
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Thoughts
es: Disco musical, se puede utilizar en un gramófono.

source: Record Tradiore - Walpurgis Night
es: Disco musical, se puede utilizar en un gramófono.

source: Record Pirates - Silent Sea
es: Disco musical, se puede utilizar en un gramófono.

source: Record Pirates - Ending
es: Disco musical, se puede utilizar en un gramófono.
