Repository: TheDark98/blockstory-translation
Catalog: translations/ItemNames.po
Languages: it

source: Sky Leaves
it: Foglie del Cielo

source: Axe
it: Ascia

source: Jungle Bush Plant
it: Cespuglio della giungla

source: Goblin Pants
it: Pantaloni Goblin

source: Tentackle Staff
it: Bastone Tentacolo

source: Saw Shield
it: Scudo della vista

source: Animal Spawner
it: Riproduttore di animali

source: Old Stone Fence
it: Recinzione in Pietra Antica

source: Goblin PickAxe
it: Piccone del Goblin

source: Bricks
it: Mattoni

source: Hammer
it: Martello

source: Oak Leaves
it: Foglie di quercia

source: Poplar Leaves
it: Foglie di pioppo

source: Wheat Seed
it: Chicco di grano

source: Brick Stairs
it: Scale in Mattoni

source: Jungle Bush Green
it: Cespuglio Verde della Giungla

source: Dragonscale
it: Scaglia di Drago

source: Chest
it: Cassa

source: Warrior Boots
it: Stivali da Guerriero

source: Arrow
it: Freccia

source: Replicon
it: Agente Mutageno

source: Old Stone Stairs
it: Scale in Pietra Antica

source: Gravity Boots
it: Scarponi Per la Gravità

source: Ticket
it: Biglietto

source: Electrite
it: Elettricità

source: Necklace Of Life
it: Collana Della Vita

source: Palm Plank
it: Asse di palma

source: Boat
it: Barca

source: Wood Window
it: Finestra di Legno

source: Leaves
it: Foglie

source: Miner Helmet
it: Casco da Minatore

source: Pumpkin
it: Zucca

source: Cactus Plant
it: Cactus

source: Palm Bark
it: Legno di palma

source: Cryptonite
it: Kryptonite

source: Life Magic
it: Vita Magica

source: Dragon Soul
it: Anima di Drago

source: Tentackle Magic
it: Tentacolo Magico

source: Spider Soul
it: Anima di Ragno

source: Skull
it: Teschio

source: Monster Spawner
it: {0} Madre di Mostri

source: Acacia Plant
it: Pianta di Acacia

source: Birch Plank
it: Tavola di Betulla

source: water
it: Acqua

source: Meat
it: Carne

source: Desert Bird Spawner
it: {0} Madre di uccelli del deserto

source: Yellow Coral
it: Corallo Giallo

source: Teleportation Arrow
it: Freccia Teletrasportatrice

source: Gold Ore
it: Oro Grezzo

source: Baobab Plant
it: Pianta di Baobab

source: Car
it: Automobile

source: Apple Tree Plant
it: Pianta di Melo

source: Food
it: cibo

source: Gun
it: Pistola

source: Dragon Armor
it: Armatura Da Drago

source: Birch Bark
it: Legno di Betulla

source: Ring
it: Anello

source: Angelic Swords
it: Spade Angeliche

source: Bread
it: Pane

source: Baobab Leaves
it: Foglie di Baobab

source: Crystal Block Red
it: Rubino

source: Glass
it: Vetro

source: Diver Suit
it: Tuta da sub

source: Forgotten Grass
it: Erba Dimenticata

source: Bucket
it: Secchio

source: Dye
it: Tinta

source: Magic Orb
it: Sfera magica

source: Dragon Shield
it: Scudo da Drago

source: Fire Arrow
it: Freccia Infuocata

source: Gold Bar
it: Lingotto d'Oro

source: Birch Stairs
it: Scale in Legno di Betulla

source: Watermelon
it: Anguria

source: Pine Plant
it: Pino

source: Bow
it: Arco

source: Unobtainium Bar
it: Lingotto di unobtanio

source: Brick Fence
it: Recinzione in Mattoni

source: Stone
it: Pietra

source: Clouds
it: Nuvole

source: Spider Web
it: {0} Tela di ragno

source: Seed
it: Seme

source: Iron Hammer
it: Martello di Ferro

source: Crystal Block Blue
it: Zaffiro

source: Window
it: Finestra

source: Gold Block
it: Blocco d'oro

source: Aragog Eye
it: Occhio di Aragog

source: Spider Fang
it: Zanna di ragno

source: Wheat Crop
it: Grano Raccolto

source: Iron Shovel
it: Pala di Ferro

source: Fence
it: Recinto

source: Health Potion
it: Pozione della Salute

source: Stick
it: Bastone

source: Green Coral
it: Corallo Verde

source: Cauldron
it: Calderone

source: Wood Door
it: Porta di Legno

source: Antique Spawner
it: Nido antico

source: Acid
it: Acido

source: Megalodon Tooth
it: Dente di Megalodonte

source: Hunting Knife
it: Coltello da Caccia

source: Palm Stairs
it: Scale in legno di Palma

source: Trident
it: Tridente

source: Dig
it: Piccone di pietra

source: Pumpkin Head
it: Testa di zucca

source: Unobtainium
it: Unobtainio

source: Sulphure Ore
it: Zolfo Grezzo

source: Shirt
it: Camicia

source: Sand Clock
it: Clessidra

source: Forgotten Stone Old
it: Vecchia Pietra Dimenticata

source: Iron Axe
it: Ascia di Ferro

source: Dragon Pants
it: Pantaloni da Drago

source: Blue Flower
it: Fiore blu

source: Soul Catcher
it: Cacciatore di Anime

source: Graviton
it: Gravitone

source: Air Ring
it: Anello d'aria

source: Deerskin
it: Pelle di Cervo

source: Elevator
it: Ascensore

source: Energy
it: Energia

source: Snow
it: Neve

source: Great Sword
it: Grande Spada

source: Shark Fin Soup
it: Zuppa di pinne di Squalo

source: Red Flower
it: Fiori rossi

source: Jungle Tree Plant
it: Albero della giungla

source: Epic Sword
it: Spada Epica

source: Torch
it: Torcia

source: Generator
it: Generatore

source: Drill
it: Distruttore

source: Snow Leaves
it: Foglie di neve

source: Apple
it: Mela

source: Cat Soul
it: Anima di gatto

source: Book Shelf
it: Scaffale di Libreria

source: Iron Ore
it: Ferro Grezzo

source: Grass 3D
it: Erba 3D

source: Palm Plant
it: Palma

source: CarBody
it: Carrozzeria dell'auto

source: Dragon Boots
it: Stivali da Drago

source: Iron Block
it: Blocco di ferro

source: Electric Pipe
it: Tubo

source: Grass
it: Erba

source: Poisoned Arrow
it: Freccia avvelenata

source: Blue Dye
it: Colorante blu

source: Yellow Dye
it: Colorante giallo

source: Swamp
it: Palude

source: Hand Torch
it: Torcia

source: BoarSkin
it: Pelle di cinghiale

source: Stone Stairs
it: Scale in Pietra

source: Springs
it: Molle

source: Dragon Heart
it: Cuore di drago

source: Magic Arrow
it: Freccia magica

source: Coal
it: Carbone

source: Hoe
it: Zappa

source: Letter
it: Lettera

source: Candle
it: Candela

source: Fence Gate
it: Cancello

source: Fuel
it: Carburante

source: Table
it: Tavolo

source: Fire
it: Fuoco

source: Wheat
it: Grano

source: Pants
it: Pantaloni

source: My Precious
it: Il Mio tesssoro

source: Epic Shield
it: Scudo Epico

source: Jungle Grass
it: Erba della giungla

source: Ice
it: Ghiaccio

source: Hydra
it: Idra

source: Crystal Block Black
it: Blocco di cristallo nero

source: Swamp Stone
it: Pietra paludosa

source: Rose Bush
it: Cespuglio di rose

source: Sand Stone
it: Arenaria

source: Bed
it: Letto

source: Dirt
it: Sporcizia

source: Nest
it: {0} Nido

source: Spider Venom
it: Veleno

source: Dark Staff
it: Bastone oscuro

source: Forgotten Stone
it: Pietra Dimenticata

source: Forgotten Stone Antique
it: Antica Pietra Dimenticata

source: Shovel
it: Vanga

source: Crystal Block Green
it: Smeraldo

source: Birch Leaves
it: Foglie di betulla

source: Wax
it: Cera

source: Iron Dig
it: Piccone di ferro

source: Brush
it: Pennello

source: Birch Fence
it: Recinzione in legno di Betulla

source: Coco Bean
it: Cocco

source: GiantSpider
it: Aragog

source: Furnace
it: Caldaia

source: Paraffin
it: Alveare

source: Lilia Flower
it: Glicine

source: Alien Dog Soul
it: Anima di Gontar

source: Boots
it: Stivali

source: Spirit Necklace
it: Collana degli spiriti

source: Forgotten Bushes
it: Cespugli Dimenticati

source: Bullet
it: Proiettile

source: Magic
it: Magia nera

source: Safebox
it: Cassaforte

source: Green Fluorite
it: Smeraldo Grezzo

source: Saddle
it: Sella

source: Red Dye
it: Colorante rosso

source: Warrior Armor
it: Armatura da guerriero

source: Nature Staff
it: Bastone della natura

source: Pan Tool
it: Setaccio

source: Stone Fence
it: Recinzione in Pietra

source: Palm Leaves
it: Foglie di palma

source: Skeletone Helmet
it: Elmo di scheletro

source: JetPack
it: Zaino-jet

source: Spikes Magic
it: Chiodo magico

source: Bone
it: Osso

source: Spruce Plant
it: Abete Rosso

source: Oak Tree Plant
it: Quercia

source: Clear Plank
it: Tavola pulita

source: Wheel
it: Ruota

source: Hat
it: Cappello

source: Replicator
it: Replicatore

source: Coal Ore
it: Carbone Grezzo

source: Palm Fence
it: Recinzione in legno di Palma

source: Goblin Armor
it: Armatura Goblin

source: Fire Staff
it: Bastone del fuoco

source: Iron Bar
it: Sbarra di ferro

source: Sea Grass
it: Alghe

source: Antique Window
it: Finestra antica

source: TrapDoor
it: Botola

source: Devil Rock
it: Roccia dell'Inferno

source: Birch Plant
it: Pianta di Betulla

source: Raven Wing
it: Ala di corvo

source: Coloring Block
it: Blocco da colorare

source: Metal Fence Gate
it: Cancello di Ferro

source: Stair
it: Scala

source: Mistic Ring
it: Anello mistico

source: Duck Spawner
it: Fecondatrice di anatre

source: Dragon Helmet
it: Elmo di Drago

source: Teleport
it: Teletrasportatore

source: Swamp Spawner
it: {0} Generatore di paludi

source: Bark
it: Legno

source: Sand
it: Sabbia

source: Short Sword
it: Spada corta

source: Crystal Sword
it: Spada di Cristallo

source: Bones Shield
it: Scudo d'osso

source: Dog Soul
it: Anima di cane

source: GunPowder
it: Polvere da sparo

source: SheepSkin
it: Pelle di pecora

source: Dragon Ring
it: Anello del drago

source: Clear Stone
it: Pietra pulita

source: Chair
it: Sedia

source: Red Leaves
it: Melma

source: Red Crystals
it: Rubino Grezzo

source: Forgotten Leaves
it: Foglie Dimenticate

source: HorseSkin
it: Pelle di cavallo

source: Poplar Plant
it: Pioppo

source: Flippers
it: Pinne

source: Warrior Pants
it: Pantaloni da guerriero

source: Long Sword
it: Spada lunga

source: Sword
it: Spada

source: Engine
it: Motore

source: Shark Fin
it: Pinna di squalo

source: Yellow Flower
it: Fiore Giallo

source: Mana Potion
it: Pozione del mana

source: Explosive Arrow
it: Freccia esplosiva

source: Diamond
it: Diamanti

source: Plank
it: Asse

source: Goblin Helmet
it: Elmo Goblin

source: Pine Leaves
it: Aghi di pino

source: Fire Magic
it: Fuoco Magico

source: Rose Flower
it: Rosa

source: Blue Crystals
it: minerale di Zaffiro

source: Craft Table
it: Crea Tavolo

source: Spikes Staff
it: Bastone a punta

source: Ladder
it: scala

source: Klorium
it: Clorium

source: Jungle Bush Leaves
it: Cespuglio di Foglie di Giungla

source: Jungle Leaves
it: Foglie di Giungla

source: Rose Flowers
it: Fiori di Rose

source: Jungle Flower
it: Fiore di giungla

source: Vehicles
it: Veicoli

source: Neck
it: Collo

source: Skill Reset
it: Ripristino Abilità

source: Marble Block
it: Blocco di marmo

source: Anvil
it: Incudine

source: DragonLord
it: Signore Drago

source: Cannon
it: Cannone

source: Mech Leg Left
it: Mech gamba sinistra

source: Mech Leg Right
it: Mech gamba destra

source: Rocket Launcher
it: Lanciarazzi

source: Ventilation Left
it: Ventilazione sinistra

source: Ventilation Right
it: Ventilazione a destra

source: Storage Row
it: Riga di archiviazione

source: Battle Axe
it: Ascia da battaglia

source: Christmas Tree
it: Albero di Natale

source: Rails
it: Rotaie

source: Sign
it: Cartello

source: Rainbow Basilisk Soul
it: Anima del Basilisco Arcobaleno

source: Viking Boat
it: Barca vichinga

source: Fish Rod
it: canna da pesca

source: Fried ClownFish
it: Pesce pagliaccio fritto

source: Fried LionFish
it: Pesce Leone Fritto

source: Fried GruntFish
it: Grunt Fritto Di Pesce

source: Fried TriggerFish
it: Pesce Balestra Fritto

source: Fried Squid
it: Calamaro fritto

source: Fried Stingray
it: Pastinaca Fritta

source: Fried Urchin
it: Ricci Di Mare Fritti

source: Fried Shark
it: Squalo Fritto

source: ClownFish
it: Pesce pagliaccio

source: LionFish
it: Pesce leone

source: GruntFish
it: pesce grugnito

source: TriggerFish
it: pesce balestra

source: Squid
it: Calamaro

source: Urchin
it: Riccio di mare

source: Mashine Gun
it: Mitragliatrice

source: Amber
it: Ambra

source: Wood Half
it: Metà legno

source: Wood Vertical
it: Legno verticale

source: Wood Triangle
it: Triangolo di legno

source: Carpet Vertical
it: Tappeto verticale

source: Metal Tile
it: Piastrelle di metallo

source: Marble Vertical
it: Marmo verticale

source: Marble Triangle
it: Triangolo di marmo

source: Pillar Bottom
it: Pilastro inferiore

source: Pillar
it: Pilastro

source: Pillar Top
it: Pilastro in alto

source: Iron Vertical
it: Ferro verticale

source: Gold Vertical
it: Oro verticale

source: Metal Lattice Door
it: Porta a grata metallica

source: Metal Door
it: Porta di metallo

source: Alien Fish Rod
it: Canna da pesca aliena

source: Sunshard Paula
it: Frammento solare

source: Sunshard Wizard
it: Frammento solare

source: Goblin Rocket Launcher
it: Lanciarazzi Goblin

source: Angel Wings
it: Ali d'angelo

source: Xordaraxus Soul
it: Anima di Xordaraxus

source: Big Liana
it: Grande Liana

source: Amber From Bricks
it: ambra dai mattoni

source: Fried DumboOctopus
it: Polpo Dumbo Fritto

source: Fried Dunkleosteus
it: Dunkleosteus fritto

source: Concrete
it: Calcestruzzo

source: Mashine Gun Bullet
it: Proiettile di mitragliatrice

source: DumboOctopus
it: Polpo Dumbo

source: Static Water
it: Acqua statica

source: Static Lava
it: Lava statica

source: Static Swamp
it: Palude Statica

source: Mushroom Trunk
it: Tronco di funghi

source: Mushroom
it: Fungo

source: Moss
it: Muschio

source: Space Leafs
it: Spazio Foglie

source: Railway Dead End
it: Vicolo cieco ferroviario

source: Bottle son Note
it: Bottiglia con nota

source: Bottle Poi Note
it: Bottiglia con nota

source: Bottle Empty Note
it: Bottiglia con nota

source: Note Empty
it: Nota vuota

source: Note Poi
it: Nota con simboli

source: Note son
it: Nota con simboli

source: Note With Symbols
it: Nota con simboli

source: Note Empty Iron
it: Nota vuota

source: Note Poi Iron
it: Nota con simboli

source: Note son Iron
it: Nota con simboli

source: Locomotive
it: Locomotiva

source: Wrench
it: Chiave inglese

source: Multitool
it: Multi attrezzo

source: Teleport / Bed / Vehicle
it: Letto / Veicolo

source: Wires
it: fili

source: Piston
it: Pistone

source: Light Sensor
it: Sensore di luce

source: Timer Sensor
it: Timer

source: Relay Sensor
it: relè

source: Variable Resistor
it: Resistenza variabile

source: Relay Controller
it: Controllore

source: Remote Sensor
it: Trasmettitore

source: Piano Music Box
it: Carillon per pianoforte

source: Guitar Music Box
it: Carillon per chitarra

source: Accordion Music Box
it: Carillon a fisarmonica

source: Drum Music Box
it: Scatola musicale per batteria

source: Gramophone
it: Grammofono

source: Diode
it: Diodo

source: Flame of the Cosmic Forge
it: Fiamma della Forgia Cosmica

source: Airplane
it: Aereo

source: Record Siren
it: Registra la sirena

source: Record Haven
it: Il paradiso dei record

source: Record Abyss
it: Registra Abyss

source: Record Arpeggio
it: Registra l'arpeggio

source: Record Atmosphere
it: Registra l'atmosfera

source: Record Atmosphere Piano
it: Registra l'atmosfera del pianoforte

source: Record Desrtino
it: Registra Desrtino

source: Record Epic
it: Registra epico

source: Record Guitar Accords
it: Registra accordi per chitarra

source: Record Menu Theme
it: Tema del menu di registrazione

source: Record Miracles
it: Registra miracoli

source: Record Mistery
it: Registra il mistero

source: Record New Forest
it: Registra nuova foresta

source: Record Solar
it: Registra solare

source: Record Vanity
it: Vanità da record

source: Record Wonderland
it: Registra il Paese delle Meraviglie

source: Record Tradiore - 8bit
it: Registra Tradiore - 8bit

source: Record Tradiore - Ray of sunset
it: Record Tradiore - Raggio di tramonto

source: Record Tradiore - Space 80s
it: Record Tradiore - Spazio anni '80

source: Record Tradiore - Thoughts
it: Record Tradiore - Pensieri

source: Record Tradiore - Walpurgis Night
it: Record Tradiore - La notte di Valpurga

source: Record Pirates - Ending
it: Record Pirates - Finale
