Repository: TheDark98/blockstory-translation
Catalog: translations/Items.po
Languages: es

source: Sky Leaves
es: Las hojas que sólo se encuentran en los [FF0000]Cielos Olvidados[-], verás que contienen bellotas en su interior si las miras detenidamente. Me pregunto si le podría interesar a alguna ardilla.

source: Axe
es: Una herramienta útil para talar madera. Tala más y mejor que con las manos desnudas. Para usarla, abre el Inventario, elige el [FF0000]Hacha[-], y mantén presionado el bloque que quieras romper.

source: Jungle Bush Plant
es: Crece en la [FF0000]Tierra[-] o en la [FF0000]Hierba[-].

source: Spider Venom
es: Si crees que las picaduras duelen, ¡aún no has visto nada! El veneno fluye a través de tus venas, volviendo la sangre en fuego y derritiendo tus huesos. ¡BWAHAHAHA!

source: Saw Shield
es: Escudo circular y puntiagudo. Que no te engañe su belleza, cuando estés luchando contra un monstruo vicioso querrás tenerlo cerca.

source: Animal Spawner
es: Los generadores pacíficos que se pueden encontrar casi en cualquier lugar suelen engendrar animales y seres "amigables". Producen un resplandor azul.

source: Old Stone Fence
es: Valla de piedra ornamental. Genial para atrapar o retener animales.

source: Palm Bark
es: La madera del cocotero se utiliza como material de construcción.

source: TRex
es: Durante bastante tiempo, se creyó que estos asesinos naturales se habían extinguido.

source: Bricks
es: Uno de los bloques más fuerte de todos. Se puede transformar en fundiciones y buenas defensas. Se elabora usando [FF0000]Piedra Clara[-].

source: Hammer
es: Herramienta útil para cavar en superficies duras. Cava más y más rápido que con las manos desnudas. Para utilizarlo, abre el inventario, selecciona [FF0000]Martillo[-], pulsa y mantén sobre el bloque que desees romper.

source: Cactus Plant
es: Crece en la [FF0000]Arena[-].

source: Oak Leaves
es: Un conjunto de hojas que tienen bellotas dentro. Generalmente se encuentran en los biomas de hierba. Si tienes suerte puedes encontrar cera alrededor.

source: Poplar Leaves
es: Hojas de los Álamos del Desierto.

source: Brick Stairs
es: Un bloque que te da una excusa para no utilizar tablas para el techo. También un gran recambio para escaleras.

source: Jungle Bush Green
es: Muy parecido a las Hojas de la Selva, pero estos se encuentran en la superficie del bioma de la Selva.

source: Dragonscale
es: La escama de un poderoso dragón. Úsala para elaborar la más poderosa de las armaduras.

source: Poplar Plant
es: Crece en la [FF0000]Tierra[-], la [FF0000]Hierba[-] o en la [FF0000]Arena[-].

source: Remove_Item
es: [00FF00]Eliminado{0}x {1} del Inventario.[-]

source: Warrior Boots
es: Estas botas de cuero e hierro están bien hechas. Diseñadas para permitir movimientos más rápidos.

source: Arrow
es: Pequeña y bonita flecha que perfora sus objetivos. Seguro que un arquero la necesitará.

source: Old Stone Stairs
es: Un bloque que te da una excusa para no utilizar tablas para tu techo. También un gran recambio para escaleras,.

source: Gravity Boots
es: Las botas mágicas que aumentan la gravedad de manera artificial. Se pueden utilizar con el [FF0000]Traje de Buzo[-].

source: Ticket
es: Úsalo para ver películas y conseguir algunos diamantes gratis.

source: Electrite
es: Un material extraño, dicen que viene del Cielo.

source: Necklace Of Life
es: Este ornamento aprovecha las capacidades curativas de la [FF0000]Kriptonita[-] y los [FF0000]Arbustos Olvidados[-], que curan las heridas físicas a una velocidad increíble.

source: Red Leaves
es: Hojas de árboles de tus pesadillas que estarán en llamas por toda la eternidad.

source: Storage Row Player
es: Añade 5 objetos más a tu Inventario.

source: Wood Window
es: Una bonita ventana de mimbre. Ideal para casas de campo.

source: Soul Catcher
es: Con esta magia puedes transformar las criaturas en sus generadores.

source: Miner Helmet
es: Si quieres ser un verdadero minero definitivamente tienes que tener esto. Equípatelo para iluminar cuevas o por la noche para ver en la oscuridad.

source: Pumpkin
es: Un bloque muy raro que se puede encontrar en el desierto. Es genial para usarlo en Jardines o Granjas.

source: Forgotten Bushes
es: Los arbustos que crecen en las praderas giratorias de los [FF0000]Cielos Olvidados[-]. Son muy apreciados por sus propiedades medicinales y su belleza.

source: Magic Arrow
es: Flecha llena de magia del mundo de [FF0000]Block Story[-].

source: Ashkore
es: Absorbiendo la energía del trueno, la esencia antigua, la desenvaina con una sed de destrucción, dejándola libre.

source: Cryptonite
es: La Kryptonita es la encarnación del poder de curación de la naturaleza. Esta sustancia preciosa se usa principalmente en joyería, que realza la capacidad de curarse del portador.

source: Life Magic
es: Utiliza propiedades mágicas de una [FF0000]Kryptonita[-] purificada para curar heridas. Los daños desaparecen.

source: Dragon Soul
es: Devuelve la vida a un pequeño dragón. Dispuesto a luchar a tu lado sin morderte la cabeza. Consume Sopa de Aleta de Tiburón, Pan, Carne, Manzanas, Peces Cocidos y Cocos para saciar su hambre.

source: Tentackle Magic
es: Un arma maligna. Utiliza una [000000]Montura[-] rota para someter a una bestia de pura avaricia y hambre.

source: Spider Soul
es: Devuelve la vida a una pequeña araña. Dispuesta a luchar a tu lado sin atraparte en su tela. Consume Carne para saciar su apetito.

source: Storage Row Pet
es: Añade 4 objetos más a tu Inventario de mascotas.

source: Skull
es: Un testimonio de lo que pasa cuando eres arrogante. Ve a las ruinas del Inframundo para conseguirlas.

source: Pan Tool
es: Se usa para separar el oro de la arena y las semillas de la hierba.

source: Monster Spawner
es: Generador de Místico Maligno que puede generar todo tipo de deformaciones. Puede ser una molestia y genera un resplandor rojo.

source: Plank
es: Fabricado con [FF0000]Madera[-]. Un material de construcción que se puede teñir o colocar.

source: Forgotten Stone Antique
es: Estas reliquias antiguas tienen poderosos secretos. Los Duendes defenderán estos secretos a toda costa.

source: Birch Plank
es: El Tablón blanco y desordenado que a menudo está lleno de muchas creaciones. También se puede pintar.

source: water
es: Un Recurso Natural que te ha traído todos los peces y los tiburones al mar. Se pueden encontrar en casi cualquier lugar, literalmente.

source: Meat
es: La carne sabrosa se puede conseguir a partir de muchos animales. Al comerla, se completa una comida restaurando la salud.

source: Desert Bird Spawner
es: Nido hecho de palos rotos. Hogar de los cuervos en el árido Desierto.

source: Yellow Coral
es: El hermoso Coral fluorescente se engendra en el fondo del Océano.

source: Teleportation Arrow
es: Teletransporta un monstruo al jugador al impactar. Teletransporta al jugador al impactar en un terreno localizado.

source: Leaves
es: Los bloques verdes y maduros que crecen en los árboles.

source: Baobab Plant
es: Crece en la [FF0000]Tierra[-], en la [FF0000]Hierba[-] o en la [FF0000]Arena[-].

source: Car
es: Un vehículo que permite a cualquier aventurero ir rápidamente de un sitio a otro. Viaja a través de la Historia de Bloques en un nuevo vehículo, a la vieja usanza, ¡y con tracción a las cuatro ruedas! se puede teñir en la mesa de construcción.

source: Apple Tree Plant
es: Crecen en la [FF0000]Tierra[-] o en la [FF0000]Hierba[-].↵ Produce Manzanas.

source: Gun
es: Un arma con alcance para destruirlo todo. Asegúrate de tener un objetivo. Necesita [FF0000]Balas[-] y [FF0000]Pólvora[-] para funcionar.

source: Dragon Armor
es: Hecho de [FF0000]Escamas de Dragón[-].

source: Birch Bark
es: Una madera suave de buena calidad que se encuentra en los bosques. Útil para construir [FF0000]Coches[-].

source: Angelic Swords
es: Un arma con un inmenso poder. La leyenda dice que la creó el mismísimo Zeus y la bloqueó porque se consideraba demasiado peligrosa en manos humanas.

source: Goblin Pants
es: Los pantalones que prácticamente te transforman en un Duende. Los Duendes realmente saben como fabricarse su propia ropa. El único problema es que esos pantalones te hacen gordo/a.

source: Baobab Leaves
es: Los conjuntos de hojas frescas son más frecuentes en el bioma de hierba.

source: Crystal Block Red
es: Un bloque rojo sangre hecho de Rubíes.

source: Glass
es: Un bloque transparente muy bonito que te permite mirar dentro de una cierta zona. Tiñe la arena antes de hacer el cristal para conseguir sombras diferentes.

source: Diver Suit
es: Te permite sumergirte en aguas profundas sin ahogarte. Se rellena de oxígeno utilizando [FF0000]Gasolina[-].

source: Forgotten Grass
es: La Hierba que procede de los [FF0000]Cielos Olvidados[-].

source: Chair
es: Decoración casera común.

source: Dye
es: Los tintes se pueden combinar en la mesa de pintor para crear colores nuevos. Se usa principalmente para teñir objetos o bloques, o para crear un pincel.

source: Magic Orb
es: Teletransporte entre mundos guardados.

source: Dragon Shield
es: Escudo bien detallado, aunque oxidado, con un dragón grabado en la parte delantera. Aunque el escudo en general no está mal, también te puede proteger de ataques aleatorios.

source: Fire Arrow
es: Añade daño extra por fuego tras el impacto.

source: Bread
es: Pan de trigo con grano entero pasado de moda.

source: Gold Bar
es: Elaborado con el [FF0000]Horno[-]. Se puede utilizar para hacer armas y otras herramientas.

source: Birch Stairs
es: Un bloque que te da una excusa para no utilizar tablas para el tejado. También es un gran recambio para escaleras.

source: Watermelon
es: Este primo de la [FF0000]Calabaza[-] es extremadamente raro. La sandía aparece tan poco que se sabe muy poco sobre su crecimiento. Sólo se han encontrado muestras, entorpeciendo aún más su estudio. El único conocimiento sólido es que prefieren las [FF0000]Praderas[-].

source: Pine Plant
es: Crece en la [FF0000]Nieve[-].

source: Bow
es: Un gran arma para aquellos a los que les gusta apuntar y disparar. Asegúrate de que no "Lanzas una Flecha a tu Rodilla" Úsala con cualquier variedad de flechas.

source: Unobtainium Bar
es: Creado con el [FF0000]Horno[-]. Puede utilizarse para crear las herramientas más poderosas de este mundo.

source: Klorium
es: El mineral verde encontrado en los reinos celestiales. Posee algo de poder mágico que se puede usar como arma.

source: Stone
es: Material duro que conforma los cimientos de la tierra. Se puede utilizar para elaborar varias herramientas como [FF0000]Picos[-] y [FF0000]Espadas[-].

source: Clouds
es: Las esponjosas nubes forman la magnitud de los [FF0000]Cielos Olvidados[-]. Geniales para los biomas hechos por el hombre.

source: Spider Web
es: Un bloque blanco pegajoso que permite que los parásitos (Arañas) se formen. Se puede encontrar en la mayoría de las cuevas.

source: Iron Hammer
es: Una herramienta útil para excavar en superficies duras. Excava más y mejor que con un Martillo normal. Para usarlo, abre el Inventario, selecciona el [FF0000]Martillo de Hierro[-], pulsa y mantén pulsado sobre el bloque que deseas romper.

source: Crystal Block Blue
es: Cubo azul reluciente formado de [FF0000]Zafiros[-].

source: Window
es: Un bloque que tiene 4 marcos. Ideal para añadir variedad y detalles a los edificios. Si tu casa está hecha de Piedra y Tablones, parecerá fabulosa con los materiales de construcción esenciales.

source: Aragog Eye
es: El ojo de la gran araña [FF0000]Aragog[-]. Bruta o sabrosa, depende de a quién se le pregunte.

source: Spider Fang
es: ¡La araña Itsy Bitsy! ¡GUAU! Acabas de matar a una araña y ha soltado un colmillo.

source: Wheat Crop
es: Puedes cultivar Trigo con la Azada con las Semillas de Trigo.

source: Iron Shovel
es: Herramienta útil para excavar en la arena y en la tierra. Excava más rápido y mejor que con una pala convencional. Para usarla, abre el Inventario, selecciona la [FF0000]Pala de Hierro[-], pulsa y mantén pulsado sobre el bloque que deseas romper.

source: Fence
es: Ideal para atrapar o guardar animales.

source: Stick
es: Asegúrate de no desperdiciar los palos de madera.

source: Green Coral
es: En el Coral verde fluorescente se encuentra gran cantidad de vida marina.

source: Cauldron
es: Utilizado para crear varias pociones.

source: Wood Door
es: Una puerta de madera equivalente a la longitud de dos bloques.

source: Antique Spawner
es: Todas las casas de la familia de los Duendes tienen una reliquia que los protege de todo. Usa un [FF0000]Cazador de Almas[-] para atrapar algunas criaturas en este tipo de generadores.

source: Palm Stairs
es: Un bloque que te da una excusa para no utilizar tablones en el tejado. También un gran recambio para escaleras.

source: Megalodon Tooth
es: Un Diente que salió de un Megalodón. Puede convertirse en un arma en la mano adecuada.

source: Hunting Knife
es: Una espada pequeña ideal para el combate cuerpo a cuerpo. El nombre habla por sí solo. Estupenda para tenerla en el bolsillo cuando necesitas numerosos suministros de los animales. (¡Sólo asegúrate de no golpear a un dragón con este arma!)

source: Forgotten Stone
es: Las antiguas columnas y paredes de los castillos se componen de este duradero material.

source: Dig
es: El pan de cada día de un aventurero. Sin picos, golpea la piedra solamente con las manos desnudas.

source: Pumpkin Head
es: Una gran decoración de Haloween es una [FF0000]Calabaza[-] esculpida con ojos brillantes de color naranja.

source: Unobtainium
es: La misma piedra del [FF0000]Inframundo[-] se tiñe con la avaricia odiosa de [FF0000]Barlog[-]. Su espíritu nada por los bolsillos corruptos de Unobtainium. Sólo los mayores aventureros pueden reclamar sus secretos oscuros... Para conseguir una, tendrás que descender a lo más profundo del infierno, y cuando estés allí, descender aún más. O puedes quedarte sano y salvo donde estés.

source: Sulphure Ore
es: Un montón de mineral amarillo se puede encontrar en el [FF0000]Inframundo[-]. Lo puedes utilizar para hacer tinte amarillo, ácido o pólvora.

source: Spruce Plant
es: Crece en la [FF0000]Nieve[-].

source: Radar
es: Muestra las criaturas cercanas, así como la ubicación de tus camas.

source: Forgotten Stone Old
es: La piedra que ha sido olvidada.

source: Iron Axe
es: Herramienta útil para talar madera. Talas más y mejor que con un Hacha convencional. Para usarla, abre el Inventario, selecciona el [FF0000]Hacha de Hierro[-] y mantenla pulsada sobre el bloque que deseas romper.

source: Dragon Pants
es: Hecho de [FF0000]Escama de Dragón[-].

source: Blue Flower
es: Las Flores maduras naranjas o verdes se encuentran normalmente en la tierra o en la hierba. Siempre se abrazan con la Flor Roja.

source: Storage Row Error
es: Conéctate a Internet para aumentar la capacidad de tu Inventario.

source: Cactus
es: Planta espinosa que vive en el desierto. No me importa lo que ves. El calor está en tu mente. ¡NO ABRACES LA PLANTA!

source: Graviton
es: Una partícula sin masa que produce una fuerza gravitatoria. Úsala como combustible para la [FF0000]Mochila Cohete[-].

source: Air Ring
es: Un anillo de aire sólido.

source: Skill Reset Error
es: Conéctate a Internet para restablecer tus habilidades.

source: Deerskin
es: La piel de un ciervo. Utilizada para elaborar armaduras de guerreros y otras cosas útiles.

source: Elevator
es: Ponlo en tuberías y podrás viajar por todas partes donde haya tuberías. El elevador para automáticamente cerca de los [FF0000]generadores[-]. Se puede teñir en la mesa de construcción.

source: Blue Crystals
es: Mineral azul que suele encontrarse en cuevas profundas. Produce un brillo azulado a su alrededor cuando permanece intacto. Se puede usar para hacer pociones de maná y tinte azul.

source: Snow
es: Una sustancia fría y extraña que da forma a los campos de las montañas Elementales de Hielo. Es un frío mortal, a pesar de que es suave y hermoso. Se puede teñir con diferentes colores. No comas nieve amarilla. Dáselo al hombre de nieve para que lance bolas de nieve.

source: TNT
es: Sirve como una herramienta de minería devastadora y como arma. Está fabricado con [FF0000]Pólvora[-] y [FF0000]Madera[-].

source: Great Sword
es: Parece un poco extraño, pero lo cierto es que tiene un poder considerable. Se lleva por delante todo lo que haya en el camino. Excelente para el combate a corta distancia.

source: Jungle Tree Plant
es: Crece en la [FF0000]Tierra[-] o en la [FF0000]Hierba[-]. Los [FF0000]Murciélagos Dragón[-] nacen de las flores de este árbol.

source: Epic Sword
es: Una espada con el nombre de Épica. Causa mucho daño en su clase.

source: Bullet
es: Necesita [FF0000]Pólvora[-] para usarla como municición para la [FF0000]Pistolas[-]. Penetra la piel del monstruo más duro a una velocidad letal.

source: Torch
es: Un bloque de fuego hecho de [FF0000]Madera[-], [FF0000]Cristal[-] y lleno mágicamente de [FF0000]Fuego[-]. Muy útil como fuente de luz alrededor de su campamento o para llevar en la mano.

source: Generator
es: Se usa para acelerar la [FF0000]vagoneta[-] y como parada para el [FF0000]elevador[-]. Conéctalo a las [FF0000]tuberías[-] y [FF0000]rieles[-].

source: Drill
es: Desaparece el asunto en el aire enrarecido. Toca un bloque y 10 bloques consecutivos desaparecerán sin dejar rastro.

source: Snow Leaves
es: Las hojas con una cereza en la parte superior. Quiero decir nieve en la parte superior. Se pueden encontrar en el Bioma de Nieve.

source: Trident
es: Forjada a imagen y semejanza de la mítica arma del dios Poseidón, este poderoso objeto produce rayos y relámpagos.

source: Apple
es: Las Manzanas rojas brillantes dan mucha energía durante el día.

source: Cat Soul
es: Devuelve la vida a un lindo gato. Te seguirá por todas partes. Come Sopa de Aleta de Tiburón, Peces Cocidos y Carne.

source: Gold Ore
es: Un mineral valioso y maleable que esparce un resplandor amarillo a su alrededor. Se puede encontrar en cuevas, bajo islas flotantes o en la arena.

source: Acacia Plant
es: Crece en la [FF0000]Arena[-].

source: Ladder
es: Conéctalos para salir del más oscuro de los hoyos.

source: Palm Plank
es: El Tablón marrón sucio oscuro es muy parecido a los otros tablones. También se puede pintar.

source: Book Shelf
es: Sorprende a tus amigos enseñándoles la enorme cantidad de libros que has leído. Solamente tienes que almacenar algunos [FF0000]Tablones de Madera[-] y unas pocas [FF0000]Pieles de Jabalí[-].

source: CarBody
es: Sin este marco robusto, el Coche caería... y sería una mala noticia.

source: Dragon Boots
es: Hecho de [FF0000]Escama de Dragón[-].

source: Iron Block
es: Valioso bloque compuesto de hierro.

source: Electric Pipe
es: Conectado a otras [FF0000]Tuberías[-] y [FF0000]Generadores[-].

source: Grass
es: Es parte del suelo viviente de la Historia de los Bloques. Mientras haya hierba verde, hay esperanza. Es bastante común verla en la superficie.

source: Poisoned Arrow
es: Flecha cubierta con un veneno potencialmente venenoso.

source: Blue Dye
es: Fabricado con [FF0000]Zafiro[-]. Se utiliza para crear bloques de color. Combina con otros colorantes para hacer muchos colores diferentes.

source: Jungle Leaves
es: El tipo de hojas comunes que se encuentran en la Jungla. Tarzán incluso se ha familiarizado con ellas.

source: Yellow Dye
es: Fabricado con [FF0000]Azufre[-]. Se usa para crear bloques de colores. Combínalo con otros tintes para crear una amplia gama de colores.

source: Swamp
es: Los bloques verdes y fangosos te hacen sentir como si vomitaras en el agua. Son más frecuentes en el Bioma de la Selva.

source: Hand Torch
es: Una cosa muy útil para cualquier Bloqueriano para ayudar a iluminar la noche, es iluminar cualquier caverna profunda e inquietante o mantener al malvado Yeti lejos.

source: BoarSkin
es: Es agradable y saludable, pero, no sé, viene de un jabalí muerto. Útil para fabricar [FF0000]Picos de Duendes[-] o [FF0000]Estanterías para Libros[-].

source: Stone Stairs
es: Un bloque que te da una excusa para no utilizar tablas para el tejado. También un gran recambio para escaleras.

source: Springs
es: Coloca estas suelas en tus botas para saltar más alto.

source: Dragon Heart
es: El corazón de un poderoso Dragón. Comerlo puede restaurar totalmente tu salud. Pero conseguirlo te puede costar la vida.

source: Jungle Bush Leaves
es: Las Hojas Verdes Oscuras se encuentran comúnmente en la superficie del Bioma de la Selva.

source: Skill Reset
es: Redistribuye todos los puntos de habilidad.

source: Hoe
es: Herramienta para la agricultura. Cosecha [FF0000]Trigo[-] y otros vegetales.

source: Candle
es: Ideal para iluminar una zona. Si tiñes la cera antes de hacer la vela, entonces iluminará en color. Puedes quemarte si pones la mano encima.

source: Fence Gate
es: Una puerta para la valla que te permite entrar o salir sin tener que saltar por encima.

source: GiantSpider
es: Una bestia prehistórica que resistió el paso del tiempo. Reside en las profundidades de la tierra. [FF0000]Aragog[-] tiene un hambre sin precedentes y se ha convertido en el asesino perfecto.

source: Fuel
es: Potencia el [FF0000]Motor[-] de varios vehículos.

source: Table
es: Decoración casera común.

source: Fire
es: Tu mamá dijo que no jugaras con fuego. Si eres lo suficientemente cuidadoso, puedes utilizarlo para cocinar los alimentos, encender las flechas de fuego, hacer antorchas, velas, algunos objetos mágicos, fundir los metales y hacer vidrio.

source: Wheat
es: Planta utilizada para la agricultura. Crece solamente en la [FF0000]Tierra[-] cerca del [FF0000]Agua[-].

source: Red Flower
es: Las Flores Verdes Oscuras que se suelen encontrar en la tierra o en la hierba, siempre se sitúan junto a la Flor Azul. También puedes jugar al escondite y buscar dentro de los bloques.

source: My Precious
es: Un anillo muy poderoso forjado por el gran [FF0000]Señor Saurone[-] para que lo use el elegido durante la [FF0000]Gran Guerra[-].

source: Epic Shield
es: Un moderno escudo con símbolos de color rojo en la parte delantera. De hecho, es épico. Es posible que desees utilizar esta opción cuando estés luchando contra un [FF0000]Dragón[-].

source: Ice
es: Frío, duro, y no perdona. Los procesos naturales que crean las formaciones de agua se han visto corrompidos por el Elemental de Hielo. Estas sustancias exhuman crueldad. También está bueno si se mezcla con gaseosa.

source: Hydra
es: Una criatura de Rabia Primal instintiva. Los soldados tiemblan de miedo ante el poder de esta criatura. Sólo deshova por la noche.

source: Crystal Block Black
es: Un cubo negro brillante formado a partir de [FF0000]Carbón[-]. A pesar de su aspecto amenazador, es bastante inofensivo. (Nota: No encender un fósforo D:)

source: Sword
es: Sigue, sigue riéndote de esto... veremos quién se ríe cuando estés acurrucado en alguna esquina con una [FF0000]Espada[-] de piedra en la mano.

source: Swamp Stone
es: Piedra erosionada. Formada por la combinación de [FF0000]Piedra Pulida[-] y [FF0000]Barro[-]. Son abundantes en [FF0000]Atlantis[-].

source: Energy
es: Objetos que poseen Energía, como [FF0000]Carbón[-], [FF0000]Madera[-], [FF0000]Tablones[-] y[FF0000]Palos[-], y que pueden usarse para elaborar objetos para el[FF0000]Horno[-] y la [FF0000]Caldera[-].

source: Rose Bush
es: Varias rosas en un tallo hermoso.

source: Sand Stone
es: Una hermosa piedra formada de [FF0000]Arena[-]. Aparece en las bastas llanuras de los [FF0000]Reinos Celestiales[-].

source: Bed
es: Usada para obtener algo muy - necesitado descanso después de una exhaustiva aventura.

source: Dirt
es: Ah, Tierra. Siéntela, huélela. Vas a ver un montón. La tierra es una de las sustancias más comunes que existen .

source: Nest
es: Un nido rodeado de hojas. Asegúrate de que no pasas a la parte superior de los huevos. El nido se puede encontrar en algunas islas flotantes o en los árboles.
