Repository: TheDark98/blockstory-translation
Catalog: translations/MrGoblin.po
Languages: it

source: Dragon Pants
it: Pantaloni da Drago

source: That no good stinking Dragon Lord! I’d like to wring his lordly neck!
it: Questo non è un bel puzzare Signore Drago! Mi piacerebbe torcerle quel suo collo signorile!

source: Too much time under ground, too many explosions—let’s be honest, I’m pretty nuts. But not as nuts as that punk Dragon Lord. Let’s chew his ankles off! Or I could help you make stuff to fight him. That too.
it: Troppo tempo sotto terra, troppe esplosione—siamo onesti, sono abbastanza fuso. Ma non fuso quel delinquente di Signore Drago. Mangiamogli le caviglie! O potrei aiutarti a fare cose per combatterlo. Anche questo.

source: I’ve been thinking, and maybe this is just a crazy conspiracy theory, but I think the angry streak we goblins have is due to the Dragon Lord’s meddling. Our weak minds were influenced too easily.
it: Sono stato a pensare, e forse questa è solo una pazza teoria di cospirazione, ma penso che quella vena di arrabbiati che noi goblin abbiamo è data dall'intromissione di Signore Drago. Le nostre deboli menti sono state influenzate troppo facilmente.

source: Tell Mr. Goblin you have crafted the Dragon Pants.
it: Dì al signor Goblin che hai le pelli di cavallo.

source: You look rather fetching in those pants, Dragon Rider. Even if the Dragon Lord smashes you with one blow, at least you’ll look stylish being obliterated.
it: Hai un'aria piuttosto affascinante con quei pantaloni, Cavaliere di Draghi. Anche se il Signore Drago ti spezza con un colpo, almeno hai un aspetto elegante quando ti cancellerà.

source: Even I’m not crazy enough to want the Dragon Lord to rule the land. That guy is a jerk! There’s just one more piece of dragon gear to go, but you’ll need a master craftsman to make this one. Maybe that wimpy warrior can help you.
it: Anche io non sono abbastanza matto di volere il Signore Drago a comandare in questa terra. Quel tipo è un idiota! C'è solo un altro pezzo dell'ingranaggio del drago per incominciare, ma avrai bisogno di un maestro artigiano per crearne uno. Forse quel guerriero rammollito può aiutarti.

source: Speak to Aaron about the next piece of dragon gear.
it: Parla con Aaron a proposito del prossimo pezzo dell'ingranggio del drago.

source: Explosive Knowledge
it: Conoscenza di esplosivi

source: I promised to help you make things go kaboom, so let's start with the basics.
it: Ti avevo promesso di aiutarti a fare cose esplosive, allora iniziamo dalle basi.

source: Step one: Make gunpowder. Step two: Blow stuff up! Step one is not the fun part, but you gotta start somewhere.
it: Passo uno: facciamo polvere da sparo. Passo due: facciamo saltare in aria! Il passo uno non è la parte divertente, ma devi iniziare da qualche parte.

source: I can’t wait to show you how to make TNT. I can almost smell the sulfur. But first we are going to need some gunpowder.
it: Non ce la faccio ad aspettare di mostrarti come fare il TNT. Posso quasi odorare lo zolfo. Ma prima abbiamo bisogno di un po' di polvere da sparo.

source: Tell Mr. Goblin you have crafted the gunpowder.
it: Dì al signor Goblin che hai le pelli di cavallo.

source: I can’t believe I spent all that time living under a mountain. Have you been up here this whole time, doing stuff for people? Dang!
it: Non posso credere di aver passato tutto quel tempo sotto una montagna. Sei stato quassù tutto questo tempo, a fare cose per la gente? Dang!

source: With that Gunpowder in hand, making TNT should be a breeze. It’s fun, too.
it: Con la Polvere da sparo in mano, a fare TNT dovrebbe essere una volata. Ed è anche divertente.

source: You can never have too much dynaminte. Trust me, you’ll have a...blast? Eee hee hee!!!!
it: Non hai mai troppa dinamite. Credimi, avrai una...esplosione? Eee hee hee!!!!

source: Tell Mr. Goblin you have crafted the TNT.
it: Dì a Mr. Goblin che hai creato il TNT.

source: We’ve got explosives. KABLAMMO!
it: Abbiamo gli esplosivi. KABLAMMO!

source: Now we can blow things up! It’s going to be violent and bl-ech, ack!
it: Ora possiamo far saltare in aria le cose! Sarà qualcosa di violento e che riecheggerà, no!

source: Oh, my little green head. What happened? And why do I suddenly have the overwhelming desire to read? [FF00FF]* shudder *[-]
it: Oh mia testolina verde. Cosa è accaduto? E perché improvvisamente ho il travolgente desiderio di leggere? [FF00FF]* sussulto*[-]

source: Goblin Secret
it: Il Segreto del Goblin

source: Is there something I can do for you? Ah. That Alchemist fellow told you that I might be able to help you create some armor out of those skins? Well, I've got good news and bad news.
it: C'è qualcosa che posso fare per te? Ah. Questo amico Alchimista ti ha raccontato che io posso essere in grado di aiutarti a creare qualche armatura da quelle pelli? Bene, ho buone notizie e cattive notizie.

source: Talk to Mr. Goblin about his secrets.
it: Parla al signor Goblin dei suoi segreti.

source: The good news is that I can definitely show you how to make some armor. The bad news is that you retrieved the wrong kind of skins.
it: La buona notizia è che io posso certamente mostrarti come fare una buona armatura. La cattiva notizia è che tu hai recuperato il tipo sbagliato di pelli.

source: You see. Goblins like to use horse skins to craft their armor. We tend to get pretty large and a deer just doesn't cut it.
it: Vedi. I Goblin amano usare pelli di cavallo per creare le loro armature. Tendiamo a prenderle molto grandi ed un cervo semplicemente non è adatto.

source: If you want to learn how to craft the goblin helmet you are going to have to retrieve some horse skins first. Return to me when you have them.
it: Se vuoi imparare come creare un elmo da Goblin devi andare a recuperare qualche pelle di cavallo, prima.Torna da me quando le avrai.

source: Tell Mr. Goblin that you have the horse skins.
it: Dì al signor Goblin che hai le pelli di cavallo.

source: Excellent! Now you can start looking more like a goblin. But this is only the beginning. I require some things to be taken care of around these parts before I'm willing to part with more of my goblin secrets.
it: Eccellente! Ora inizi ad assomigliare più a un Goblin. Ma questo è solo l'inizio. Richiedo di prendere cura di alcune cose dei dintorni di queste luoghi, prima di voler dare via altri miei segreti di Goblin.

source: Goblins tend to have too much meat in our diets. Now that statement is entirely debatable as some of my goblin friends may not share that sentiment.
it: I Goblin tendono ad avere troppa carne nelle nostre diete. Ora questa affermazione è interamente discutibile, così come i miei amici folletti possono non condividere tale sentimento.

source: I could really use a change of taste. Bring me some apples and beehives. I have an idea on how to make one tasty apple.
it: Posso veramente usare un cambio di gusto. Portami qualche mela ed alveari. Ho una idea su come rendere gustosa una mela.

source: Tell Mr. Goblin that you have the apples and beehives.
it: Dì a Mr. Goblin che hai le mele e gli alveari.

source: Thank you kind gatherer of ingredients. Now let's try this out. Bleh. Oh my.... This is way too sweet. I think I'm gonna... Anyway. Thanks for giving me a chance to test my theory.
it: Grazie, gentile raccoglitore di ingredienti. Ora proviamo questo Bleh. Oh caspita....questo è assolutamente troppo dolce. Penso che sto... Comunque. Grazie per avermi dato la possibilità ti provare la mia teoria.

source: I wasn't bluffing that I wanted to try something new. We will just have to try something different entirely.
it: Non stavo bluffando sul fatto che volevo provare qualcosa di nuovo. Dobbiamo solo provare qualcosa di completamente diverso.

source: I was thinking. What do you think about some soup with shark fin in it? Really? You already have a recipe for that? Well then, brew me up some why don't you. I'm a large guy. Make me enough to fill my belly.
it: Stavo pensando. Cosa ne pensi di qualche zuppa con pinna di squalo? Veramente? Hai già una ricetta per questo? Bene allora, perché non ne prepari un po'. Sono un tipo cresciuto. Fanne abbastanza da riempirmi la pancia.

source: Tell Mr. Goblin that you have the shark fin soup.
it: Dì al signor Goblin che hai la zuppa di pinna di squalo.

source: Wow! That is some truly delicious soup. Thank you. Here is the last part of the goblin armor as promised.
it: Wow! Questa è una zuppa veramente deliziosa.Grazie. Questa è l'ultima parte dell'armatura del folletto come promesso.

source: I wish you luck in your adventures. Perhaps in time I will require your services again.
it: Ti auguro fortuna nelle tue avventure. Forse nel tempo a venire richiederò ancora i tuoi servizi.

source: Pillage Victim
it: Vittima del Saccheggio

source: Eee hee hee! Look who it is. A Dragon Rider come to chat with little old me?
it: Eee hee hee! Guarda chi è. Un Cavaliere di Drago viene a chiacchierare con un vecchietto come me?

source: Whatever you think I did, I’m innocent, I swear! $#@! See? I swore. Those goblins that attacked you had nothing to do with me. They stole my goblin armor. And now I feel naked without it. Make me new armor, and I’ll teach you how to make things go kaboom!
it: Qualunque cosa tu possa pensare io abbia fatto, lo giuro! $#@! Vedi? Lo giuro. Quei folletti che ti hanno attaccato non hanno niente a che fare con me. Loro hanno rubato la mia armatura da goblin. Ed ora mi sento nudo senza. Fai una nuova armatura per me, e ti insegnerò come fare le cose che andranno ad esplodere!

source: Ooh, yeah! You almost got it! Make me new armor, and I’ll teach you how to make things go kaboom!
it: Ooh, sì! Ce l'hai quasi fatta! Creami una nuova armatura, e ti insegnerò come realizzare le cose che fanno kaboom!

source: Tell Mr. Goblin you have his replacement goblin armor.
it: Dì al signor Goblin che hai la zuppa di pinna di squalo.

source: Armor! Oh sweet goblin shell. Sniff—Blech! It smells like armpits and sun-dried cheese. Ah...just like home.
it: Armatura! Oh dolce riparo di goblin. Sniff—Blech! Puzza come le ascelle e formaggio asciugato al sole. Ah...proprio come a casa.

source: So I was posing in that armor you made me and an acorn fell out of the sky and landed on my head. War wound! Now I’ve got a bump. Fix this problem, Dragon Rider, or I’ll get angry. And you wouldn’t like me when I’m angry.
it: Allora stavo mettendo quella armatura che tu hai fatto e una ghianda è caduta dal cielo ed è atterrata sulla mia testa! Ferita di guerra! Ora ho un bernoccolo. Risolvi questo problema, Cavaliere di Drago, o mi arrabbierò. E non ti piacerò da arrabbiato.

source: I got hit on the head so hard I saw stars! Marilyn Monroe and Clark Gable and even Humphrey Bogart.
it: Sono statp colpito sulla testa così duramente che vedo le stelle! Marilyn Monroe e Clark Gable e persino Humphrey Bogart.

source: Tell Mr. Goblin you have his replacement goblin helmet.
it: Dì al signor Goblin che hai il rimpiazzo del suo elmo da goblin.

source: Sweet dome, Dragon Rider! This helmet is even thicker than my skull, and that’s saying something!
it: Dolce casa, Cavaliere di Draghi! Questo elmo è persino più spesso del mio cranio, e questo è dire tutto!

source: There’s just one more piece to complete the ensemble, Dragon Rider, and that’s Goblin Pants! Make me some pants, for the love of all that is goblin!
it: C'è ancora un altro pezzo per completare l'insieme, Cavaliere di Draghi, e si tratta dei pantaloni da Goblin! Fammi un po' di pantaloni, per l'amore di tutti i goblin!

source: I like big pants and I cannot lie. All you other goblins can’t deny, when a goblin walks in with an itty bitty mace and a sharp knife in your face you put on Goblin Pants!
it: Mi piacciono i pantaloni enormi e non posso mentire. Voialtri goblin non lo potete negare, quando un goblin ci cammina con una piccola mazza e un coltello appuntito sulla tua faccia tu metti i Pantaloni da Goblin!

source: Tell Mr. Goblin you have his replacement goblin pants.
it: Dì al signor Goblin cha hai il rimpiazzo dei suoi pantaloni da goblin.

source: That’s it! Yes! I feel like my old self again. Thank you!
it: Eccolo! Sì! Mi sento ancora come una voilta. Grazie!

source: Even a creature as lowly as me, and you still helped, Dragon Rider.
it: Persino una creatura piccola come me, che tu hai ancora aiutato, Cavaliere di Draghi.
