Repository: TheDark98/blockstory-translation
Catalog: translations/NPC_Speak.po
Languages: it

source: I'll never forget this.
it: Non lo dimenticherò mai.

source: I will collect it for you.
it: Lo prenderò io per te.

source: AAAAAHHHHHHHH!
it: AAAAAHHHHHHHHHH!

source: I'm hungry. Give me something to eat so I can restore my strength.
it: Ho fame.Dammi qualcosa da mangiare in modo che posso ritrovare forza.

source: I'm feeling stronger!
it: Mi sento più forte!

source: Have mercy....
it: Abbi pietà ....

source: Test me and learn the hard way.
it: Provami ed impara nel modo più duro.

source: Die!
it: Muori!

source: Do you know where I can find some mushrooms?
it: Sai dove potrei trovare dei funghi?

source: Nothing like a dark cave to have the good life.
it: Non c'è niente di meglio di una grotta scura per spassarsela.

source: After what I've seen, I doubt anything could surprise me.
it: Dopo quanto ho visto, dubito che niente altro possa sorprendermi.

source: There are some really scary creatures further below. Be careful.
it: Ci sono delle creature davvero spaventose più in giù.Fa attenzione.

source: What? No more spawners? But where are all these creatures coming from?
it: Cosa?Niente più uova? Ma dove sono?

source: These stupid sharks are everywhere. Be careful!
it: Questi stupidi Squali sono ovunque.Fa attenzione!

source: I'm so tired of these monsters. :( They appear every night.
it: Questi mostri mi hanno stufato. :( Appaiono ogni notte.

source: Beware of Ashkore! He's your worst nightmare.
it: Fai attenzione con Ashkhore! E' il tuo peggior incubo.

source: Why is everything made out of blocks? Where I am?
it: Perché tuto è fatto di blocchi?

source: I need to talk with someone. I'm going crazy.
it: Ho bisogno di parlare con qualcuno, vado.

source: There's nothing like getting out of the castle once in while.
it: Niente meglio che uscire dal castello.

source: Click on my health bar if you want to rename me.
it: Clicca sulla mia barra della salute se la vuoi rinominare.

source: I'm happy to serve my kingdom.
it: Sono contento di servire il mio regno.

source: Be good. Be well.
it: Fai il bravo. Stammi bene.

source: This is for my kingdom!
it: Questo per il mio regno!

source: There is nothing that can stop me!
it: Niente può fermarmi!

source: Food too strong.
it: Cibo troppo forte.

source: I will return with a thousand men!
it: Tornerò con mille uomini!

source: I'm starving. I suddenly feel very weak.
it: Sto morendo di fame. Mi sento molto debole all'improvviso.

source: How pathetic.
it: Che pena.

source: The boat won't be accepting your toll.
it: La barca non accetta il tuo pedaggio.

source: How dare you!
it: Come osi!

source: You are no longer welcome here.
it: Non sei più benvenuto qui.

source: GRRRAAAWWWRRR!
it: GRRRAAAWWWWWRRR!

source: Me no like you no more.
it: Non mi piaci più.

source: Ahhhhhhhhh!
it: Ahhhhhhhhhh!

source: Mwahahaha!
it: Muahahaha!

source: Would you like to buy something?
it: Vorresti comprare qualcosa?

source: Get the greatest deals in all the land!
it: Ricevi le miegliori offerte del posto!

source: Step right up, and purchase the finest quality items.
it: Vieni avanti, e compra gli oggetti migliori.

source: You look like you could use some help.
it: Sembri qualcuno che ha bisogno di aiuto.

source: Watch my dancing skills!
it: Guarda come sono bravo a ballare!

source: I smell...food?
it: Sento odore di cibo?

source: I see you.
it: Ti vedo.

source: You'll never dance like me!
it: Non riuscirai mai a ballare come me !

source: Me like shiny things.
it: A me piacciono le cose che brillano.

source: Now you know what it is to mess with a Viking.
it: Ora sai che vuol dire avere a che fare con un Vikingo.

source: Please leave me be.
it: Per favore lasciami stare.

source: You should have thought twice before attacking me.
it: Avresti dovuto pensarci due volte prima di attaccarmi.

source: You will make a fine meal!
it: Sarai un buon pasto!

source: Crush! Smash!
it: Rompilo!Spezzalo!

source: I wish I didn't have to do that.
it: Vorrei non doverlo fare.

source: I'm too weak. It is better to stay away from these monsters.
it: Sono troppo debole. meglio stare lontano da questi mostri.

source: I'll show you the strength of a real warrior!
it: Ti farò vedere la forza di un vero guerriero!

source: Die evil fiend!
it: Muori demonio maligno!

source: Hello, adventurer.
it: Salve, avventuriero.

source: If you think my skills are as dull as my blade, you got another thing coming.
it: Se credi che le mie capacità siano poco affilate come la mia lama, allora c'è un'altra cosa in arrivo.

source: Do you ever wonder what lies deep within the caves?
it: Ti sei mai chiesto cosa c'è nel profondo delle grotte?

source: What a great day to be a warrior.
it: Che gran giorno per un guerriero.

source: I've had better days...
it: Ho avuto momenti migliori...

source: He he! I have defeated him again!
it: He He!L'ho sconfitto di nuovo!

source: Smiting evil never gets old.
it: Battere il male non passa mai di moda.

source: We could have been friends...
it: Avremmo potuto essere amici...

source: Good luck, my boy!
it: Buona fortuna, ragazzo!

source: I am all powerful!
it: Ho tutti i poteri!

source: Feel the source of life become your death!
it: Prova la fonte di vita che diventa quella della tua morte!

source: What? A human?
it: Che cosa? Un essere umano ?

source: Where are you?
it: Dove sei ?

source: It would be nice to have something to eat.
it: Sarebbe bello avere qualcosa da mangiare.

source: FOR THE EMPIRE!!!
it: PER L'IMPERO!

source: I'm coming!
it: Sto arrivando!

source: Attack!
it: Attaccare!

source: I'll teach you some manners!
it: Te le insegno io le buone maniere!

source: You're too weak for me!
it: Sei troppo debole per me!

source: You will never find me.
it: Non mi troverai mai.

source: Do you really think you can kill the dead?
it: Pensi davvero di poter uccidere i morti?

source: I will pour upon you the power of my blade!
it: Io riverserò su di voi la potenza della mia lama !

source: I'm going to chop you up into little pieces!
it: Ti farò in tanti pezzetti!

source: You just made a big mistake!
it: Hai appena fatto un grande errore!

source: Watch my moves!
it: Guarda le mie mosse!

source: I'm bored...
it: Sono annoiato ...

source: You cant hide.
it: Cann't nascondi.

source: Time for dinner.
it: Tempo di cena.

source: I didn't sign up for this!
it: Non mi ero iscritto per questo!

source: I need to hide.
it: Ho bisogno di nascondersi .

source: Many great dangers live far below the surface.
it: Molti pericoli sono sotto la superficie.

source: The ocean can be wonderous at times.
it: L'oceano può essere meraviglioso a volte.

source: The sky is quite beautiful.
it: Il cielo è proprio bello.

source: Travel the world and discover the wonders of life.
it: Viaggia per il mondo e scopri le meraviglie della vita.

source: You will fail!
it: Fallirai!

source: Dragon Lord reborn!
it: Il Signore Drago rinato!

source: For the king! For the town!
it: За короля! За город!

source: You stirred the deep, outsider! Now we drown you in it!
it: Ты потревожил глубины, чужак! Теперь мы утопим тебя в них!

source: Fall back! We can’t hold them!
it: Отступаем! Мы не сдержим их!

source: They are too strong! We need to regroup!
it: Они слишком сильны! Нам нужно перегруппироваться!

source: What's Kill?
it: Что значит 'убить'?
