Repository: TheDark98/blockstory-translation
Catalog: translations/ShadowHunter.po
Languages: it

source: Hunter in the Shadows~
it: Cacciatori nelle Ombre~

source: People of this world fear me for good reason. I like to hide in the shadows to kill my prey so they never see what is coming. My method is a secret I am willing to share with you.
it: La gente di questo mondo mi teme e con una buona ragione. Mi piace nascondermi nell'ombra per uccidere la mia preda così loro non sanno mai cosa sta per capitare. Il mio metodo è un segreto che voglio rivelarti.

source: I like to use something called a bow. It fires arrows from the webs I used to create it. Craft a bow and some arrows and return to me for some training.
it: Mi piace usare qualcosa chiamato arco. Scocca frecce dalle ragnatele che ero solito creare. Crea un arco e qualche freccia e torna da me per un po' di addestramento.

source: Tell the Alchemist that you have crafted the bow and arrows.
it: Dì all'Alchimista che hai creato l'arco e le frecce.

source: You sure took a long time to create something so simple.
it: Ti ci è voluto certamente tanto tempo per creare qualcosa di così semplice.

source: Are you sure you are ready to learn how to use the bow and arrows properly?
it: Sei certo di essere pronto per imparare ad usare un arco e le frecce in modo appropriato?

source: I'm not surprised with how long it took for you to actually craft the bow and arrows. Come back when you want to learn how to become a worthy hunter.
it: Non sono sorpreso da quanto ti ci è voluto per creare alla fine l'arco e le frecce. Ritorna quando vuoi imparare come diventare un cacciatore di valore.

source: Very well. We will start with some easy targets. You know. Helpless animals and such.
it: Molto bene. Inizieremo con qualche facile bersaglio. Lo sai. Animali deboli e simili.

source: Hunt down a few deer for their skins using your new trustworthy bow. I mean, you can get them any way you want, but you should really try using the bow. It might make hunting them a bit easier.
it: Caccia un po' di cervi per la loro pelle, usando il tuo affidabile nuovo arco. Voglio dire, li puoi avere in ogni modo che vuoi, ma dovresti veramente provare ad usare l'arco. Può rendere la loro caccia un po' più facile.

source: Tell the Alchemist that you have hunted enough deer.
it: Dì all'Alchimista che hai cacciato cervi a sufficienza.

source: Did you end up using the bow? Nevermind. Don't answer that. You wouldn't want to embarass yourself in front of me.
it: Hai smesso di usare l'arco? Non importa. Non rispondere su questo. Non vuoi metterti in imbarazzo di fronte a me.

source: Now that you have a few skins to work with, you should talk to one of the adult goblins. I've seen them crafting all sorts of armor made of skins and wood and such. Perhaps they will help you out.
it: Ora che hai un po' di pelli sulle quali lavorare, dovresti parlare ad un folletto adulto. Li ho visti creare tutti i generi di armature fatte di pelli e legno e simili. Forse loro ti aiuteranno a crearla.

source: Potion Apprentice
it: L'apprendista e la pozione

source: Leave me alone! What? An ailing firebreather? You need certain potions to make an antivenom? I see. Well, that changes everything.
it: Lasciami solo! Cosa? Un mangiafuoco ammalato? Hai bisogno di una certa pozione per fare un antidoto? Vedo. Questo cambia tutto.

source: Speak to the Alchemist to learn about alchemy.
it: Parla con l'Alchimista per imparare l'alchimia.

source: The secret to alchemy is that potions are tied to those who make them. If you care for this dragon, then you must be the one who crafts the potions. I cannot do it for you. But I can teach you. Will you become this alchemist's apprentice?
it: Il segreto dell'alchimia è che le pozioni sono legate a quelli che le fanno. Se ti preoccupi per questo drago, allora devi essere quello che crea la pozione. Non posso farlo per te. Ma posso insegnartelo. Diventerai l'apprendista di questo alchimista?

source: I see. Then there is nothing I can do for you. May fortune pity your dragon friend.
it: Vedo. Allora non c'è niente che posso fare per te. Possa il fato aver pietà del tuo amico drago.

source: Very well. We will start with the basics.
it: Molto bene. Inizieremo dalle basi.

source: Chemicals are like people. When two are combined, a reaction occurs. Maybe it will be benign, but sometimes, the results are explosive! Chemistry is love, my friend. But you are going to need to craft a Cauldron to make those kinds of discoveries.
it: Le sostanze chimiche sono come le persone. Quando due sono combinate, succede una reazione, Forse può essere positiva, ma qualche volta il risultato è esplosivo! La Chimica è amore, amico mio. Ma stai per aver bisogno di creare un Calderone per fare quei tipi di scoperte.

source: Tell the Alchemist that you have the cauldron.
it: Dì all'Alchimista che hai il calderone.

source: Do you expect me to be impressed? You crafted a cauldron. Have a trophy. Let's get ready to create your first potion.
it: Ti aspetti che io sia impressionato? Hai creato un calderone. Prenditi un trofeo. Prepariamoci per creare la tua prima pozione.

source: The recipe to brew a Healing Potion is simple. Crafting one is how all apprentice alchemists begin their training. So that's where you will start as well.
it: La ricetta per preparare una Pozione di Guarigione è semplice. Crearne una è esattamente il modo di come tutti gli apprendisti alchimisti iniziano il loro addestramento. Ecco da dove inizierai anche tu.

source: You should always carry some Healing Potions with you. Safety first! You can find the recipe for the Healing Potion in the Recipe Book while the Cauldron is open.
it: Dovresti sempre portare un po' di Pozione della Guarigione con te. La sicurezza prima di tutto! Puoi trovare la ricetta per la Pozione della Guarigione nel Libro delle Ricette, mentre è aperto il Calderone.

source: Tell the Alchemist that you have the healing potion.
it: Dì all'alchimista che hai la pozione per la guarigione.

source: Hm . . . I didn't expect you to craft that potion so quickly. Still, even a buffoon could get it right. Are you ready for a real challenge?
it: Hm... non mi aspettavo che tu avresti creato quella pozione così velocemente. Ma ancora, persino un buffone può aver ragione. Sei pronto per una vera sfida?

source: Alchemists have the ability to create all sorts of useful liquids. A true master alchemist knows the art of combining certain rare ingredients to create a potion that restores mana.
it: Gli alchimisti hanno l' abilità di creare liquidi utili di tutte le specie. Un vero maestro d'alchimia conosce l'arte del combinare certi ingredienti rari per creare una pozione che risana il mana.

source: You must gather the necessary ingredients before you can craft the Mana Potion, so go get them! Don't dawdle around here.
it: Devi disporre di tutti gli ingredienti necessari prima che tu possa creare la Pozione del Mana, quindi trovali! Non bighellonare qui intorno.

source: Tell the Alchemist that you have the mana potion.
it: Dì all'Alchimista che hai la pozione per il mana.

source: I must admit, I have never seen someone take to alchemy so skillfully. Are you sure you have never done this before? I suppose you do have an excellent teacher.
it: Lo devo ammettere, non ho mai visto nessuno affrontare l'alchimia così abilmente. Sei certo di non aver mai fatto questo prima d'ora? Suppongo che tu abbia un eccellente insegnante.

source: Now that you have the two potions your dragon requires, be careful with them. Check back in from time to time, I may be able to further your alchemy training. And I may have other tasks for you as well.
it: Adesso che hai le due pozioni di cui ha bisogno il tuo drago, sii prudente con queste. Controllale di tanto in tanto, posso essere in grado di avanzare il tuo addestramento nell'alchimia. E posso anche avere altri compiti per te.

source: Store
it: Negozio
