Repository: TheDark98/blockstory-translation
Catalog: translations/UI.po
Languages: it

source: Loaded Succesfully
it: Caricamento riuscito

source: Coming soon
it: Prossimamente disponibile

source: Сreature mounted
it: Sei salito

source: Increases maximum mana.
it: Puoi aumentare il tuo mana massimo usando punti abilità. Più mana significa più tempo di volo e più incantesimi.

source: Combat
it: Combattimento

source: Item
it: Strumento

source: Increases flying speed. Allows faster travel, and the ability to reach floating islands.
it: Spendi punti abilità qui per aumentare la velicità di volo,in modo tale da poter raggiungere le isole fluttuanti.

source: Simple
it: Semplice

source: Purchase...
it: Compra...

source: Exponential
it: Esponenziale

source: Please enter pet name
it: Inserite il nome dell'animale

source: Are you sure you wish to delete character [FF0000]{0}[-]?
it: Sei sicuro di voler eliminare questo personaggio? [FF0000]{0}[-]?

source: Anisotropic Filtering
it: Filtro Anisotropico

source: Successfully uploaded character {0}
it: Hai caricato correttamente il giocatore {0}

source: {0} Diamonds
it: {0} Diamanti

source: Can't drive in water!
it: Non puoi guidare un'auto in acqua!

source: Back
it: Indietro

source: Enable Weather
it: Attiva il tempo atmosferico

source: Misc
it: Varie

source: Skill Pt:
it: Punti Abilità:

source: World seed
it: Seme del mondo

source: Auto save frequency: [FF0000]{0:0}
it: Frequenza di salvataggio automatico

source: Profiles
it: Profili

source: Spawn point direction
it: Direzione del punto di rinascita

source: Successfully uploaded world {0}
it: Mondo {0} caricato con successo

source: Suomalainen
it: Finlandese

source: Calibrate tilt
it: Calibra l'inclinazione

source: Get More
it: Ottieni di più

source: Can't mount a vehicle with the Saddle!
it: Non puoi salire nel veicolo con la Sella!

source: Graphics
it: Grafica

source: Joy rotation sensitivity: [FF0000]{0:0.0}
it: Sensibilità della rotazione del Joystick: [FF0000]{0:0,0}

source: Exp:
it: Esp:

source: Time:
it: Tempo :

source: Underwater Breath:
it: Respirazione sott'acqua:

source: FPS counter
it: Contatore di FPS

source: View distance: [FF0000]{0:0}
it: Distanza Visuale: [FF0000]{0:0}

source: Increases maximum health. The more health you have, the better you feel. :)
it: Puoi aumentare la tua salute massima usando i punti abilità. Più salute hai, meglio ti senti :)

source: Screenshot Resolution
it: Risoluzione degli screenshots

source: Game Over
it: Hai perso

source: Are you sure you want to reset all Player progress and settings? This cannot be undone!!!
it: Sei sicuro di voler eliminare tutti i tuoi progressi e le impstazioni? Non potrai più tornare indietro!!!

source: Time Of Day: [FF0000]{0:0.0}
it: Ora del giorno: [FF0000]{0:0.0}

source: <<Resume
it: <<Riprendi

source: Not enough Fuel!
it: Non hai abbastanza Carburante!

source: Selector quality: [FF0000]{0:0}
it: Qualità della selezione: [ff0000]{0:0}

source: Saving...
it: Salvataggio...

source: Recipe Book
it: Ricettario

source: News
it: Novità

source: Character: [FF0000]{0}[-], already exists!
it: Il personaggio: [FF0000]{0}[-], è gia esistente!

source: Player
it: Giocatore

source: Store
it: Negozio

source: Dynamic sky quality: {0:0}
it: Qualità del cielo dinamico: {0:0}

source: Theme
it: Tema

source: Auto Save
it: Salvataggio automatico

source: Error
it: Errore

source: Invert Y Axis
it: Inverti asse Y

source: World name
it: Nome del mondo

source: Sound
it: Suono

source: Русский
it: Russo

source: New World
it: Nuovo Mondo

source: Respawn
it: Rinascita

source: Load World
it: Carica mondo

source: Skills: [00FF00]{0:0}
it: Abilità: [00FF00]{0:0}

source: Profile name
it: Nome del Profilo

source: Select friends to invite to Block Story
it: Seleziona gli amici da invitare a Block Story

source: Space
it: Spazio

source: Português
it: Portoghese

source: Do you want to get more?
it: Vuoi ottenerne di più?

source: Use
it: Usa

source: Click here to create a new character
it: Premi qui per creare un nuovo personaggio

source: MOGA Pro Connected
it: MOGA Pro connesso

source: (click for hint)
it: (clicca per un suggerimento)

source: Close
it: Chiudi

source: Drag Speed: [FF0000]{0:0.0}
it: Velocità di trascinamento: [FF0000]{0:0,0}

source: You DIED!!!
it: Sei MORTO!!!

source: Reset
it: Azzera

source: Not enough mana! Try attacking the creature first!
it: Non hai abbaastanza Mana! Prova prima ad attaccare la creatura!

source: Normal creative mode: unlimited resources, mana, health.
it: Modalità creativa : risorse, mana e vita infiniti.

source: Exit Game
it: Esci dal gioco

source: Resolution
it: Risoluzione

source: Get Content
it: Ottieni contenuti

source: Buy Full
it: Acquista la versione completa

source: Left Hand
it: Mano sinistra

source: Right Hand
it: Mano destra

source: Increases bow attack damage. Higher damage will allow you to kill stronger enemies from a distance. To use the bow you need arrows.
it: Puoi usare i punti abilità per aumentare il danno inflitto con il tuo arco. Un danno maggiore ti permetterà di uccidere nemici più forti a distanza. Per usare l'arco avrai bisogno di frecce.

source: Good
it: Buono

source: Can't fly in water!
it: Non puoi volare nell'acqua!

source: Controller Detected
it: Controller rilevato

source: Beautiful
it: Bellissimo

source: Options
it: Opzioni

source: Show compass
it: Mostra la bussola

source: Failed to download {0}, {1}
it: Download non riuscito {0}, {1}

source: Dig speed:
it: Velocità di scavo:

source: Sword Damage:
it: Danno inflitto con la spada:

source: MOGA Pocket Connected
it: MOGA Pocket connesso

source: Settings
it: Impostazioni

source: Not enough Mana...
it: Mana insufficiente...

source: Bullets: [00FF00]{0}[-] Gun Powder: [00FF00]{1}
it: Munizioni: [00FF00]{0}[-] Polvere da sparo: [00FF00]{1}

source: Water
it: Acqua

source: Failed to upload {0}, {1}
it: Caricamento non riuscito {0}, {1}

source: Player Statistic
it: Statistiche del giocatore

source: WARNING! Changing distance sliders can greatly increase memory usage and reduce performance!
it: ATTENZIONE! La distanza di caricamento impatta drasticamente l'utilizzo della memoria e ridurre la prestazini in gioco!

source: Dynamic sky
it: Cielo dinamico

source: Play
it: Gioca

source: Blocks
it: Blocchi

source: Player Mana:
it: Mana del giocatore:

source: Use the following keys: [FFFF00]1-7[-] for the quick slots [FFFF00]Q[-] or [FFFF00]~[-] for the inventory [FFFF00]Tab[-] for using objects [FFFF00]Space[-] for jumping [FFFF00]WASD[-] for moving [FFFF00]F1[-] for skill points [FFFF00]F2[-] for current quests [FFFF00]F3[-] for taking pictures [FFFF00]F4[-] for settings [FFFF00]F5[-] for equipment [FFFF00]F[-] for flying [FFFF00]R[-] use radar (if equipped)
it: Usa i seguenti pulsanti: [FFFF00]1-7[-] per gli slot rapidi [FFFF00]Q[-] or [FFFF00]~[-] per l' inventario [FFFF00]Tab[-] per usare gli oggetti [FFFF00]Space[-] per saltare [FFFF00]WASD[-] per muoverti [FFFF00]F1[-] per fare foto [FFFF00]F2[-] per le opzioni [FFFF00]F3[-] per i punti abilità [FFFF00]F4[-] per la missione attuale [FFFF00]F5[-] per l'equipaggiamento [FFFF00]F[-] per volare [FFFF00]R[-] per usare il radar (se equipaggiato)

source: Equip
it: Equipaggia

source: Craft
it: Crafta

source: Inventory
it: Inventario

source: Warning
it: Avvertimento

source: Generator should stand to the right or left side of the elevator!
it: Il Generatore deve essere di fianco l'ascensore!

source: Vertical load distance: [FF0000]{0:0}
it: Caricamento della distanza verticale: [FF0000]{0:0}

source: Teleport to:
it: Teletrasportati a:

source: Enter profile name
it: Inserisci il nome del profilo

source: Reset data
it: Azzera tutti i dati

source: Help
it: Aiuto

source: Yes
it: Si

source: Interface (GUI) scale: [FF0000]{0:0.0}
it: Scala dell'intefaccia (GUI): [FF0000]{0:0,0}

source: Terrain quality: [FF0000]{0:0}
it: Qualità del terreno: [ff0000]{0:0}

source: 日本語
it: Giapponese

source: Can't mount this pet until it reaches lvl 30!
it: Non puoi salire su quest'animale finché non raggiunge il livello 30!

source: [00FF00]Hint:[-]
it: [00FF00]Suggerimento:[-]

source: You are trying to attack an NPC!!!
it: Stai cercando di attaccare NPC!!!

source: The same as story mode except: monsters twice stronger, limited death count, progress lost after death.
it: Uguale alla modalità sopravvivenza eccetto che: mostri forti il doppio, numero di morti limitate , progressi persi dopo la morte.

source: Load
it: Carica

source: Quests:
it: Missioni:

source: Trinkets
it: Bigiotteria

source: Click here to create a new world
it: Premi qui per creare un nuovo mondo

source: My world #blockstory
it: Il Mio Mondo #blockstory

source: Exit To Menu
it: Torna al menu

source: Player Health:
it: Salute del giocatore:

source: Sky quality: [FF0000]{0:0}
it: Qualita del cielo: [ff0000]{0:0}

source: Reset Page
it: Azzera la pagina

source: Are You sure to delete world: [00FF00]{0}[-]? This can't be undone!!!
it: Sei sicuro di voler eliminare questo mondo: [00FF00]{0}[-]? Non potrai recuperarlo!

source: Coming Soon...
it: Prossimamente...

source: Can't mount enemy creature with less than 50% health!
it: Non puoi salire su una creatura nemica con più del 50% di vita!

source: Are You sure you want to delete this world? This cannot be undone!!!
it: Sei sicuro di voler eliminare questo mondo? Non potrai più recuperarlo!!

source: Elevator stopped
it: L'Ascensore si è fermato

source: Weather Humidity: [FF0000]{0:0.0}
it: Umidità atmosferica: [FF0000]{0:0.0}

source: Vehicles
it: Veicolo

source: Armor
it: Armatura

source: Time Remaining:
it: Tempo residuo:

source: Native
it: Nativo

source: Monsters
it: Mostri

source: If you want to kill strong enemies with guns, spend some skill points on this skill.
it: Se vuoi uccidere dei nemici forti con una pistola, spendi alcuni punti per questa abilità.

source: Your Diamonds {0}
it: I tuoi Diamanti {0}

source: Wheel of fortune
it: Ruota della fortuna

source: Enable Sound
it: Abilita il suono

source: Invalid world name: [00FF00]{0}[-], use only letters, numbers or space.
it: Nome per il mondo invalido: [00FF00]{0}[-], usa solo lettere e numeri

source: Cancel
it: Annulla

source: Fog density: [FF0000]{0:0.00}
it: Densità della nebbia: [FF0000]{0:0.00}

source: Now available on
it: Ora disponibile su

source: Sucessfully downloaded world {0}
it: Mondo {0} scaricato correttamente

source: English
it: Inglese

source: Gun Power:
it: Potenza della pistola:

source: Magic Items
it: Oggetti magici

source: Drag any item here to see it's description. Tap and hold a stack to move all the items. Tap and hold a stack with 1 finger, and tap an empty slot with another finger to split the stack.
it: Trascina qui qualsiasi oggetto per vederne la descrizione. Tieni premuto uno stack per muoverne tutti gli oggetti. Tieni premuto uno stack con un dito,e premi uno slot vuoto con un altro dito per dividere lo stack.

source: Bow Shoot Force:
it: Potenza di tiro con l'arco:

source: Monster spawn
it: Spawn dei mostri

source: Rewards:
it: ricompense:

source: Shields
it: Scudo

source: Drag Smoothing: [FF0000]{0:0.00}
it: velocità di trascinamento: [FF0000]{0:0.00}

source: Cinematic Motion Blur
it: Sfocatura da movimento

source: Exit
it: Esci

source: Create new world
it: Crea un nuovo mondo

source: Elevator placed
it: Ascensore piazzato

source: Successfully downloaded character {0}
it: Hai scaricato correttamente il giocatore {0}

source: Hand
it: Mano

source: Controls
it: Controlli

source: Drag sensitivity: [FF0000]{0:0.0}
it: Sensibilità: [FF0000]{0:0.00}

source: Magic Damage:
it: Danno magico:

source: Exploring
it: Esplorazione

source: Tilt speed: [FF0000]{0:0.0}
it: Velocità d'inclinazione: [ff0000]{0:0,0}

source: Good spawn
it: Spawn Buono

source: Fantastic
it: Fantastico

source: Equip arrow to left hand!
it: Equipaggia la freccia nella mano sinistra!

source: Fastest
it: Il più veloce

source: Worlds
it: Mondi

source: Weapons
it: Armi

source: Rotation
it: Rotazione

source: Motion blur quality: [FF0000]{0:0}
it: Qualità della sfocatura: [FF0000]{0:0}

source: Vibrate when hit
it: Vibra all'impatto

source: Buy
it: Acquista

source: Hardcore
it: Incubo

source: Dig Particles
it: Particelle di scavo

source: Days:
it: Giorni trascorsi:

source: Other
it: Altro

source: Rotation Sensitivity: [FF0000]{0:0.0}
it: Sensibilità rotazione: [FF0000]{0:0.0}

source: SURE!
it: CERTO!

source: Save and exit
it: Salva ed esci

source: Leveling down...
it: Stai perdendo il tuo potere...

source: Hydra
it: Idra

source: Would you like to purchase a key to unlock this world? Once unlocked, you can continue building it. Keys are cheap and will help us develop this game further. Otherwise, you can continue developing your character by starting a new world
it: Ti piacerebbe comprare una chiave per sbloccare questo mondo? Una volta sbloccato potrai continuare a costruirlo. Le chiavi costano poco e aiuteranno noi a sviluppare ulteriormente il gioco. Altrimenti puoi continuare a sviluppare il tuo personaggio dando inizio ad un nuovo mondo.

source: Pick up loot from greater distances.
it: Se migliorerai questa abilità, potrai buttare oggetti da una distanza maggiore.

source: Enable Weather
it: Abilita il tempo atmosferico

source: Screen Resolution
it: Risoluzione dello schermo

source: You can increase digging speed by spending some skill points here.
it: Puoi aumentare la velocità di scavo spendendo dei punti abilità qui.

source: Field of View: [FF0000]{0:0}
it: Campo visivo: [FF0000]{0:0}

source: Texture quality
it: Qualità delle texture

source: Click on item to see description
it: Clicca nell'oggetto per vederne la descrizione

source: Mode
it: Modalità

source: Rate App
it: Vota l'applicazione

source: Restart the game for the changes to take effect.
it: Riavvia il gioco per applicare le modifiche.

source: Supplies
it: Provviste

source: Each item description in next update.
it: La descrizione degli oggetti sarà disponibile prossimamente.

source: Language
it: Lingua

source: Rename
it: Rinomina

source: Load Successful
it: Caricamento completato

source: Split Touch Controls
it: Controlli touch separati

source: Screen Resolution
it: Risoluzione dello schermo

source: Horizontal load distance: [FF0000]{0:0}
it: Distanza di caricamento orizzontale [FF0000]{0:0}

source: Not enough Diamonds
it: Non hai abbastanza Diamanti

source: Items
it: Strumenti

source: Current fly speed: {0}
it: Velocità di volo attuale : {0}

source: български
it: Bulgaro

source: 한국어
it: Coreano

source: Walking
it: Camminare

source: Texture resolution: [FF0000]{0:0}
it: Risoluzione delle texture: [ff0000]{0:0}

source: Full version only
it: Solo nella versione completa

source: Driving
it: Stai Guidando

source: Complete
it: completo

source: Plants
it: Piante

source: Dynamic Elements Effects
it: Effetti degli elementi dinamici

source: Characters
it: Giocatori

source: Save
it: Salva

source: Water quality: [FF0000]{0:0}
it: Qualità dell'acqua : [ff0000]{0:0}

source: Try to use elevator closer to pipes!
it: Prova a piazzare l'ascensore più vicino ai tubi!

source: Load this character and world by default
it: Carica questo giocatore e questo mondo di default

source: Main Menu
it: Menu principale

source: Current level: {0}
it: Livello attuale: {0}

source: Tools
it: Strumenti

source: Enable USB Mouse Support
it: Attiva il support di un mouse USB

source: Joy Control
it: Controllo del Joystick

source: Preview Pictures
it: Immagini di anteprima

source: World: [00FF00]{0}[-], already exists. Pick a different name.
it: Il mondo: [00FF00]{0}[-], esiste già. Usa un altro nome.

source: World: [00FF00]{0}[-], not found.
it: Mondo: [00FF00]{0}[-], non trovato.

source: Loot Distance:
it: Distanza di drop:

source: Radar legend
it: Legenda del radar

source: Come build something EPIC!
it: Vieni a costruire qualcosa di EPICO!

source: Skip
it: Salta

source: Bed point direction
it: Direzione del letto

source: Fly Speed:
it: Velocità di Volo:

source: Unload Assets from memory (for low memory devices only) [FF0000]Decreases Performance![-]
it: Libera la memoria ram (per device con poca ram) [FF0000]riduce le performance![-]

source: Tilt sensitivity: [FF0000]{0:0.0}
it: Sensibilità d'inclinazione: [ff0000]{0:0,0}

source: Auto Jump
it: Salto automatico

source: Increases bow shoot distance and arrow speed.
it: Aumentare questa abilità pemetterà al tuo arco di scoccare frecce a una distanza maggiore; le tue frecce, inoltre, saranno più veloci.

source: Enable Camera Z axis tilt effect
it: Attiva gli effetti dell'inclinazione sull'asse Z

source: Tilt Control
it: Controllo dell' inclinazione

source: Drag rotation
it: Rotazione di trascinamento

source: Drag Control
it: Controllo di trascinamento

source: Enter spawn point name
it: Inserisci il nome per il punto di respawn

source: Coloring
it: Colore

source: Background Sounds
it: Suoni di sottofondo

source: Show On Connect
it: Mostra alla connessione

source: Head Bobbing
it: muovere la testa

source: You will receive:
it: riceveraì:

source: Story
it: Storia

source: Animals
it: Animali

source: Arrow Damage:
it: Danno delle freccie:

source: Current health: {0}/{1}
it: Salute attuale : {0}/{1}

source: Achievements
it: Realizzazioni

source: Fast
it: Veloce

source: Current Exp: {0}
it: Esperienza attuale : {0}

source: Deutsch
it: Tedesco

source: Creative
it: Creativo

source: Unlock World
it: Sblocca il mondo

source: Field of view
it: Campo visivo

source: Increases movement speed.
it: Se vuoi muoverti più velocemente, faresti meglio a spendere qualche punto su questa abilità.

source: Exp
it: Scad.

source: Rotation Smoothing: [FF0000]{0:0.00}
it: Velocità di scorrimento durante la rotazione: [FF0000]{0:0.00}

source: Can't mount this creature!
it: Non puoi salire su quest'animale!

source: Can't use this tool on creatures!
it: Non puoi utilizzare quest'oggeto nelle creature!

source: Arrows: [00FF00]{0}
it: Frecce: [00FF00]{0}

source: Quests
it: Missioni

source: Increases magic attack. To use it, click and hold on an enemy, then wait for the casting bar to reach full. Magic can be the most powerful weapon in your inventory, but need you time to cast it. Be careful! ;)
it: Aumenta questa abilità per avere un attacco magico più forte. Per usarlo, tieni premuto su un nemico. Attendi fino al completo riempimento della barra di lancio degli incantesimi. La magia può essere la più potente arma nel tuo inventario, ma ci vuole tempo per lanciare un incantesimo, quindi fa attenzione ;)

source: Français
it: Francese

source: Enable Camera effects
it: Attiva gli effetti della videocamera

source: Earthquake!!!
it: Terremoto!!!

source: Next
it: Prossimo

source: Tilt rotation
it: Rotazione dell'inclinazione

source: Elevator move backward
it: L'Ascensore si muove in basso

source: Enable Hand tools tilt effect
it: Abilita l'effetto d'inclinazione per gli strumenti

source: Epic Spawners
it: Spawner epico

source: Spawn point
it: Punto di respawn

source: Please Wait...
it: Attendi, per favore...

source: Level:
it: Livello:

source: If you purchase the full version you will be able to have more than one character
it: Se compri la versione completa del gioco potrai avere più di un personaggio

source: Not enough Graviton!
it: Non hai abbastanza Graviton!

source: Español
it: Spagnolo

source: Redeem Coupon
it: redimere buono

source: Show when taking pictures
it: rallenta quando si scattano le foto

source: Picture
it: foto

source: Enter Coupon Code
it: inserire il codice del buono

source: Login
it: accedi

source: Logout
it: esci

source: Not logged in
it: non sei loggato

source: Watch a short video to keep your experience
it: Guarda un breve video per mantenere viva la tua esperienza

source: Watch
it: Guarda

source: Coupon already redeemed Would you like to purchase more Diamonds?
it: Coupon già rimborsato Vuoi acquistare altri Diamanti?

source: Enable Attack Button
it: Blocchi

source: Enable Creatures
it: Abilita il tempo atmosferico

source: Max Creatures Count: [FF0000]{0}[-]
it: Creature Max: [FF0000]{0}[-]

source: Chinese
it: Cinese

source: Chinese (Taiwan)
it: Cinese (Taiwan)

source: Not enough room in inventory.
it: Spazio insufficiente nell'inventario.

source: You don't have enough {0}.
it: Non ne hai abbastanza {0}.

source: Purchase successful!
it: Acquisto riuscito!

source: Controller Connected
it: Controller collegato

source: Exit To Desktop
it: Torna al desktop

source: Drag
it: Trascina

source: Accelerometer
it: Accelerometro

source: Default
it: Predefinito

source: Speed Up for [2b65a0]{0} {1}[-]?
it: Velocizza per [2b65a0]{0} {1}[-]?

source: Don't interrupt music when changing biomes
it: Non interrompere la musica durante un cambio bioma

source: Disable Music Cutoff
it: Disabilita Tagli Musica

source: Always Run
it: Corri Sempre

source: Run
it: Corri

source: Left Shift
it: Shift Sinistro

source: Are you sure you want to reset your skills?
it: Sicuro di voler resettare le tue abilità?

source: Nothing to reset!
it: Niente da resettare!

source: Go!
it: Via!

source: Thx
it: Grazie
