Repository: TheDark98/blockstory-translation
Catalog: translations/Viking.po
Languages: es

source: Phew! Thank gravy ya took care of them dragon bats.
es: ¡Uff! Muchísimas gracias por hacerte cargo de los murciélagos dragón.

source: If these tough monsters keep poppin’ up, we’re not gonna be able to keep fendin’ them off. You’re gonna need better weapons, Dragon Rider, and to get those, you’re gonna need to talk to the Warrior again. Yuuuuuup!
es: Si estos monstruos siguen aumentando, no vamos a ser capaces de seguir manteniéndolos alejados. Vas a necesitar mejores armas, Jinete de Dragón. Y, para conseguirlas, vas a necesitar hablar de nuevo con el Guerrero. ¡Seeeeeh!

source: Come back soon, I’m sure I’ll have more work for ya. These tasks ain’t gonna complete themselves.
es: Vuelve pronto, estoy seguro de que tendremos más trabajo para ti. Estas tareas no se van a completar solas.

source: Speak to Aaron about acquiring better weapons.
es: Habla con Aaron para adquirir mejores armas.

source: Viking Introduction
es: Introducción Vikinga

source: Ahoy! Eh? That crazy old wizard sent you? Well where's my iron then?
es: ¡Hola! ¿Qué? Ese viejo mago loco te ha enviado? Bueno, entonces, ¿dónde está mi hierro?

source: You brought this iron for me? Well I'm much obliged, stranger! You must be the wizard's new assistant. I'm glad you're here. There's plenty of other work to do.
es: ¿Trajiste este hierro para mí? Bueno, te estoy muy agradecido, forastero! Debes ser el nuevo ayudante del hechicero. Me alegro de que estés aquí. Hay un montón de cosas que hacer.

source: Speak to Ted about the Iron Ore he received.
es: Habla con Ted sobre el Mineral de Hierro que has recibido.

source: Working Metal
es: Trabajando el metal

source: Oooh, yes! This iron is exactly what I need. I can show you how to make deadly weapons with this!
es: ¡Oooh, sí! Este hierro es exactamente lo que necesito. ¡Puedo mostrarte cómo hacer armas mortales con esto!

source: Step one! We need to smelt the iron. For that, you must craft a furnace.
es: ¡Primer paso! Necesitamos fundir el hierro. Para ello, debes construir un horno.

source: Where's that furnace, mate?
es: ¿Dónde esta ese horno, amigo?

source: Well done! With this new furnace I can introduce you to the exciting world of metalworking!
es: ¡Bien hecho! ¡Con este nuevo horno puedo introducirte al apasionante mundo de la metalurgia!

source: Tell Ted that you have crafted a furnace.
es: Dile a Ted que has hecho el horno.

source: Grab some coal or another fuel source. Then use the furnace to smelt the iron into ingots. Smelting takes time, but diamonds can speed up the process.
es: Coge un poco de carbón u otra fuente de combustible. A continuación, usa el horno para fundir el hierro en lingotes. La fundición lleva su tiempo, pero los diamantes pueden acelerar el proceso.

source: You don't need to be a British lord to smelt some iron ingots. Get to it!
es: No necesitas ser un lord británico para fundir unos lingotes de hierro. ¡Manos a la obra!

source: That's some swell smelting you did. Now you can use the iron ingots to make strong tools. These will make you think your old tools were made of mashed potatoes.
es: Buen trabajo con la fundición. Ahora puedes utilizar los lingotes de hierro para fabricar herramientas tan fuertes que pensarás que tus viejas herramientas estaban hechas de puré de patatas.

source: Tell Ted that you have smelted the iron ingots.
es: Dile a Ted que has fundido los lingotes de hierro.

source: Mosey on over to your crafting table. Use the iron ingots ot make an iron pickaxe.
es: Ve a tu mesa de trabajo. Utiliza los lingotes de hierro para hacer un pico de hierro.

source: You can pick your friends, and you can pick your nose, so you best pick your iron pickaxe.
es: Puedes escoger a tus amigos y puedes urgarte la nariz, pero lo mejor será que escojas tu pico de hierro.

source: Your skills continue to amaze me, friend. What other tools can you make with iron?
es: Tus habilidades continúan asombrándome, amigo. ¿Qué otras herramientas se pueden hacer con el hierro?

source: Tell Ted that you have crafted an iron pickaxe.
es: Dile a Ted que has elaborado un pico de hierro.

source: Otherworld Fishing
es: Pesca de otro mundo

source: Luckily, I met you! Everyone just talks about your phenomenal journey outside our world. I found out that there are lakes, and of course, fish should be found there. Have you seen fish there? I’d like to look at these unusual creatures! But I don’t know yet how to catch them. I think an ordinary fishing rod won’t help here.
es: ¡Por suerte, nos vemos! Todos sólo hablan de tu fenomenal viaje fuera de nuestro mundo. Descubrí que hay lagos y, por supuesto, debería haber peces allí. ¿Has visto peces allí? ¡Me gustaría mirar a estas criaturas inusuales! Pero aún no sé cómo atraparlos. Creo que una ordinaria caña de pescar no nos ayudará aquí.

source: If you could help me study their behavior, then I could probably create a suitable fishing rod to catch them. I hope you will not refuse your old friend’s request.
es: Si pudieras ayudarme a estudiar su comportamiento, entonces probablemente podría crear una caña de pescar adecuada para atraparlos. Espero que no rechaces la solicitud de tu viejo amigo.

source: Excellent! Now I know how to make a fishing rod to catch these monsters.
es: ¡Excelente! Ahora sé como hacer una caña de pescar para atrapar a estos monstruos.

source: It is time to try out a new fishing rod. Catch me one of these unusual fish, I can’t wait to look at it. I wonder if they are edible. Do not forget to take more bait, I am sure that these creatures are very voracious.
es: Es hora de probar una nueva caña de pescar. Atrápame uno de estos peces inusuales, no puedo esperar para mirarlo. Me pregunto si serán comestibles. No olvides tomar más cebo, estoy seguro de que estas criaturas son muy voraces.

source: Tell Ted you captured Purplefish.
es: Dile a Ted que capturaste un Pez Morado.

source: What an amazing fish!
es: ¡Pero qué asombroso pez!

source: I see that it is quite edible and even has healing properties. Quick! Roast it and we will try it together.
es: Veo que es bastante comestible e incluso tiene propiedades curativas. ¡Rápido! Ásalo y lo probaremos juntos.

source: Mmm ... what a delicious fish!
es: Mmm... pero que delicioso pez!

source: This fish turned out to be so unusual that now I want to see other aquatic inhabitants of the outside world. Take your fishing rod and catch DumboOctopus for me, I think you’ll do just fine.
es: Este pez resultó ser tan inusual que ahora quiero ver a otros habitantes acuáticos del Espacio. Toma tu caña de pescar y atrapa a un Pulpo Dumbo por mí, creo que lo harás bien.

source: Tell Ted you captured DumboOctopus.
es: Dile a Ted que has capturado al Pulpo Dumbo.

source: Ugh, what a disgusting thing!
es: ¡Ugh, pero que asquerosa cosa!

source: Not sure if I dare to try it. But let's fry it anyway.
es: No estoy seguro si me atrevo a probarlo. Pero vamos a freírlo de todos modos.

source: Tell Ted that you have done fried DumboOctopus.
es: Dile a Ted que has frito al Pulpo Dumbo.

source: Surprisingly, but this DumboOctopus is even tastier and more nutritious than the first fish.
es: Sorprendentemente, este Pulpo Dumbo es aún más sabroso y más nutritivo que el primer pez.

source: I heard that there, in the outside world, besides lakes there are also vast wetlands. Probably swamp fish differ from those that live in water. I'd like to check if this is so.
es: Escuché que allí, en el Espacio, además de los lagos, también hay vastos Humedales. Probablemente los peces de pantano difieren de los que viven en el agua. Me gustaría comprobar si esto es así.

source: Tell Ted you captured Dunkleosteus.
es: Dile a Ted que has capturado al Dunkleosteus.

source: What a big and terrible it is!
es: ¡Pero que grande y terrible que es!

source: And it has such a thick and strong carapace! I have a few ideas about this fish, but I need to think a little. And you meanwhile, roast it.
es: ¡Y tiene un caparazón tan grueso y fuerte! Tengo algunas ideas sobre este pez, pero necesito pensar un poco. Y mientras tanto, ásalo.

source: Probably it was worth a lot of work to tear off its shell. Leave it to me, I want to take a look more closely at it.
es: Probablemente costo mucho trabajo arrancar su caparazón. Déjamelo a mí, quiero echarle un vistazo más de cerca.

source: Each new fish that you bring is more surprising than the previous ones. I have never seen anything like it in our world. The new fishing rod does the job, I think you can easily catch the rest of the fish.
es: Cada nuevo pez que traes es más sorprendente que los anteriores. Nunca he visto algo así en nuestro mundo. La nueva caña de pescar hace el trabajo, creo que puedes atrapar fácilmente el resto de los peces.

source: Tell Ted you captured Fangtooth.
es: Dile a Ted que capturaste al Fangtooth.

source: You surprise me more and more.
es: Me sorprendes más y más.

source: Have you noticed that each new fish is tastier and more nutritious than the previous? Let's check if this is so.
es: ¿Has notado que cada nuevo pez es más sabroso y más nutritivo que el anterior? Vamos a ver si esto es así.

source: Tell Ted that you have done fried Fangtooth.
es: Dile a Ted que has freído al Fangtooth.

source: I was not mistaken, this fish is really tastier.
es: No me equivoqué, este pez es realmente más sabroso.

source: So the last one will be the most delicious than all the rest. Hurry, catch it!
es: Entonces el último será el más delicioso de todos. ¡Date prisa, atrápalo!

source: What is it? Is this a fish?
es: ¿Qué es esto? ¿Esto es un pez?

source: Hmm, I see such a creature for the first time. Not very big, but I hope we’ll have enough for two when you fry it.
es: Hmm, veo una criatura así por primera vez. No es muy grande, pero espero que tengamos suficiente para dos cuando lo cocines.

source: Tell Ted that you have done fried Gulper.
es: Dile a Ted que has freído al Gulper.

source: I was right, this strange fish is the most useful. Now you will not be hungry in a strange world if a new fishing rod is always with you.
es: Tenía razón, este pez extraño es el más útil. Ahora no tendrás hambre en un mundo extraño si una nueva caña de pescar siempre está contigo.

source: While you were fishing, I carefully studied all the fish that you brought. Using this knowledge, I can create a new, very durable shield that will be extremely useful in battle. I will share this recipe with you if you fulfill my request.
es: Mientras pescabas, estudié cuidadosamente todos los peces que trajiste. Con este conocimiento, puedo crear un escudo nuevo y muy duradero que será extremadamente útil en la batalla. Compartiré esta receta contigo si cumples mi pedido.

source: I heard rumors of two ancient creatures from the outside world. One of them is called Tylosaurus and lives in the Mushroom Wetlands, and the second creature Liopleurodon lives in the lakes among the jungle. These creatures are so strong and cannot be killed. I'd love to know if this is true.
es: Escuché rumores de dos criaturas antiguas del Espacio. Uno de ellos se llama Tylosaurus y vive en los Humedales Hongo, y la segunda criatura Liopleurodon vive en los Lagos entre la Selva. Estas criaturas son muy fuertes y no pueden ser asesinadas. Me encantaría saber si esto es cierto.

source: Probably such a great warrior as you can easily cope with this task. Meanwhile, I will finish work on a new shield.
es: Probablemente un gran guerrero como tú puede hacer frente fácilmente a esta tarea. Mientras tanto, terminaré de trabajar en un nuevo escudo.

source: Tell Ted that you killed Liopleurodon and Tylosaurus.
es: Dile a Ted que has matado al Liopleurodon y al Tylosaurus.

source: You managed to defeat them! However, I was sure that it would be so. Take this shield, I made it pretty good, as I think. I'm sure you'll be needing it because you still have many battles and glorious victories ahead.
es: ¡Te las arreglaste para derrotarlos! estaba seguro de que podrías. Toma este escudo. Estoy seguro de que lo necesitarás porque todavía tienes muchas batallas y gloriosas victorias por delante.

source: Tell Ted you killed all fishes.
es: Dile a Ted que mataste a todos los pescados.

source: Tell Ted that you have done fried Purplefish.
es: Dile a Ted que has freído al Pez Morado.

source: Tell Ted that you have done fried Dunkleosteus.
es: Dile a Ted que has freído al Dunkleosteus.

source: Tell Ted you captured Gulper.
es: Dile a Ted que capturaste al Gulper.

source: Tell Ted you have slain the Tentaclon.
es: Dile a Ted que has matado al Tentaclón.
