Repository: TheDark98/blockstory-translation
Catalog: translations/Viking.po
Languages: es

source: City Construction
es: Construir una ciudad

source: Ya know what this wilderness needs? A city! Nothing brings out the energy of a place like urban development. You'll help me build my city, right?
es: ¿Sabes lo que necesita este desierto? ¡Una ciudad! Nada saca la energía de un lugar como el desarrollo urbano. ¿Me ayudarás a construir mi ciudad, ¿verdad?

source: NO?! Waddayamean no? Well then what good are ya, anyway?
es: ¡¿NO?! ¿Cómo que no? Bueno, entonces, ¿de qué sirves?

source: That's the spirit! Now the first thing we'll need is raw materials. Lots of raw materials. So go out there and get some stuff!
es: ¡Ese es el espíritu! Ahora lo primero que vamos a necesitar es materia prima. Un montón de materias primas. ¡Así que sal y consigue algunas cosas!

source: We need lots of raw materials. I know it's a lot to ask, but once my—I mean—our city is complete, you'll see that it was all worth it.
es: Necesitamos una gran cantidad de materias primas. Sé que es mucho pedir, pero una vez que mi, quiero decir, nuestra ciudad esté completa, verás que todo ha merecido la pena.

source: Tell Ted that you have the raw materials.
es: Dile a Ted que tienes las materias primas.

source: Wow! It's a miracle you can carry all that stuff. Here, take your reward. Now I'll let ya in on the next phase of my plan.
es: ¡Guau! Es un milagro que puedas llevar todas esas cosas. Toma, aquí tienes tu recompensa. Ahora te contaré la próxima fase de mi plan.

source: The raw materials you brought me will go a long way to getting our city started, but there's lots more to do yet. The city will need a mine. You don't mind building a mine, do ya?
es: Las materias primas que me trajiste me van a servir para empezar nuestra ciudad, pero todavía hay mucho más por hacer. La ciudad necesitará una mina. ¿No te importa construir una mina, no?

source: Start the excavation wherever ya feel like it, and that's where the people in our city can dig for riches, and us too!
es: Empieza la excavación donde quieras, y ahí es donde la gente de nuestra ciudad puede excavar en busca de riquezas, ¡y nosotros también!

source: If you're having trouble finding precious minerals, place some torches in the dark caves. Any sort of light will make it easier to see all those goodies underground!
es: Si tienes problemas para encontrar minerales preciosos, coloca algunas antorchas en las cuevas oscuras. ¡Cualquier tipo de luz hará que sea más fácil ver todas esas cosas bajo tierra!

source: Tell Ted that you have the precious minerals.
es: Dile a Ted que tienes los minerales preciosos.

source: G-g-g-gold! And gems! When ya spelunk ya bring the funk, my friend. Here's your cut of our profits. Now comes the fun part of building our city.
es: ¡Oro! ¡Y gemas! Cuando quieres puedes, mi amigo. Aquí tienes tu parte de nuestros beneficios. Ahora viene la parte divertida de la construcción de nuestra ciudad.

source: We've gathered the raw materials. We've built a mine for our city. But doesn't that mine look lonely? It's time to build some cottages to keep our mine company. There are special items that make a house feel like a home, and not just a big block of dirt bricks.
es: Hemos recogido las materias primas. Hemos construido una mina para nuestra ciudad. ¿Pero la mina está algo sola, no? Es hora de construir algunas casas de campo para mantener nuestra mina. Hay artículos especiales que hacen que una casa sea un hogar y no sólo un gran bloque de ladrillos de tierra.

source: There's no place like home. There's no place like—oh! I didn't see ya there. If ya need help crafting, check your Recipe Book to learn how to craft different items.
es: No hay lugar mejor que el hogar. ¡No hay lugar mejor que...! ¡Oh! No te había visto. Si necesitas ayuda, comprueba tu Libro de Recetas para aprender cómo elaborar diferentes artículos.

source: Tell Ted that you have the items to build a proper house.
es: Dile a Ted que tienes los objetos necesarios para construir una buena casa.

source: Those beds look more comfortable to sleep on than a chubby goat. You are a person of many skills, my friend. Did ya build a few houses? You should definitely do that if ya get a chance.
es: Esas camas parecen más cómodas para dormir que una cabra gordita. Eres una persona muy habilidosa, amigo mío. ¿Has construido algunas casas? Debes hacerlo si tienes la oportunidad.

source: Thank you for all your help, my friend. I can truly see the city of my dreams, and it's all because of you. As you continue your adventures in this land, you should build more houses! And bigger houses! And expand our city.
es: Gracias por toda tu ayuda, amigo mío. Sinceramente, puedo ver la ciudad de mis sueños y todo gracias a ti. ¡A medida que sigas tus aventuras en esta tierra, debes construir más casas! ¡Y casas más grandes! Y ampliar nuestra ciudad.

source: Check back in once in a while. I may have more work for ya. Oh yeah! This note came for ya while you were gone. It's from that old wizard. He says he's ready for ya. Good luck on your adventures.
es: Vuelve de vez en cuando. Puede que tenga más trabajo para ti. ¡Ah sí! Recibí una nota para ti mientras estabas fuera. Es del viejo mago. Dice que está listo para ti. Buena suerte en tus aventuras.

source: Dragon Helmet
es: Casco de Dragón

source: Oi! Can ya believe that dastardly Dragon Dolt? Ya gotta help me clobber him!
es: ¡Oh! ¿Te puedes creer a ese cobarde de Dragón Bobalicón? ¡Ayúdame a darle una paliza!

source: The Dragon Lord’s cruelty tore my family asunder. I’ll never forgive myself for helpin’ him get tough again. Together I hope we can undo what we have done.
es: El Señor Dragón ha separado cruelmente a mi familia. Nunca me perdonaré a mi mismo por haberle ayudado a hacerse fuerte de nuevo. Espero que juntos podamos deshacer lo que hemos hecho.

source: The whole world is countin’ on you, Dragon Rider. Don’t give up!
es: El mundo entero cuenta contigo, Jinete de Dragón. ¡No te rindas!

source: Tell Ted you have crafted the Dragon Helmet.
es: Dile a Ted que has conseguido el Casco del Dragón.

source: Now that’s what I call a helmet! Maybe we stand a chance after all.
es: ¡Eso es lo que yo llamo un casco! Quizás tengamos una oportunidad después de todo.

source: All our work will be for nothin’ if the Dragon Lord continues his reign of terror. Think of our city! Anyway, that gross goblin came by lookin’ for ya. Even he’s ticked about the Dragon Lord.
es: Todo nuestro trabajo será en vano si el Señor Dragón continúa su reinado de terror. ¡Piensa en nuestra ciudad! De todos modos, ese duende bruto vino a buscarte. Incluso él está harto del Señor Dragón.

source: Speak to Mr. Goblin about the next piece of dragon gear.
es: Habla con el Señor Duende sobre la siguiente pieza del engranaje del dragón.

source: Monster Troubles
es: Problemas de Monstruos

source: Oi! You’re back. And not a moment too soon. This monster problem is gettin’ out of hand.
es: ¡Oh! Has vuelto. Y no demasiado pronto. Este problema de monstruos se nos está yendo de las manos.

source: Ever since ya took care of the Ice Dragon, the yetis in the snow country have been runnin’ amok. I guess the old blizzard-blastin’ reptile kept those hairy frog-lookin’ things in check. Ya have to take out the yetis, Dragon Rider!
es: Desde que te encargaste del Dragón de Hielo, los yetis del país de la nieve han estado corriendo fuera de control. Supongo que el viejo reptil ventisca con aspecto de rana peluda mantuvo las cosas bajo control. ¡Tienes que sacar a los yetis, Jinete del Dragón!

source: The yetis in the snow country are downright abominable... What? Why are ya smilin’?
es: Los yetis del país de la nieve son totalmente abominables... ¿Qué? ¿De qué te ríes?

source: Tell Ted you have slain the yetis.
es: Dile a Ted que has matado a los yetis.

source: Good job, Dragon Rider.
es: Buen trabajo, Jinete de Dragón.

source: Goblins! I knew our trouble wasn’t over. Dragon Rider, we’re under attack! Stop the goblin invasion, before our whole city is overrun.
es: ¡Duendes! Sabía que nuestros problemas no habían acabado. Jinete de Dragón, ¡nos atacan! Detén la invasión de los duendes antes de que toda nuestra ciudad esté rodeada.

source: Some say the goblins are descended from the dragons, due to their similar features. The scaly skin is where the comparison ends. Goblins are so hideous, and downright rude!
es: Algunos dicen que los duendes descienden de los dragones, debido a sus similares características. La cara escamosa es donde acaba la comparación. Los duendes son tan feos... ¡Y completamente brutos!

source: Tell Ted you have slain the goblin warriors.
es: Dile a Ted que has matado a los duendes guerreros.

source: I knew I could count on you to take care of those goblins, Dragon Rider. But I’ll be gosh darned if I haven’t figured out the source of these recent monster attacks.
es: Sabía que podía contar contigo para que te encargaras de esos duendes, Jinete de Dragón. Pero caeré en desgracia si no descubro la fuente de esos recientes ataques monstruosos.

source: Have you seen that one goblin who’s been trollin’ the region? He’s an ugly one. I saw him stirrin’ up trouble with the monsters, and I reckon he’s behind the recent wave of monster attacks.
es: ¿Has visto a ese duende que ha estado merodeando por la región? Es uno de los feos. Le vi buscando problemas con los monstruos y creo que está tras la reciente ola de ataques de monstruos.

source: With all the troubles we’ve had lately, I can barely hear myself think.
es: Con todos los problemas que hemos tenido últimamente apenas he podido escuchar mis pensamientos.

source: Speak to Mr. Goblin about the recent monster attacks.
es: Habla con el Señor Duende sobre los recientes ataques de monstruos.

source: Sailing the Seas
es: Surcando los Mares

source: So ya wanna be a seafarer, eh? Sure! I can get ya a boat.
es: Así que quieres ser marinero, ¿no? ¡Claro! Puedo conseguirte un barco.

source: The greatest civilizations in history took to the sea, and we shall be no different. Gather the necessary supplies, then assemble your mighty galleon!
es: Las civilizaciones más grandes de la historia se echaron a la mar y no debemos ser menos. ¡Conseguid los suministros necesarios y montad un potente galeón!

source: Tell Ted you have crafted the boat.
es: Dile a Ted que has conseguido el barco.

source: Bon voyage, Dragon Rider. May ya always have smooth sailin’.
es: Buen viaje, Jinete de Dragón. Espero que tengas siempre una travesía tranquila.

source: Now that ya got a boat, I’ve got another task for ya. Out in the sea there’s been a whole bunch of sharks chompin’ on things, makin’ trouble. Get out there and show ‘em what we’re made of.
es: Ahora que ya tienes el barco, tengo otra tarea para ti. En alta mar hay un completo banco de tiburones que se comen las cosas y crean problemas. Salgamos ahí y enseñémosles de qué pasta estamos hechos.

source: Tell Ted you have slain the sharks.
es: Dile a Ted que has matado a los tiburones.

source: Is that a shark tooth stickin’ outta your knuckle? Holy chum, Dragon Rider. You’re one tough fisherman.
es: ¿Eso es un diente de tiburón pegado a tus nudillos? Joder camarada, Jinete de Dragón. Eres un pescador duro.

source: They say the dreaded Tentaclon rules the deep – a mighty monster with more legs than you can count! Take him out, so the sea critters will be free to swim in peace, once again.
es: Dicen que el temido Tentaclón gobierna en lo profundo, ¡un monstruo poderoso con más patas de las que puedas contar! Sácalo de allí para que las criaturas marinas sean libres para nadar en paz, otra vez.

source: There are rumors, Dragon Rider, of one ocean dweller even mightier than Tentaclon, but I dare not speak her name. I hope you never hear it.
es: Hay rumores, Jinete de Dragón, de que hay un habitante en el océano incluso más poderoso que el Tentaclón, pero no me atrevo a pronunciar su nombre. Espero que nunca lo oigas.

source: I’m glad to see ya returned in one piece. Go wash the ink off your hands and then come talk to me. I have a message from His Wizardliness.
es: Me alegra ver que has regresado de una pieza. Ve a quitarte la tinta de las manos y ven a hablar conmigo. Tengo un mensaje del Hechicero.

source: While you were out tanglin’ with Tentaclon, the Wizard told me he’s "ready for ya," whatever that means. I’d head over there and see what’s up.
es: Mientras estabas fuera liado con el Tentaclón, el Hechicero me dijo que él estaba "listo para ti", signifique lo que signifique. He ido allí y he visto de qué se trata.

source: Scary Giant
es: Gigante Intimidante

source: Oi! Well if it ain’t me old friend the Dragon Rider. I’ve got a rotten dinosaur problem. Will ya get out there and trounce that tyrannosaur, pretty please?
es: ¡Hey! Mi viejo amigo el Jinete de Dragones. Tengo un problema con dinosaurios. ¿Puedes ir a derrotar al Tiranosaurio, Por favor?

source: Don’t let its scraggly little arms fool ya. One chomp from those big jaws and you’ll be a piece of used chewin’ gum, Dragon Rider.
es: No te dejes engañar por estos brazos flacos. Un golpe a esa mandíbula y no vas a ser mas que puré Jinete de Dragones.

source: Tell Ted you have slain the TRex.
es: Dile a Ted que has matado al Tiranosaurio.

source: That’s the Dragon Rider I know! Tomorrow I’ll have more dinosaurs for you to squash. Heck, I’d give my own leg to someone who could get rid of them all.
es: ¡Ese es el Jinete de Dragones que conozco! Mañana tendré mas dinosaurios para que elimines. Daría mi pierna izquierda por alguien que los eliminara a todos.

source: You’ve thinned the herd of T-Rexes in this land, ole pal. I can’t give ya my own leg (I need it for stuff) but I will give ya this other leg I found.
es: Has reducido la manada de Tiranosaurios en esta tierra. No te puedo dar mi propia pierna izquierda (la necesito) pero te puedo dar esta otra que encontré.

source: Sea Life
es: Vida Marina

source: Check out my new fishing rod!
es: Mira my caña de pescar!

source: Talk to Ted, he wants to show you something.
es: Habla con Ted, tiene algo que decirte.

source: I am really craving fried fish, it's delicious!. Do you want some too? Go craft a fishing rod and bait. Come back when you are done.
es: Tengo un antojo de pescado frito, es delicioso!. ¿Tu también quieres? Vas a necesitar una caña de pescar y carnada, regresa cuando hayas echo una.

source: Tell Ted that you created the fishing rod and bait.
es: Dile a Ted que has hecho una caña de pescar y carnada.

source: Not a bad start, shall we begin?
es: No esta nada mal. ¿Comenzamos?

source: So, you think you have what it takes to become a fisherman?
es: Estás seguro que estás listo para ser un pescador?

source: In that case, come back when you are ready.
es: entonces regresa cuando estés listo.

source: I will teach you all the tricks of fishing in this world! First, take the fishing rod in your hands and cast it away into the sea with the bait, close to a fish. When the fish starts nibbling, pull it immediatelly. With some luck you will catch it. Bring me some ClownFish, and we will continue.
es: Ahora te muestro los trucos para pescar! Usa la caña de pescar y lanza la carnada al agua cerca de un pez. Cuando veas que el pez muerde la carnada jala! A veces el pez se escapa, no llores por eso. Trae un pez payaso y continuamos.

source: Tell Ted you caught the fish.
es: Dile a Ted que capturaste los peces.

source: You are learning well. Now it is time to give you a real test.
es: Aprendes rápido. Te voy a dar una prueba verdadera.

source: I think you are ready to go to the deep ocean and catch something good. Live sharks are very valuable, if you catch a few, I will reward you generously! Grab your fishing road and hit the road.
es: Listo para ir al océano y capturar algo bueno? Los tiburones son costosos, si capturas una docena y me los traes, te doy una recompensa generosa. Agarra tu caña y lárgate.

source: Tell Ted that you caught 30 sharks.
es: Dile a Ted que capturaste 30 tiburones.

source: Incredibly, very few people can take on a white shark and live. Here, take these instructions. You can craft a really nice boat with it. You have earned it.
es: Increíble, pocas personas se meten con un Tiburón blanco. Toma, aquí tienes las instrucciones para hacer un barco, te las has ganado.

source: I must admit I have taught you well. Now you are ready for the final test. The old fishermen tell stories about the Rainbow Basilisk. It is a rare and mysterious creature. Rumor has it that if you can catch one, then it will be loyal to you forever. It is not an ordinary Basilisk, the Rainbow Basilisk is invisible until it is caught accidentally, you just have to get lucky.
es: Debo admitir que te entrené perfectamente. Estás listo para la prueba final. Los pescadores hablan de los legendarios Basiliscos Arco Iris, son misteriosos y muy raros. Dicen que si logras capturar uno del océanos, entonces tus almas serán unidas para siempre. Los Basiliscos ordinarios no sirven, el Basilisco Arco Iris es invisible hasta que lo capturas por accidente, necesitas mucha suerte.

source: Tell Ted that you caught the Rainbow Basilisk.
es: Dile a Ted que capturaste el Basilisco Arco Iris.

source: I've always believed in you. Now you have a loyal Rainbow Basilisk. It swims well under the water. Keep an eye on it.
es: Siempre tuve fe en ti. Ahora tienes un Basilisco Arco Iris fiel. Nada muy bien bajo el agua. Cuídalo bien.

source: Check back from time to time, who knows, maybe I can propose something interesting for you.
es: Visítame de ves en cuando, a lo mejor tengo una proposición para ti.

source: Staking Claim
es: Pedir Hoguera

source: By my iron pickaxe, it’s the Dragon Rider! I haven’t seen ya in many a moon.
es: Por mi pico de acero, ¡si es el Jinete de Dragón! Hacía siglos que no te veía.

source: It’s good to see ya here, Dragon Rider, and not a moment too soon! Them bears have been mussin’ up my city-buildlin’ plans! Thin out the sleuth a bit for me, would ya?
es: Es bueno verte por aquí, Jinete de Dragón, y no es demasiado pronto. ¡Los osos han estado revolviendo mis planes de construir una ciudad! Dispersa un poco a esos sabuesos, ¿lo harías?

source: Bet ya didn’t know a pack of bears was called a sleuth, did ya? I may be a copper-headed Viking but I still know a thing or two.
es: Apuesto a que no sabías que a una manada de osos se la llama sabuesos, ¿a que no? Puedo ser un vikingo con cabeza de cobre pero todavía sé una cosa o dos.

source: Tell Ted you have slain the bears.
es: Dile a Ted que has matado a los osos.

source: Nice job, Dragon Rider! Now ya can get back to work for me. I mean—we can get back to work. Heh, heh.
es: ¡Buen trabajo, Jinete de Dragón! Ahora ya puedes volver al trabajo por mí. Quiero decir... podemos volver al trabajo, jeje.

source: It’s always been my dream to have my own garden. But not just a little backyard greenhouse. I’m talkin’ HUGE TRACTS OF LAND! Big enough to feed a whole city. To till the earth, we’ll need a hoe. The Dragon Rider knows how to make one of those, don’t ya?
es: Siempre ha sido mi sueño tener mi propio jardín. Pero no sólo un pequeño jardín trasero. Me refiero a ¡GRANDES ZONAS DE TERRENO! Lo suficientemente grandes como para alimentar a toda la ciudad. Para labrar la tierra, necesitaremos una azada. El Jinete de Dragón sabe cómo conseguir una, ¿no?

source: SNIFF! Ahh...there’s nothing like the smell of freshly tilled soil.
es: ¡SNIFF! Ahh... no hay nada como el olor a tierra recién arada.

source: Tell Ted you have crafted the hoe.
es: Dile a Ted que has conseguido la azada.

source: That wasn’t so hard, was it? Must seem a bit anticlimactic after slaying dragons and casting magic spells, but a true hero is someone who feeds the hungry, clothes the needy, ya know what I mean?
es: No ha sido tan difícil, ¿no? Parece un poco decepcionante después de matar dragones y hacer magia, pero un verdadero héroe es alguien que da de comer al hambriento y viste al necesitado, ¿sabes a qué me refiero?

source: I hope you’ve been puttin’ that hoe to good use. If not, try diggin’ a garden for me, will ya? When you’re done, you’re gonna need a fence, otherwise the critters will eat our food before we can!
es: Espero que le hayas dado un buen uso a la azada. Si no, intenta cavar un jardín por mí, ¿lo harás? Cuando lo hayas hecho, necesitarás una valla, ¡sino los bichos se comerán la comida antes que nosotros!

source: You’re gonna need a fence, otherwise the critters will eat our food before we can! If you’re short on wood, go chop down some trees. The forests are full of ‘em!
es: Vas a necesitar una valla, ¡sino los bichos se comerán nuestra comida antes que nosotros! Si no tienes mucha madera, ve a cortar unos árboles ¡Los bosques están llenos!

source: Tell Ted you have crafted the materials required to construct the garden.
es: Dile a Ted que has conseguido los materiales necesarios para construir el jardín.

source: Presto! Instant barricade. Those veggie-stealin’ varmints won’t know what hit ‘em! ... A fence. A fence is what will hit ‘em.
es: ¡Rápido! Barricada instantánea. ¡Esas alimañas ladronas de verduras no saben lo que les espera! ... Una valla. Una valla es lo que les espera.

source: The reason I’ve been havin’ ya run these errands is I need some bread. We gotta feed the city, ya know? Put that green thumb of yours to good use and let’s get bakin’!
es: La razón por la que te he tenido corriendo para hacer esos recados es que necesito un poco de pan. Vamos a dar de comer a la ciudad, ¿sabes? Pon esos dedos verdes a trabajar, ¡y empecemos a hornear!

source: There’s nothin’ like the smell of fresh baked bread. Mmm... I can taste it already!
es: No hay nada como el olor del pan recién horneado. Mmm... ¡Casi puedo saborearlo!

source: Tell Ted you have baked some bread.
es: Dile a Ted que has horneado el pan.

source: Yum, yum, yum! Good work, Dragon Rider!
es: ¡Bien, bien, bien! ¡Buen trabajo, Jinete de Dragón!

source: Ya must be tired from running all over creation so much. I’ve got just the thing for ya. Teleport Arrows! Here’s the plans to build ‘em.
es: Debes de estar cansado de correr tanto. Tengo algo para ti. ¡Flechas de Teletransporte! Aquí están los planos para construirlas.

source: Teleportation is the fastest way to travel long distances. I just hope it doesn’t make your dragon jealous. Craft a quiver of these arrows. There’s only like a fifteen percent chance your organs get teleported outside your body.
es: El teletransporte es la forma más rápida de recorrer largas distancias. Sólo espero que tu dragón no se ponga celoso. Consigue una aljaba para esas flechas. Solamente hay alrededor del quince por ciento de posibilidades de que tus órganos se teletransporten fuera de tu cuerpo.

source: Tell Ted you have crafted the teleport arrows.
es: Dile a Ted que has conseguido las flechas de teletransporte.

source: That’s the ticket! Now all you have to do is shoot the arrows where you would like to teleport and give them whirl.
es: ¡Aquí está el billete! Ahora lo único que tienes que hacer es disparar las flechas cuando quieras teletransportarte y hacerlas girar.

source: Oh drat it all. Look at those monsters out there. Roamin’ about. Causin’ trouble. Dragon Rider, hurry! I need your help to slay these vile dragon bats.
es: ¡Ay, mi madre! Mira esos monstruos de ahí. Dando vueltas. Buscando problemas. ¡Date prisa, Jinete de Dragón! Necesito tu ayuda para matar a esos canallas de los murciélagos dragón.

source: WAH!!! They’re dragons, and they’re bats! Get ‘em away from me! AIE!!!!
es: ¡WAH! ¡Son dragones y son murciélagos! ¡Aléjalos de mí!

source: Tell Ted you have slain the dragon bats.
es: Dile a Ted que has matado a los murciélagos dragón.
