Repository: TheDark98/blockstory-translation
Catalog: translations/Warrior.po
Languages: it

source: Dragon Armor
it: Armatura del Drago

source: Ack... Dragon Rider... I am...hurt...
it: Ack...Cavaliere di Draghi...sono...ferito...

source: You taught me to be brave, my friend. I saw the Dragon Lord had released his dragons upon the world and I set out to defeat them. But I was no match for a dragon. I am badly wounded. Please, defeat the dragons. Avenge me.
it: Tu mi hai insegnato ad essere coraggioso, amico mio. Avevo visto che il Signore dei Draghi aveva rilasciato i suoi draghi sopra il mondo e io sono partito per sconfiggerli. Ma non ero pronto ad affrontare un drago. Sono ferito gravemente. Per favore, sconfiggi i draghi. Vendicami.

source: Tell Aaron you have slain the dragons.
it: Dì ad Aaron che hai ammazzato i draghi..

source: Amazing. You defeated all three? You’ve given me hope. Maybe now I can repay the favor.
it: Fantastico. Li hai sconfitti tutti e tre? Mi hai dato speranza. Forse ora posso ripagare il favore.

source: I feel weak, but helping you create Dragon Armor is the least I can do.
it: Mi sento debole, ma aiutarti a creare l'Armatura del Drago è il minimo che possa fare.

source: Tell Aaron you have crafted the Dragon Armor.
it: Dì ad Aaron che hai creato l'Armatura del Drago.

source: Marvelous. The scales of the dragon will protect you against the Dragon Lord’s barrage of powerful spells. Now...I am inspired.
it: Meraviglioso. Le scaglie del drago ti proteggeranno contro i potenti incantesimi del Signore dei Draghi. Ora...sono ispirato.

source: You are our angel, Dragon Rider. And our angel needs an Angelic Sword to defeat that devilish Dragon Lord.
it: Sei il nostro angelo, Cavaliere di Draghi. E il nostro angelo ha bisogno di una Spada Angelica per sconfiggere quel diabolico Signore dei Draghi.

source: Cough cough! Dragon Rider. I cannot even lift my hammer. But you can. Please, make your glorious sword.
it: Couh cough. Cavaliere di Draghi, Non posso nemmeno sollevare il mio martello. Ma tu puoi. Per favore, forgia la tua gloriosa spada.

source: Tell Aaron you have crafted the Angelic Swords.
it: Dì ad Aaron che hai creato la Spada Angelica.

source: The pain is too great... I see an angel before me. Is this the end?
it: Il dolore è troppo grande... Vedo un angelo davanti a me. Questa è la fine?

source: My friend...you protected me and taught me courage. I’ll never forget you. Good-...
it: Amico mio...mi hai protetto e insegnato il coraggio. Non ti dimenticherò mai. Buon-...

source: Speak to Paula to prepare for your fight against the Dragon Lord.
it: Parla a Paula per prepararti per la tua battaglia contro il Signore Drago.

source: Prehistoric Menace
it: Minaccia Preistorica

source: Dragon Rider! Thank goodness you’re here. I’m quaking in my boots with all these monsters running about.
it: Cavaliere di Draghi! Grazie al cielo sei qui. Sto tremando nei miei stivali con tutti questi mostri che corrono intorno.

source: T-Rex! There are so many T-Rex out there. You have to stop them, Dragon Rider. PLEASE!
it: T-Rex! Ci sono così tanti T-Rex là fuori. Devi fermarli, Cavaliere di Draghi. PER FAVORE!

source: I heard somewhere that if you stand perfectly still, a T-Rex can’t see you. But then again, I also heard that they can smell you from a mile away.
it: Ho sentito da qualche parte che se stai pefettamente immobile, un T-Rex non può vederti. Ma allora, ho sentito anche dire che fiutano il tuo odore da lontano un miglio.

source: Tell Aaron you have slain several T-Rex.
it: Dì ad Aaron che hai ucciso diversi T-Rex.

source: I never thought you’d be able to do it, but I guess a terrible lizard is no match for a Dragon Rider!
it: Non avevo mai pensato che saresti stato in grado di farlo, ma presumo che una lucertola terribile non può competere con un Cavaliere di Draghi!

source: I can feel my heart rate returning to normal. Okay – crisis averted. Now we can make a new sword and shield for you.
it: Posso sentire la velocità del mio cuore tornare normale. Okay. Crisi evitata. Ora possiamo fare una nuova spada e uno scudo per te.

source: You have the ability, Dragon Rider. I believe in you. Assemble the weapons you need to defeat Ashkore!
it: Tu hai la capacità, Cavaliere di Draghi. Credo in te. Forgia le armi che ti servono per sconfiggere Ashkore!

source: Tell Aaron you have crafted the Epic Sword and Shield.
it: Dì ad Aaron che hai creato la Spada Epica e lo Scudo.

source: Ha ha! Terrific. That dragon won’t know what hit him.
it: Ha ha! Fantastico. Quel drago non saprà cosa lo avrà colpito.

source: Now that you have new weapons, it’s time to return to the Wizard. I’m sure he has big plans for you. If you ever need anything metal-related, like weapons or armor, I’m your man. You can think of me as your alloy ally.
it: Adesso che hai nuove armi, è tempo di tornare dal Mago. Sono certo che ha grandi progetti per te. Se tu avessi mai bisogno di qualcosa relativo al metallo, come armi o armatura, sono il tuo uomo. Puoi pensarmi come un tuo alleato di ferro.

source: Stinky Mining
it: Estrazione puzzolente

source: Hey, Dragon Rider! I’m working on a weapon worthy of a warrior such as you. Wow! That’s a lot of W’s. I’m going to need a lot of Sulfur to make it, though. That’s where you come in.
it: Hey, Cavalcatore di Draghi! Sto lavorando a un'arma degna di un guerriero come te. Wow! Sono un sacco di vittorie. Ma mi servirà molto Zolfo per realizzarla. Ed ecco che entri in gioco tu.

source: The system I’m working with can process up to fifty Sulfur per day. I’ll need a lot more than that, but you’ve got a nose for finding those stinky rocks, don’t you?
it: Il sistema su cui sto lavorando può processare fino a 50 unità di Zolfo al giorno. Me ne servirà molto più di questo, ma tu hai il fiuto per trovare queste rocce puzzolenti, non è così

source: Nice! Check back tomorrow and I’ll send you out for more ore.
it: Bene! Torna domani e ti manderò a cercare altro minerale.

source: I have great news! That’s all the ore I need. Now feast your eyes on my ultimate weapon!
it: Ho delle grandi notizie! Ho tutto il minerale necessario. Ora apri gli occhi e ammira la mia arma definitiva!

source: Warrior Defense
it: Difesa del Guerriero

source: Why are you talking to me? Is something wrong? Do you have bad news? Oh. Oh I see. Armor? Well why didn't you say so?
it: Perché stai parlando con me? C'è qualcosa che non va? Hai delle cattive notizie? Oh. Oh vedo. Armatura? Bene perché non l'hai detto allora?

source: We're all doomed. Doomed, I tell you! That Dragon Lord is going to obliterate everyone in this whole world!
it: Siamo tutti condannati. Condannati, te lo dico io! Quel Signore dei Draghi sta per cancellare tutti dal mondo intero!

source: It's sad. I know. I should go hide in a cave. But there are SPIDERS in the caves. Spiders! With spindly legs and big buggy eyes and they shoot webbing out of their butts. Spiders are the deadliest predators in the animal kingdom, you know.
it: È triste. Lo so. Dovrei andare a nascondermi in una caverna. Ma ci sono i RAGNI nelle caverne. Ragni! Con le loro zampe sottili e i loro grandi occhi; e in più lanciano ragnatele dal loro didietro. I ragni sono i predatori più mortali nel regno degli animali, lo sai.

source: There's a super scary spider called Aragog who prowls near here. I'm so scared of him, I can't work! If you want to learn how to make armor, you have to defeat Aragog first.
it: C'è un ragno molto spaventoso chiamato Aragog che si aggira qui intorno. Sono così spaventato da lui, che non posso lavorare! Se vuoi imparare come fare le armature, prima devi sconfiggere Aragog.

source: Is it safe? Is he gone? Then what are you talking to me for?! Go get Aragog!
it: Siamo al sicuro? Se ne è andato? Allora perché stai parlando con me? Vai a prendere Aragog!

source: Tell Aaron that Aragog has been slain.
it: Dì ad Aaron che Aragog è stato ucciso.

source: Thank goodness that nasty Aragog is gone. So it's safe to come out and craft some armor? I guess so, as long as zombie spiders aren't a thing. Wait. Are zombie spiders a thing?
it: Meno male che il terribile Aragog se ne è andato. Quindi è sicuro uscire fuori e creare qualche armatura? Penso di sì, a meno che non esistano dei ragni zombie. Aspetta. Esistono i ragni zombie?

source: You impressed me with how you handled Aragog, Dragon Rider. Here are some recipes to craft the armor that will help you defeat the Ice Dragon. I'm all out of raw materials. You'll have to craft the armor yourself using a Furnace. Good luck!
it: Mi hai impressionato per come ti sei misurato con Aragog, Cavaliere di Draghi. Qui ci sono alcune istruzioni per creare l'armatura che ti aiuterà a sconfiggere il Drago di Ghiaccio. Io ho finito i materiali grezzi. Tu dovrai creare l'armatura da solo usando una Fornace. Buona fortuna!

source: They say that warriors are not so much brave as they are very skilled at being terrified. I am an expert at that. Besides, warriors get the best armor, which provides the best protection. Stay safe! That's my motto. You'll have to craft the armor yourself using a Furnace.
it: Dicono che i guerrieri non sono così coraggiosi quanto sono abili ad essere terrorizzati. Su questo io sono un esperto. Oltretutto, i guerrieri hanno la miglior armatura, che fornisce la miglior protezione. Stai al sicuro! Questo è il mio motto. Dovrai creare l'armatura da solo usando una Fornace.

source: Tell Aaron you have crafted the armor.
it: Dì ad Aaron che hai creato l'armatura.

source: Well, it's clear no expert crafted this armor, but it'll do. Good job, Dragon Rider. May courage guide your hand. And if not, may cowardice guide your feet so you don't get eaten by a dragon.
it: Bene, è chiaro che nessun esperto ha creato questa armatura, ma andrà bene. Buon lavoro, Cavaliere di Draghi. Possa il coraggio guidare la tua mano. Altrimenti, possa la codardia guidare i tuoi piedi, così non sarai mangiato dal drago.

source: You know my motto: "If you know you're not the winner, run away so you're not dinner." Take care and ask the Wizard what the next step is.
it: Conosci il mio motto: "Se sai che non sei il vincitore, scappa via così non sarai la cena Prenditi cura di stesso e chiedi al Mago qual è il prossimo passo.

source: Warrior Offense
it: Attacco del Guerriero

source: Anvils aghast! You startled me, Dragon Rider. Yeah, yeah, nice to see you too.
it: Incudini inorridite! Tu mi sorprendi, Cavaliere di Drago. Sì, sì, è bello vedere anche te.

source: Swamp snakes! Why’d it have to be swamp snakes? They’re everywhere, Dragon Rider, and they’re a menace. Please, these pests have me scared stiff. Take care of them, and I’ll be able to help you craft powerful weapons once again.
it: Serpenti di palude! Perché devono esserci sepenti di palude? Sono dappertutto, Cavaliere di Draghi, e sono una minaccia. Per favore, questi parassiti mi hanno spaventato a morte. Prenditi cura di loro, ed io sarò in grado di aiutarti a creare ancora un volta armi potenti.

source: Are the swamp snakes gone yet? Is it safe to come out?
it: Sono già andati via i serpenti di palude? È sicuro uscire fuori?

source: Tell Aaron you have slain the swamp snakes.
it: Dì ad Aaron che hai ammazzato i serpenti di palude.

source: I’m so relieved that you took care of those nasty serpents. [FF00FF]* * * SHUDDER * * *[-] Now let’s get to work.
it: Sono così sollevato che tu ti sei preso cura di quei disgustosi serpenti. [FF00FF]* * * BRIVIDO * * *[-]↵ Ora torniamo al lavoro.

source: You remember how to brew a Mana Potion, right? Well, with Mana Potions it’s a snap to create Magic Arrows.
it: Ti ricordi come si prepara una Pozione Mana, giusto? Bene, con la Pozione Mana è un attimo creare le Frecce Magiche.

source: You’re going to love how cool-looking and powerful Magic Arrows are. Give it a try.
it: Ti innamorerai di quanto fantastiche e potenti possano essere le Frecce Magiche. Fai una prova.

source: Tell Aaron you have crafted the Magic Arrows.
it: Dì ad Aaron che hai creato le Frecce Magiche.

source: That was fast! Not too shabby, Dragon Rider. Next we’ll make something to help protect your delicate bones.
it: Sei stato rapido! Niente male, Cavaliere di Draghi. Successivamente faremo qualcosa per aiutarti a proteggere le tue ossa delicate.

source: Get it? ... Bones? We’re gonna make a Bones Shield. It’s the latest in high grade calcium protection technology.
it: L'hai capita? Ossa? Stiamo per fare uno Scudo di Ossa. È l'ultima novità tecnologica in fatto di protezione ad alto contenuto di calcio.

source: With the Bones Shield, you’ll be able to deflect arrows, blunt attacks, and even take a meteor strike to the face! Okay, maybe not that last one. But it’s still pretty great! And it’s perfect timing, because there are a ton of skeletons trashing the caves near here. Kill them, collect their bones, and make the shield!
it: Con lo Scudo di Ossa, sarai in grado di schivare frecce, spuntare attacchi, e persino prendere un colpo di meteora in faccia! Okay, forse non quest'ultimo. Ma è comunque davvero fantastico! Ed ha un tempismo perfetto, perché ci sono tonnellate di scarti di scheletri nella caverna qui vicino. Ammazzali, raccogli i loro scheletri, e fai lo scudo!

source: Tell Aaron you have crafted the Bones Shield.
it: Dì ad Aaron che hai creato lo Scudo di Ossa.

source: Thank iron and steel those skeletons are gone. Er... I mean... I’m glad you have that Bones Shield now. Heh. Heheh.
it: Ringraziando il ferro e l'acciaio quei scheletri se ne sono andati. Ehm...voglio dire...sono contento che tu abbia questo Scudo di Ossa ora. Heh. Heheh.

source: They say the best defense is a good offense, so we better get you a new weapon, Dragon Rider. I have in mind a Great Sword, one that will smite any opponent. Here are the blueprints.
it: Dicono che la miglior difesa è un buon attacco, allora è meglio che tu abbia una nuova arma, Cavaliere di Draghi. Ho in mente una Grande Spada, una che possa distruggere qualsiasi nemico. Ecco i progetti.

source: Some say a sword is only as great as the one who wields it. Or in other words: swords don’t kill people, dudes with serious upper body strength kill people. Now smiter, get smiting!
it: Qualcuno dice che una spada è grande solo quanto chi la brandisce. O in altre parole:le spade non uccidono le persone, gli uomini con decisa forza nella parte superiore del corpo uccidono le persone. Ora distruttore, distruggi!

source: Tell Aaron you have crafted the Great Sword.
it: Dì ad Aaron che hai creato la Grande Spada.

source: Exceptional work, Dragon Rider. With that weapon, you’ll be able to deal with some of the more serious monster problems we have around here.
it: Lavoro eccezionale, Cavaliere di Draghi. Con questa arma, tu sarai in grado di affrontare alcuni dei più seri problemi di mostri che abbiamo qui intorno.

source: I expected the Dark Slashers to disperse once you thinned them out, but those bone heads are back, and in greater numbers! Take care of them for me, will you? The thought of them creeping about chills me to the – ugh, I don’t even want to say it!
it: Mi aspettavo che gli Accoltellatori Oscuri si fossero dispersi una volta che tu li avessi ridotti di numero, ma quelle teste d'osso sono tornati in tanti! Prenditi cura di loro per me, va bene? Il pensiero di loro che strisciano intorno mi raggela sino al —ugh, non lo voglio nemmeno dire!

source: You’re doing great work, Dragon Rider. Keep fighting those Dark Slashers!
it: Stai facendo un gran lavoro, Cavaliere di Draghi. Continua a combattere quegli Accoltellatori Oscuri!

source: Tell Aaron you have slain the Dark Slashers.
it: Dì ad Aaron che hai ucciso gli Accoltellatori Oscuri.

source: Hey! You did it! Looks like that sword did the trick.
it: Hey! Ce l'hai fatta! Sembra proprio che la spada abbia funzionato.

source: With the tools I’ve given you, I’m sure you’ll be able to take on any challenge. (Or at least, any challenge until you need even BIGGER weapons.) Go see Ted. He may need further assistance.
it: Con gli strumenti che ti ho dato, sono certo che sarai in grado di affrontare qualsiasi sfida. (O almeno, qualsiasi sfida fino a che non avrai bisogno di un'arma ancora più GRANDE.) Vai a vedere Ted. Può aver bisogno di ulteriore assistenza.

source: Your bravery will always inspire me, Dragon Rider. Go see Ted. He may need further assistance.
it: La tua audacia mi ispirerà sempre, Cavaliere di Draghi. Vai a vedere Ted. Può aver bisogno di ulteriore assistenza.

source: Speak to Ted about his current dilemma.
it: Parla con Ted a proposito del suo attuale dilemma.
