Repository: TheDark98/blockstory-translation
Catalog: translations/Wizard.po
Languages: it

source: It's time to try out that crafting table. Place it on the ground by pressing the right mouse button, and let's use it to craft a sword.
it: È il momento di provare il tavolo dei crafting. Mettilo a terra premendo il tasto destro del mouse, e usiamolo per creare una spada.

source: It's time to try out that crafting table. Place it on the ground by tapping on the block you wish to place it next to, and let's use it to craft a sword.
it: E' ora di provare questo tavolo da lavoro. Sistemalo per terra toccando il blocco che desideri porre vicino, e usiamolo per creare una spada.

source: Now you look like a proper warrior. Hmm . . . perhaps you can help me with my current dilemma.
it: Ora sembri un vero guerriero. Hmm...forse puoi aiutarmi con il mio attuale dilemma.
