Repository: TheDark98/blockstory-translation
Catalog: translations/Wizard.po
Languages: it

source: Baby Dragon
it: Baby Drago

source: I must confess, I have been testing you all this time. I had to know if you were capable of helping me. You see, dragons live in this mythical land. Have you ever spotted one? They are magnificent creatures.
it: Devo confessarlo, ti ho messo alla prova per tutto questo tempo. Dovevo sapere se eri in grado di aiutarmi. Vedi, i draghi vivono nelle terre mitiche. Ne hai mai individuato uno? Sono delle magnifiche creature.

source: Speak to the Wizard about his current dilemma.
it: Parla al Mago del suo attuale dilemma.

source: It appears your pet dragon was bitten by spiders, and I fear the worst. Please! Slay more of the eight-legged beasts, and bring back samples of their venom.
it: Sembra che il drago domestico fu morsicato dai ragni e temo dai peggiori. Per favore! ammazzane qualcuno di quelle bestie a otto zampe, e riporta un campione del loro veleno.

source: This land was once a land of dragons. Now, few remain. I can tell you more, but first, please, kill some spiders to retrieve samples of their venom.
it: Questa terra era una volta una terra di draghi. Ora ne restano pochi. Posso dirti di più, ma prima, per favore,ammazza qualche ragno per recuperare dei campioni del loro veleno.

source: Tell the Wizard you have collected the venom.
it: Dì al Mago che hai raccolto il veleno.

source: By the balrog's bones! You did it! I must consult my spellbooks to discern the extent of the damage, and it will take time to fabricate an antidote.
it: Per le ossa di Balrog! Ce l'hai fatta! Devo consultare i miei libri di incantesimi per capire l'estensione dei danni,e occorrerà del tempo per creare un antidoto.

source: While I'm occupied with brewing up the antidote, I have another errand for you. I received a request from Ted, a viking who lives near here. Please mine some iron and take it to him.
it: Mentre sono occupato con nel far bollire l'antidoto, ho un altra faccenda per te. Ho ricevuto una richiesta da Ted, un vichingo che vive qui vicino. Per favore estrai un po' di ferro e portaglielo.

source: Don't worry. I will find a cure for the sick dragon. Poor thing. You go. Help Ted.
it: Non ti preoccupare. Mi sto prendendo cura del nostro drago malato. Poverino. Vai. Aiuta Ted.

source: Gather some iron and take it to Ted.
it: Raduna un po' di ferro e prendilo per Ted.

source: I need more time to find the cure. I will send word to Ted when I need you again.
it: Ho bisogno di più tempo per trovare una cura. Manderò una parola a Ted quando avrò bisogno di te di nuovo.

source: Help Ted while you wait for the Wizard to discover the antidote for the Baby Dragon.
it: Aiuta Ted mentre aspetti che il Mago per scopra l'antidote per il Baby Drago.

source: Welcome back. I have news of our firebreathing friend. I have devised an antivenom, but I am missing some key ingredients. You must find them for me, or this dragon will surely perish.
it: Ben tornato.Ho notizie del nostro amico mangiafuoco. Ho concepito un antidoto, ma sto trascurando qualche ingrediente chiave. Devi trovarlo per me, o questo drago perirà sicuramente.

source: Talk to the Wizard about his progress on finding a cure for the Baby Dragon.
it: Parla al Mago sul suo progresso nel trovare una cura per Baby Drago.

source: Sulfur is the first ingredient and has many uses. You can use it to craft gun powder and other useful items. Its odor is pungent and recognizable. Many think it smells like rotten eggs. Bring me some sulfur and then speak to me about the next ingredient we will need.
it: Il solfuro è il primo ingrediente ed ha molti utilizzi. Lo puoi usare per lavorare la polvere da sparo ed altri utili strumenti. Il suo odore è pungente e riconoscibile. Molti pensano che puzzi come delle uova marce.Portami un po' di solfuro e poi parlami del prossimo ingrediente di cui avremo bisogno.

source: Bring the Wizard the sulfur you collected.
it: Porta al Mago il solfuro che hai trovato.

source: Good work. That takes care of the first ingredient. But there is still more work to do.
it: Buon lavoro. Questo si prende cura del primo ingrediente. Ma c'è ancora molto lavoro da fare.

source: The potions we need for the antivenom can be found by talking to the Alchemist. But be careful. Some say he is a thief in disguise.
it: Le pozioni di cui abbiamo bisogno per l'antidoto possono essere trovate parlando con l'Alchimista. Ma sta attento, Qualcuno dice che è un ladro mascherato.

source: The Alchemist has always left me with a strange, suspicious feeling. You'd best be cautious.
it: L'Alchimista mi ha sempre lasciato con una strana e sospettosa sensazione. Faresti meglio ad essere cauto.

source: Ask the Alchemist to help find a cure for the baby dragon.
it: Chiedi all'Alchimista di aiutarti a trovare una cura per il baby drago.

source: I hope your progress is swift. This dragon does not have much time.
it: Spero che i tuoi progressi siano veloci. Questo drago non ha molto tempo.

source: Learn how to craft the potions required to save the baby dragon.
it: Impara a creare le pozioni richieste per salvare il baby drago.

source: We will need those potions before we can heal the dragon.
it: Avremo bisogno di quelle pozioni prima di poter guarire il drago.

source: Bring the potions to the Wizard.
it: Porta le pozioni al Mago.

source: You have the potions. Good. Give them here. Believe it or not, the final item we require will be even more challenging to get.
it: Hai le pozioni. Bene. Dammele qui. Credici o no, l'elemento finale di cui abbiamo bisogno è ancora più arduo da avere.

source: Sharks are plentiful in the waters nearby. But they are also dangerous. Normally I wouldn't ask you take such risks, but it must be done if we are to save the dragon. Sharkfin Soup has restorative properties. We need some for the antivenom.
it: Gli squali sono abbondanti nelle acque vicino. Ma sono anche pericolosi. Di solito non ti chiederei di prendere tali rischi, ma deve ssere fatto se vogliamo salvare il drago. La zuppa di squalo ha delle proprietà ricostituenti. Ne abbiamo bisogno per l'antidoto.

source: Did you know sharks are some of the oldest animals in existence? They're quite remarkable creatures. But whether you think they are majestic or predators, they will die by your sword all the same.
it: Lo sapevi che gli squali sono alcuni degli animali più vecchi che esistano? Sono davvero delle creature rimarchevoli. Ma sia che li ritieni maestosi o predatori, moriranno lo stesso con la tua spada.

source: Bring the Wizard the Sharkfin Soup you brewed.
it: Porta la Zuppa di Squalo che hai preparato.

source: Glad to see you're back in one piece.
it: Felice di vedere che sei tornato tutto intero.

source: Now to combine the ingredients and administer the treatment. . . . It worked! The dragon seems to be coming around. Look! His eyes are clear. This is wonderful. And it's all thanks to you.
it: Ora per combinare gli ingredienti e somminstrare il trattamento... Ha funzionato! Il drago sembra avvicinarsi, Guarda! I suoi occhi sono chiari. Ciò è meraviglioso. E tutto grazie a te.

source: Dragon Lord
it: Signore Drago

source: I have a confession to make. My motivations to help you, and to train you, have not been entirely altruistic. Will you listen to this old man's tale of the Dragon Lord?
it: Ho una confessione da farti. Le mie motivazioni per aiutarti, e per addestrarti, non sono state interamente altruistiche. Ascolterai da questo vecchio il racconto del Signore Drago?

source: Then perhaps you are not the hero I had hoped for.
it: Allora forse non sei l'eroe che io speravo.

source: The Dragon Lord is a wicked sorcerer who has plagued this land for many years. He commands three terrible monsters: the Ice Dragon, the Fire Dragon, and the Bolt Dragon. These dragons have been known to burn fields and raze whole villages. They must be stopped. But until now, until you, there has been no one to stand up to the Dragon Lord. It is said that only another dragon rider of equal power stands a chance of defeating the Dragon Lord. Will you become a dragon rider and defeat the Dragon Lord?
it: Il Lord Dragon è uno stregone malvagio che ha infestato questa terra per molti anni. Comanda tre mostri terribili - il Drago di Ghiaccio, il Drago di Fuoco e il Drago Fulmine. Questi draghi sono conosciuti per bruciare i campi e per radere al suolo interi villaggi. Devono essere fermati. Ma sino ad ora, a parte te, non c'è stato nessuno per resistere al Signore Drago. Si dice che solamente un altro cavaliere di drago di forza uguale può avere la possibilità di sconfiggere il Signore Drago. Diventerai un cavaliere di drago e sconfiggerai il Signore Drago?

source: I knew my faith in you was well founded, my friend. Take good care of the baby dragon.
it: Sapevo che la mia fiducia in te era ben fondata, amico mio. Prenditi buona cura del baby drago.

source: Your dragon will need to be much stronger if you hope to take on the Dragon Lord. There is an animal trainer, Paula, who lives near here. Find her, and continue your training.
it: Il tuo drago avrà bisogno di essere molto più forte se speri di poter sfidare il Signore Drago. C'è un addestratrice di animali, Paula, che vive qui vicino. Trovala e continua il tuo addestramento.

source: Paula has lost much to the Dragon Lord's wrath. She will help you if you ask.
it: Paula ha perso molto a causa della collera del Signore Drago. Lei ti aiuterà se lo chiederai.

source: Ask Paula to help train the Baby Dragon.
it: Chiedi a Paula di aiutarti ad addestrare Baby Drago.

source: How goes the training? I will continue to meditate on your success.
it: Come va l'addestramento? Continuerò a meditare sul tuo successo.

source: Complete the Baby Dragon's training with Paula.
it: Completa l'addestramento di Baby Drago con Paula.

source: Welcome back. And my! Look how that dragon has grown.
it: Ben tornato. E caspita! Guarda come è cresciuto il drago.

source: Tell the Wizard you have completed the Dragon's training.
it: Dì al Mago che hai completato l'addestramento del Drago.

source: Your skills are improving, Dragon Rider, but there is still much to learn. To defeat the Dragon Lord, you must defeat and capture all three of his dragons. The first dragon is the Ice Dragon. You will need armor to protect yourself from his freezing breath. Talk to the warrior, Aaron, about making armor.
it: Le tue capacità stanno migliorando, Dragon Rider, ma c'è ancora molto da imparare. Per sconfiggere Lord Dragon devi sconfiggere e catturare tre dei suoi draghi. Il primo drago è il Drago di Ferro. Avrai bisogno dell'armatura per proteggere te stesso dal suo respiro raggelante. Parla al guerriero, Aaron, su come fare l'armatura.

source: Be careful how you speak to Aaron. Let's just say he's not the most optimistic individual.
it: Sii prudente su come parli ad Aaron. Diciamo solo che non è l'individuo più ottimista che ci sia.

source: Learn how to make armor from Aaron.
it: Impara come fare l'armatura da Aaron.

source: You have the armor. Good. But the Ice Dragon is resilient. You will need a weapon that can pierce his defenses. This is the next step.
it: Ora hai l'armatura. Bene. Ma il Drago di Ghiaccio è resiliente. Avrai bisogno di un'arma che possa penetrare le sue difese. Questa è la prossima tappa.

source: Tell the Wizard you have learned how to craft armor from Aaron.
it: Dì al Mago che hai imparato come lavorare un' armatura da Aaron.

source: To defeat the Ice Dragon, you will need to master the magic of Fire. That is the Ice Dragon's weakness. Magic is contained inside special wands, much like the wand you use to command your dragon. Your next task will be to craft a Fire Magic Wand.
it: Per sconfiggere il Drago di Ghiaccio, avrai bisogno di padroneggiare la magia del Fuoco. Questa è la debolezza del Drago di Ghiaccio. La Magia contenuta dentro speciali bacchette magiche, molto simili alla bacchetta magica che tu usi per comandare il tuo drago. Il tuo prossimo compito sarà di creare una bacchetta Magica di Fuoco.

source: It may seem like a lot of hocus pocus, but a sword is nothing compared to the power of the arcane. You must craft a Fire Magic Wand to stand a chance against the Ice Dragon.
it: Può sembrare un sacco di Hocus Pocus, ma la spada non è niente in confronto alla potenza del arcano. È necessario predisporre una bacchetta magica di fuoco per avere una possibilità contro il Drago di Ghiaccio.

source: Tell the Wizard you have the power to cast Fire Magic.
it: Dì al Mago che hai il potere di preparare il Fuoco Magico.

source: Dragon Rider, you continue to amaze these old eyes. Are you a wizard now too? The Dragon Lord will quake when he sees you coming.
it: Cavaliere di Drago, tu continui a stupire questi vecchi occhi. Sei anche un mago adesso? Il Signore Drago tremerà quando ti vedrà arrivare.

source: In good conscience I cannot allow you to face the dragon without first practicing with your Fire Magic. Go to the frozen thundra with the pine trees. Test your wands on the Ice Elementals that come out at night there. If you run out of magic, make more wands. If you need more mana, craft a potion. Good luck, Dragon Rider. Be careful.
it: In buona coscienza non posso permetterti di affrontare il drago senza aver praticato prima la tua Magia del Fuoco. Vai nella tundra gelata di pini. Prova la tua bacchetta sugli Elementi di Ghiaccio che escono laggiù nella notte. Se termini la magia, crea più bacchette magiche. Se hai bisogno di più Mana, crea una pozione. Buona fortuna, Cavliere di Drago. Sii prudente.

source: The Ice Elementals, like the projectiles from your wands, are manifestations of magical power. But Fire Magic is the Ice Elemental's opposite. You should make short work of them!
it: Gli Elementi di Ghiaccio, come i proiettili dalle tue bacchette magiche, sono manifestazioni di potere magico. Ma il Fuoco Magico è l' opposto dell'Elemento di Ghiaccio. Dovresti lavorarci poco con queste!

source: Tell the Wizard you have slain the Ice Elemental.
it: Dì al Mago che hai abbattuto l'Elemento di Ghiaccio.

source: With the completion of this task, I believe you are finally ready to face the Ice Dragon.
it: Con il completamento di questo compito, credo che tu sia finalmente pronto per fronteggiare il Drago di Ghiaccio.

source: Your battle with the Ice Dragon is nigh, Dragon Rider. Are you prepared to face your greatest challenge yet?
it: La tua battaglia con il Drago di Ghiaccio è importante. Sei preparato ad affrontare la tua più grande sfida sino ad ora?

source: Tell the Wizard you are ready to face the Ice Dragon.
it: Dì al Mago che sei pronto per affrontare il Drago di Ghiaccio.

source: Take all the time you need to get ready.
it: Prenditi tutto il tempo che ti serve per essere pronto.

source: The Ice Dragon has frozen entire farms in the middle of summer. The unseasonable cold was devastating. Mass starvation set in. I remember these dark times well. I do not wish to burden you with more sorrowful tales. Needless to say, the people of this land hold you in their hearts this day.
it: Il Drago di Ghiaccio aveva gelato l'intera fattoria nel mezzo dell'Estate. Il freddo fuori stagione era stato devastante. Si era scatenata una carestia di massa. Ricordo bene questi tempi oscuri. Non desidero farti carico di nuovi tristi racconti. Inutile dire che la gente di questa terra ti tiene nei propri cuori in questo giorno.

source: I require the soul of the Ice Dragon, so you will need to craft a Soul Catcher to contain its essence. The Ice Dragon is quite powerful. You may need to smack it around a bit to make it easier to contain.
it: Richiedo l'anima del Drago di Ghiaccio, così avrai bisogno di creare un Cacciatore di Anime per contenere la sua essenza. Il Drago di Ghiaccio è veramente potente. Potrai avere bisogno di colpirlo un po' per rendere più facile contenerlo.

source: Tell the Wizard you have captured the Ice Dragon.
it: Dì al Mago che hai catturato il Drago di Ghiaccio.

source: The Dragon Rider returns triumphant! Quick, give me the Ice Dragon. Excellent. I will take care of this monster. As for you, bask in your victory. But not for too long. There are more dragons to hunt, and greater battles. Until then, remember, the world belongs to those who shape it.
it: Il Dragon Rider ritorna trionfante! Svelto, dammi il Drago di Ghiaccio. Eccellente. Mi prenderò cura di questo mostro.Quanto a te, crogiolati nella tua vittoria. Ma non troppo a lungo. Ci sono più draghi da cacciare e battaglie ancor più grandi. Sino ad allora, ricorda, il mondo appartiene a coloro che lo formano.

source: Do you feel the power radiating through you? The magic of the ice dragon has imbued you with its energy. Yes... I feel it. An old spell is coming back to me.
it: Sentiil potere irradiare attraverso te? La magia del Drago di Ghiaccio ti pervade con la sua energia. Sì...lo sento. Una vecchia formula mi sta tornando indietro.

source: Once you find the stones, binding them to the staff will create a powerful magical effect.
it: Una volta che trovi le pietre, con il legarle al bastone creerai un effetto magico potente.

source: Tell the Wizard you have the power to cast Life Magic.
it: Dì al Mago che hai il potere di assegnare la Vita Magica.

source: Now you see the power these dragons possess. The wisdom. But there is much more to do, and so little time.
it: Ora vedi il potere che questi draghi possiedono. La saggezza. Ma c'è ancora molto da fare, e così poco tempo.

source: I must continue to reflect on the power of the dragons. While I meditate, you should check on Ted to see if he requires any assistance.
it: Devo continuare a riflettere sul potere dei draghi. Mentre medito, tu dovresti controllare se Ted ha bisogno di qualche assistenza.

source: Speak with Ted about any assistance he may require.
it: Parla con Ted a proposito di qualsiasi assistenza possa aver bisogno.

source: Now how did that old spell go? Bibbity bob-bama? Banana-nana—no, no, no, that’s not it.
it: Adesso com'era la vecchia formula? Bibbity bob-bama? Banana-nana—no, no, no, non era questa.

source: Wait for the Wizard to complete his meditation.
it: Aspetta che il Mago completi la sua meditazione.

source: BLAH! ~~ Dragon Rider. Listen carefully to my voice. I have possessed this foul creature in hope of reaching you. Rendezvous with my corporeal form. There is much to do.
it: BLAH! ~~ Cavaliere di Drago. Ascolta attentamente la mia voce. Ho posseduto questa folle creatura nella speranza di trovarti. Appuntamento con la mia forma corporale. C'è molto da fare.

source: Speak to the Wizard about the next task.
it: Parla al Mago del prossimo compito.

source: You are late. It is time to face your next great challenge.
it: Sei in ritardo. E' tempo di fronteggiare la tua prossima grande sfida.

source: From the depths of hell came the roar of the Fire Dragon. The earth shook. The seas boiled. The sky turned the color of blood. Are you ready to begin your quest?
it: Dalle profondità dell'inferno arrivò il ruggito del Drago di Fuoco. La terra tremò. I mari bollirono. Il cielo cambiò nel colore del sangue. Sei pronto ad iniziare la tua ricerca?

source: Tell the Wizard you are ready to face the Fire Dragon.
it: Dì al Mago che sei pronto per affrontare il Drago di Fuoco.

source: I grow weary of your indecisiveness, Dragon Rider.
it: Sono stanco della tua indecisione, Cavaliere di Drago.

source: To begin, you will need a way to cross the sea. Speak to Ted. He will help you.
it: Per iniziare, avrai bisogno di un modo per attraversare il mare. Parla con Ted. Ti aiuterà.

source: Speak to Ted to learn how to cross the sea.
it: Parla con Ted per imparare come attraversare il mare.

source: While you’ve been running errands, I have been honing my power.
it: Mentre tu stavi svolgendo le faccende, io stavo affinando il mio potere.

source: Learn how to sail the seas from Ted.
it: Impara come navigare i mari da Ted.

source: You’re late. Now, come closer. I have a mission for you.
it: Sei in ritardo. Ora, vieni più vicino. Ho una missione per te.

source: Speak to the Wizard to prepare for the Fire Dragon.
it: Parla al Mago per prepararti per il Drago di Fuoco.

source: The Fire Dragon has great power. He can breathe the fire of life into the already deceased. He has raised an army of Dark Knights and Dark Mages who patrol the depths of the Underworld. You must take the fight to these minions if you hope to capture the Fire Dragon.
it: Il Drago di Fuoco ha un grande potere. Può respirare il fuoco della vita nel già defunto. Ha sollevato un eserciti di Cavalieri Oscuri ed Oscuri Maghi che controllano le profondità del Mondo Sotterraneo. Devi lottare contro questi servi se speri di catturare il Drago di Fuoco.

source: Hurry, Dragon Rider. Use your weapons to remind these Dark Knights and Dark Mages that they are supposed to be dead.
it: Svelot Cavaliere di Drago. Usa le tue armi per ricordare a questi Oscuri Cavalieri ed ai Oscuri Maghi che loro dovrebbero essere morti.

source: Tell the Wizard you have slain the undead minions.
it: Dì al Mago che hai ucciso quei servi non morti.

source: Sickening. I can smell the stench of death on you. But at least you were effective.
it: Nauseante. Posso sentire il fetore di morte su di te. Ma almeno tu sei stato efficace.

source: The Fire Dragon’s Dark Boss is a brutal taskmaster. Return to the dragon’s domain and destroy this monster.
it: Il Boss Oscuro del Drago di Fuoco è un brutale caposquadra. Ritorna nel dominio del drago e distruggi questo mostro.

source: They say Dark Boss buries his victims deep underground without a pickaxe and no way out, trapping them forever.
it: Dicono che l'Oscuro Boss seppellisca le sue vittime nel profondo sottosuolo senza un piccone, e naturalmente, intrappolandole per sempre.

source: Tell the Wizard you have slain the Dark BOSS.
it: Dì al Mago che hai ucciso l'Oscuro Boss.

source: You have become a skilled killer, Dragon Rider. You bring such death, and yet you never hesitate.
it: Sei diventato un killer qualificato, Cavaliere di Drago. Porti una tale morte, e tuttavia non esiti mai.

source: No more games. The time to face the Fire Dragon has come. It will take all your strength and skill to vanquish him. Remember! Bring me the Fire Dragon’s spawner once he is defeated. Now go.
it: Non più giochi. Il tempo per affrontare il Drago di Fuoco è arrivato. Ti servirà tutta la tua forza e abilità per sconfiggerlo. Ricorda! Portami la produttrice del Drago di Fuoco una volta che è stato sconfitto. Ora vai.

source: Do not fail me, Dragon Rider. You are the only one who can defeat the Fire Dragon.
it: Non deludermi, Cavaliere di Drago. Tu sei l'unico che può sconfiggere il Drago di Fuoco.

source: Tell the Wizard you have captured the Fire Dragon.
it: Dì al Mago che hai catturato il Drago di Fuoco.

source: Yes, at last! At long last. Give me the Fire Dragon Spawner. I will put it to good use.
it: Sì alla fine! Una lunga fine. Dammi la produttrice di uova del Drago di Fuoco. La metterò in un buon uso.

source: The dragon you slew was filled with power. The magical knowledge I once had is returning to me now. Let me teach you something I have recalled.
it: Il drago che hai ucciso era pieno di potere. La conoscenza magica che una volta avevo sta ora ritornandomi. Lasciami insegnarti qualcosa che ho ricordato.

source: You can imbue a staff with the Spikes Magic. Do it, and you will wield phenomenal power.
it: Puoi tingere un bastone con le Punte Magiche. Fallo, e brandirai un potere fenomenale.

source: Tell the Wizard you have crafted the Spikes Magic.
it: Dì al Mago che hai creato le Punte Magiche.

source: A simple task I never doubted you would accomplish. Now, for the next phase of your journey.
it: Un compito semplice che non mai dubitato eri in grado di portare a termine. Adesso, la prossima fase del tuo viaggio.
