Repository: TheDark98/blockstory-translation
Catalog: translations/Wizard.po
Languages: it

source: The final dragon, the Bolt Dragon, Ashkore, awaits. But you will not last three seconds in that monster’s presence without more suitable equipment. Speak to Aaron, that mewling coward may be able to help you.
it: L'ultimo drago, il Drago Fulmine, Ashkore, ti attende.Ma non durerai nemmeno tre secondi senza un equipaggiamento più adatto. Parla con Aaron, quel codardo miagolante può essere in grado di aiutarti.

source: Speak to Aaron, Dragon Rider. You must learn how to vanquish the Bolt Dragon, Ashkore.
it: Parla con Aaron, Cavaliere di Drago. Devi imparare come sconfiggere il Drago Fulmine, Ashkore.

source: Speak to Aaron to learn how to craft better equipment.
it: Parla con Aaron per imparare a creare un migliore equipaggiamento.

source: Work quickly, Dragon Rider. You must vanquish the Bolt Dragon, Ashkore.
it: Lavora velocemente, Cavaliere di Drago. Devi sconfiggere il Drago Fulmine, Ashkore.

source: Learn how to craft better equipment from Aaron.
it: Impara come creare un migliore equipaggiamento da Aaron.

source: Hello. During your absence, I have been meditating on Ashkore’s powers.
it: Salve. Durante la tua assenza, sono stato a meditare sui poteri di Ashkore.

source: Ashkore resides in the Sky World high above this land. Your dragon will need to be strong if you hope to fly there. Perhaps that pet trainer, Paula, can help you.
it: Askore risiede nel Mondo del Cielo in alto sopra a questa terra. Il tuo drago ha bisogno di essere forte se speri di farlo volare lassù. Forse l'addestratrice di animali, Paula, può aiutarti.

source: Speak to Paula to learn how to ride your dragon.
it: Parla con Paula per imparare a cavalcare il tuo drago.

source: Speak to me again when your dragon has grown stronger.
it: Parla ancora con me quando il tuo drago sarà cresciuto più forte.

source: Learn how to ride the dragon from Paula.
it: Impara come cavalcare il drago da Paula..

source: You continue to amaze me, Dragon Rider. Now you are ready to take to skies.
it: Tu continui a stupirmi, Cavaliere di Drago. Ora sei pronto per salire nei cieli.

source: We are nearly finished. Ohhhh...the old bones can FEEL it. Now go! Head to the Sky World and weaken Ashkore’s defenses.
it: Abbiamo quasi finito. Ohhhh...posso SENTIRE queste vecchie ossa. Ora vai! Dirigiti verso il Mondo del Cielo e indebolisci le difese di Ashkore.

source: Ashkore is the strongest of the Dragon Lord’s terrible brood. His land is the hardest to get to, his minions the most vicious, his breath the most deadly. Even a skilled dragon slayer like you could perish.
it: Ashkore è il più forte della terribile covata del Signore Drago. La sua terra è la più dura da avere, i suoi servi i più maligni, il suo respiro il più mortale. Persino un abile uccisore di draghi come te può perire.

source: Tell the Wizard you have slain the eagles.
it: Dì al Mago che hai ucciso le aquile.

source: Wipe your blade clean, and ready your spells. There is more work to be done.
it: Pulisci la tua lama, e sta pronto con i tuoi incantesimi. C'è ancora altro lavoro da fare.

source: What are you waiting for? Eliminate the last of Ashkore’s monsters so you can capture him! Go! I grow tired of this dawdling.
it: Cosa stai aspettando? Elimina l'ultimo dei mostri di Ashkore così puoi catturarlo! Vai! Mi sto stancando di questo oziare.

source: If I come across as curt with you, it is only because we are so close to the end. You trust me, of course.
it: Se divento brusco con te, è solo perché siamo così vicini alla fine. Credimi, naturalmente.

source: Tell the Wizard you have slain the visitors.
it: Dì al Mago che hai ucciso quei visitatori.

source: The way is clear. Are you ready for the final step?
it: La via è libera. Sei pronto per il passo finale?

source: Ashkore creates great storms with its power, terrorizing people from his palace in the clouds. The Dragon Lord made good use of that power when he tightened his grip on this land. It could happen again. Capture Ashkore for me.
it: Ashkore crea grandi tempeste con i suoi poteri, terrorizzando le persone dal suo palazzo tra le nubi. Il Signore Drago ha fatto un buon uso di quel potere quando ha stretto la sua morsa su questa terra. Potrebbe accadere ancora. Cattura Ashkore per me.

source: The power. So much power. I feel it! Capture Ashkore for me.
it: Il potere. Così tanto potere. Lo sento. Cattura Ashkore per me.

source: Tell the Wizard you have captured Ashkore.
it: Dì al Mago che hai catturato Ashkore.

source: At last! YES! At long last! I have the dragons. You fool!
it: Alla fine! SI! Una lunga fine! Ho i draghi. Tu scemo!

source: My dragons abandoned me, but you brought them back. Yes, you, my stupid little pawn. Now, with fire, ice, and lightning, you will see the true power of the Dragon Lord!
it: I miei draghi mi abbandonarono, ma tu me li hai riportati indietro. Sì, tu, mia stupida piccola pedina. Ora, con il fuoco, il ghiaccio, e il lampo, tu vedrai il vero potere del Signore Drago!

source: Speak to Paula about the Wizard's betrayal.
it: Parla con Paula del tradimento del Mago.

source: Dragon Master
it: Maestro Drago

source: As you may have seen, when our golden star takes its slumber below the horizon, dangerous monsters roam the countryside. Pretty scary!
it: Come puoi aver visto, quando la nostra stella dorata prende il sonno sotto l'orizzonte, pericolosi mostri vagano per la campagna. Davvero spaventosi!

source: Tell the Wizard you have opened the Recipe Book.
it: Racconta al Mago che hai aperto il Libro delle Ricette.

source: There are other dangers too. It gets dark. You might walk into something and bump your head! To counteract this problem (I call it Headbumpitis) you can use torches or candles to light your way.
it: Ci sono anche altri pericoli. Si fa buio. Potresti camminare in qualcosa e colpire la tua testa! Per cosntrastare questo problema (io lo chiamo bottallatestite) puoi usare torce o candele per illuminare la tua strada.

source: But that will not be your biggest concern. You see. I have a baby dragon that I can't give the proper care. There are too many spiders in the areas I like to travel to gather ingredients, and I fear this may become problematic in the future. Kill some cave dwelling spiders and you will have my blessing to care for the baby dragon.
it: Ma questa non sarà la tua preoccupazione più grande. Vedi. Io ho un baby drago al quale non posso dare l'attenzione più appropriata. Ci sono troppi ragni nella zona dove mi piace viaggiare per radunare gli ingredienti, e temo che questo possa diventare problematico nel futuro. Uccidi qualche ragno ospite della caverna e avrai la mia benedizione per occuparti del baby drago.

source: If you kill some cave dwelling spiders, you will have my blessing to care for the baby dragon.
it: Se uccidi qualche ragno ospite della caverna, avrai la mia benedizione per occuparti del baby drago.

source: Tell the Wizard you have slain the spiders.
it: Dì al Mago che hai ucciso quei mostri. Come promesso, ecco le candele.

source: Thank you for your help with those monsters. Take good care of the baby dragon. It will need your utmost attention.
it: Grazie per il tuo aiuto per quei mostri. Prenditi buona cura del baby drago. Occorrerà la tua estrema attenzione.

source: It appears the baby dragon is hungry. It can't fight monsters at full strength without being fed. Kill some of the local wildlife for meat, and be sure to search for some apples too. It would be a shame for the dragon to be hungry before you run off adventuring.
it: Sembra che il baby drago sia affamato, Non può combattere mostri a piena forza, senza essere nutrito. Uccidi qualche animale per la carne, e assicurati di cercare anche qualche mela. Sarebbe una vergogna per il drago essere affamato prima di andare a caccia di avventure.

source: Tell the Wizard you have fed the Baby Dragon.
it: Dì al Mago che hai dato da mangiare al Baby Drago.

source: Some say the Dragon Lord has a telepathic connection with his dragons. That a piece of his soul is in each of them. It appears you and your dragon make a good team as well. This plan may work after all. But there is much more to do.
it: Qualcuno dice che il Signore Drago sia in collegamento telepatico con i suoi draghi. Che una parte delle sua anima sia in ciascuno di loro. Sembra che anche tu ed il tuo drago facciate una bella squadra. Questo piano può funzionare, dopo tutto. Ma c'è ancora molto da fare.

source: Final Battle Dialog
it: Dialogo della Battaglia Finale

source: Well, well, well. Our foolish peon has returned. Have you come to admit defeat?
it: Bene, bene, bene. Il nostro sciocco manovale è tornato. Sei venuto ad ammettere la sconfitta?

source: We’re not so different, you and I. We both have the strength and the guts to harness the power of dragons. And think of all those beings you’ve killed. You’re a murderer too, Dragon Rider. Just like me. Join me, and we will destroy this world together, then move on to others.
it: Non siamo così diversi, tu ed io. Abbiamo entrambi la forza e il fegato per imbrigliare il potere dei draghi. E pensare a tutte quelle creature che hai ucciso. Sei anche tu un assassino, Cavaliere di Drago. Proprio come me. Unisciti a me, e distruggeremo insieme questo mondo, poi ci sposteremo verso gli altri.

source: MWA HA HA! Still so naïve and stupid. Why would I ever share my power with you?
it: MWA HA HA! Ancora così ingenuo e stupido. Perché mai dovrei condividere il mio potere con te?

source: No? THEN DIE!
it: No? ALLORA MUORI!

source: You may have defeated me, but I would enjoy a rematch if you are up to it, Dragon Rider.
it: Puoi avermi sconfitto, ma vorrei gustarmi una rivincita se sei all'altezza, Cavaliere di Drago.

source: Speak to me again if you are serious about our rematch, Dragon Rider.
it: Parlami ancora se sei serio sulla nostra rivincita, Cavaliere di Drago.

source: MWA HA HA! DIE!!!
it: MWA HA HA! MUORI!!

source: Mining Master
it: Maestro della Miniera

source: You must not only survive in this world. You must command it! With the resources you gather, you can build shelter, a castle, perhaps even a whole city! You will need to learn how to craft special tools to help gather resources faster. Let's get started.
it: Tu non solo devi sopravvivere in questo mondo. Devi anche comandarlo! Con le risorse che raduni, puoi costruire un rifugio, un castello, forse persino un'intera città! Avrai bisogno di imparare come creare strumenti speciali per radunare più velocemente le risorse. Iniziamo.

source: The pick axe works best when digging through stone or mining materials. Craft a pick axe and test it out.
it: La piccozza lavora meglio quando si scava attraverso la pietra o estraendo i materiali. Crea una piccozza e provala.

source: Tell the Wizard you have a pick axe.
it: Dì al Mago che hai una piccozza.

source: Now that you have the pick axe, we can move on to the next digging tool.
it: Ora che hai la piccozza, possiamo passare al prossimo arnese di scavo.

source: The next tool available is the axe. Axes work best on trees and the various plant life. Craft an axe and test it out.
it: Il prossimo arnese disponibile è l'ascia. Le asce lavorano meglio con gli alberi e la varia flora. Crea un' ascia e provala.

source: Tell the Wizard you have an axe.
it: Dì al Mago che hai un'ascia.

source: Now that you have the axe, we can move on to the next digging tool.
it: Ora che hai un'ascia, possiamo passare al prossimo arnese per scavare.

source: The next tool available is the hammer. Hammers work best on stone objects and generally well on anything. Craft a hammer and test it out.
it: Il prossimo arnese disponibile è il martello. I martelli lavorano meglio su oggetti di pietra e generalmente bene su ogni altra cosa. Crea un martello e provalo.

source: Tell the Wizard you have a hammer.
it: Dì al Mago che hai un martello.

source: Now that you have the hammer, we can move on to the next digging tool.
it: Ora che hai un martello, possiamo passare al prossimo attrezzo per scavare.

source: The last tool available is the shovel. Shovels work best on dirt and sand. Craft a shovel and test it out.
it: L'ultimo attrezzo disponibile è la pala. Le pale lavorano meglio sullo sterrato e la sabbia. Crea una pala e provala.

source: Tell the Wizard you have a shovel.
it: Dì al Mago che hai una pala.

source: Now that you have a shovel, you possess all the tools necessary to dig with efficiency.
it: Ora che hai una pala, possiedi tutti gli strumenti necessari per scavare efficientemente.

source: Wonderful! Simply wonderful. I gathered a few goodies to help you settle in. Now, if you're not too busy, I have a problem I could really use your help with.
it: Meraviglioso. Semplicemente meraviglioso. Ho messo insieme un po' di caramelle per farti stare bene. Ora, se non sei troppo affaccendato, io ho un problema con il quale potrei usare realmente il tuo aiuto.

source: That crafting table you built has many uses. With it, you can forge powerful weapons, construct magnificent contraptions, perhaps even tap into the arcane power of MAGIC!
it: Quel tavolo da lavoro che hai costruito ha molti utilizzi. Con esso, puoi forgiare armi potenti, costruire magnifici marchingegni, forse persino toccare l'arcano potere della MAGIA!

source: Tell the Wizard you have crafted a sword.
it: Dì al Mago che hai lavorato una spada.

source: But first thing's first. Instructions for how to craft various items can be found in the Recipe Book. Go ahead. Open your inventory and open the Recipe Book in the lower left hand corner.
it: Ma prima le cose più importanti. Le istruzioni per come lavorare vari elementi possono essere trovate nel Libro delle Ricette. Vai avanti, apri il tuo inventario e apri il Libro delle Ricette in basso a sinistra.

source: What's the matter? Never opened a book before? I guess you're more a warrior than a scholarly type, but still! Click on your inventory and open the Recipe Book in the lower left hand corner.
it: Cosa succede? Mai aperto un libro prima? Presumo che tu sia più un guerriero che il tipo studioso, ma fermo! Clicca sul tuo inventario ed apri il LIbro delle Ricette in basso a sinistra.

source: Open the Recipe Book within your Inventory.
it: Apri il LIbro delle Ricette nel tuo inventario.

source: Open Inventory
it: Apri l'inventario

source: There. That wasn't so hard, was it? Now you can do some serious crafting.
it: Ecco. Non è stato molto difficile, vero? Ora puoi fare qualche seria lavorazione.

source: You there! Young one! Are you all right? Looks like you took a nasty spill. I think it best you move around a bit; make sure nothing's broken.
it: Tu laggiù! Giovanotto! Stai bene? Sembra proprio che tu abbia avuto una brutta caduta. Penso che sia meglio per te muoverti un po' -per essere certi che tu non abbia niente di rotto.

source: Go on! Count your fingers. Wiggle your toes. I'll be here when you get back.
it: Continua! Conta le tue dita. Smuovi le punte dei piedi. Sarò qui quando ti sarai ripreso.

source: Follow the instructions to learn how to move around.
it: Segui le istruzioni per imparare come muoversi intorno.

source: Look Around
it: Guardati intorno

source: Walk
it: Cammina

source: Jump
it: Salta

source: Space
it: Spazio

source: Tell the Wizard nothing is broken by pressing R2 while targeting him.
it: Dì al mago che non c'è niente di rotto premendo R2 mentre lo prendi di mira.

source: Open Quest Log
it: Apri il diario della ricerca

source: Tell the Wizard nothing is broken by clicking on him.
it: Dì al Mago che non c'è niente di rotto cliccando su di lui.

source: Tell the Wizard nothing is broken by pressing down on him.
it: Dì al Mago che non c'è niente di rotto premendo in basso su di lui.

source: Glad to see you're all in one piece.
it: Contento di vedere che sei tutto intero.

source: You need to learn how to dig. Hold down R2 on a block to break it. This is the best way to dig holes, burrow tunnels, and generally alter your surroundings.
it: Hai bisogno di imparare come scavare. Tieni premuto R2 su un blocco per romperl Questo è il miglior modo per scavare buchi, fare tunnel, e generalmente alterare quello che ti circonda.

source: Hold down R2 on a block to break it.
it: Tieni premuto R2 su un blocco per lavorarci.

source: You need to learn how to dig. Hold down the left mouse button on a block to break it. This is the best way to dig holes, burrow tunnels, and generally alter your surroundings.
it: Devi imparare a scavare. Tieni premuto il tasto sinistro del mouse su un blocco per romperlo. Questo è il modo migliore per scavare buche, scavare tunnel, e modificare l'ambiente circostante.

source: Hold down the left mouse button on a block to break it.
it: Tieni premuto il tasto sinistro del mouse su un blocco per romperlo.

source: You need to learn how to dig. Press down on a block to break it. This is the best way to dig holes, burrow tunnels, and generally alter your surroundings.
it: Hai bisogno di imparare come scavare. Premi in basso su un blocco per romperlo. Questo è il miglior modo per scavare buchi, fare tunnel, e generalmente alterare quello che ti circonda.

source: Press down on a block to break it.
it: Premi in basso su un blocco per romperlo.

source: Now that you understand how the simple things in this world work, you must be prepared for the dangers that inhabit the land.
it: Ora che comprendi come le cose più semplici funzionano in questo mondo, devi essere preparato per i pericoli che abitano la terra.

source: Tell the Wizard you know how to break blocks.
it: Dì al Mago che sai come rompere blocchi.

source: When the last beam of sunlight vanishes below the horizon, you can be sure all sorts of dangerous monsters will come looking for food. You don't want to end up as someone's midnight snack!
it: Quando l'ultimo raggio di sole svanisce sotto l'orizzonte, puoi essere certo che tutti i tipi di mostri pericolosi verranno a cercare il cibo.Tu non vuoi finire come lo spuntino di mezzanotte per qualcuno!

source: You will need a torch to see them coming. Collect some wood and let's get started.
it: Avrai bisogno di una torcia per vederli arrivare. Raccogli un po' di legna ed iniziamo.

source: To survive the night, you will need a torch. Torches provide limited protection against monsters. Collect some wood and let's get started.
it: Per sopravvivere la notte, avrai bisogno di una torcia. Le torce forniscono una protezione limitata contro i mostri. Raccogli un po' di legna ed iniziamo.

source: Good. To make torches, you will need to make sticks out of wood.
it: Bene. Per fare le torce, avrai bisogno di fare bastoni con il legno.

source: Tell the Wizard you have collected the piece of wood.
it: Dì al Mago che hai raccolto il pezzo di legno.

source: Craft the wood into planks, then craft the planks into sticks. Open your inventory and drag the wood to an empty crafting slot to begin.
it: Lavora il legno in tavole, poi ricava dei bastoni dalle tavole Apri il tuo inventario e trascina il legno in uno spazio vuoto di lavorazione per cominciare.

source: Follow the instructions on how to craft the items required to create a torch.
it: Segui le istruzioni su come lavorare gli oggetti richiesti per la creazione di una torcia.

source: You can do this by pressing [00FF00]A[-] to grab or place one item, [7777FF]X[-] to grab or place half a stack, or [FFFF00]Y[-] to grab or place the entire stack. Items can also be dropped once they have been grabbed by pressing [FF0000]B[-].
it: Puoi fare ciò premendo [00FF00]A[-] per afferrare o piazzare un oggetto, [7777FF]X[-] per afferrare o piazzare mezza pila, o [FFFF00]Y[-] per afferrare o piazzare l'intera pila. Gli oggetti possono essere lasciati cadere una volta che sono stati afferrati premendo [FF0000]B[-].

source: You can do this by holding the left mouse button and dragging the cursor to grab one item, middle mouse button to grab half a stack, or right mouse button to grab the entire stack. Items can also be dropped by dragging the item away from a valid slot and releasing.
it: È possibile farlo tenendo premuto il tasto sinistro del mouse e trascinando il cursore per prendere un oggetto, il tasto centrale del mouse per prendere mezzo oggetto, o il tasto destro del mouse per prendere l'intero oggetto. Gli oggetti possono essere rilasciati anche trascinando l'oggetto da uno slot valido e rilasciandolo.

source: You can do this by dragging your finger from the item slot to grab one item, or pressing and holding on the item slot to grab the entire stack. Items can also be dropped by dragging the item away from a valid slot and releasing.
it: Puoi far questo trascinando il tuo dito dallo slot oggetti per afferrare un oggetto, o premendo e tenendolo sullo slot oggetti ed afferrare l'intera pila. Gli oggetti possono anche essere rilasciati trascinando l' oggetto e quindi rilasciandolo.

source: Drag wood here
it: Trascina il legno qui

source: Now that you have some planks, you can make sticks. Open your inventory, and drag the planks on the indicated crafting slots.
it: Ora che hai qualche tavola, puoi fare dei bastoni. Apri il tuo inventario, e trascina le tavole negli spazi di lavoro indicati.

source: Drag planks here
it: Trascina le tavole qui

source: Tell the Wizard you have crafted sticks for the torch.
it: Dì al Mago che hai creato i bastoni per la torcia.

source: The last ingredient to make the torch is coal. Coal, which glows a purple hue, is easily found in caves. When you have the coal, speak to me about how to make the torch.
it: L'ultimo ingrediente per fare una torcia è il carbone. Il carbone che risplende con una tonalità color porpora, è facilmente reperibile nelle caverne. Quando hai il carbone, parlami sul come fare una torcia.

source: Tell the Wizard you have collected the piece of coal.
it: Dì al Mago che hai raccolto il pezzo di carbone.

source: Now that you have the ingredients I have asked of you, it is finally time to craft the torch you so desperately require.
it: Ora che hai gli ingredienti che ti avevo chiesto, è finalmente tempo di lavorare la torcia che così disperatamente richiedi.

source: Craft a torch.
it: Lavora una torcia.

source: Good work, but there is still much more to do if you hope to stay alive.
it: Bel lavoro, ma c'è ancora molto da fare se speri di restare vivo.

source: Tell the Wizard you have crafted a torch.
it: Dì al Mago che hai lavorato una torcia.

source: A crafting table is required to make most tools. You will need more wood to get the planks required to make the table. Return when you have crafted the table.
it: Una tavola da lavorazione è richiesta per fare la maggior parte degli strumenti. Avrai bisogno di più legno per avere le tavole richieste per fare il tavolo. Ritorna quando avrai lavorato il tavolo.

source: Craft a crafting table.
it: Lavora un tavolo da lavoro.

source: Tell the Wizard you have crafted a crafting table.
it: Dì al Mago che hai lavorato un tavolo da lavoro.

source: Now that you've made a crafting table, you can craft weapons to protect yourself. Collect a few supplies, then come back and I will show you how.
it: Adesso che hai fatto un tavolo da lavoro, puoi lavorare le armi per proteggere te stesso. Raccogli poche provviste, quindi ritorna e ti dimostrerò come fare.

source: Tell the Wizard you have gathered the ingredients to craft a sword.
it: Dì al Mago che hai riunito gli ingredienti per lavorare la spada.

source: Use the crafting table to craft a sword.
it: Usa il tavolo da lavoro per lavorare una spada.

source: It's time to try out that crafting table. Place it on the ground by pressing L2, and let's use it to craft a sword.
it: E' ora di provare questo tavolo da lavoro. Sistemalo per terra premendo L2, e usiamolo per lavorare una spada.
